module {
  func.func @func1(%arg0: i64, %arg1: memref<2x7xf32>) -> f32 {
    %cst = arith.constant 1.3042999E+9 : f32
    %c951144787_i64 = arith.constant 951144787 : i64
    %c1969275858_i32 = arith.constant 1969275858 : i32
    %c-4009_i16 = arith.constant -4009 : i16
    %true = arith.constant true
    %cst_0 = arith.constant 2.620800e+04 : f16
    %c912109256_i32 = arith.constant 912109256 : i32
    %cst_1 = arith.constant 2.06515507E+9 : f32
    %cst_2 = arith.constant 2.929600e+04 : f16
    %c783155345_i64 = arith.constant 783155345 : i64
    %false = arith.constant false
    %true_3 = arith.constant true
    %c8066_i16 = arith.constant 8066 : i16
    %cst_4 = arith.constant 0x4E6CCC71 : f32
    %false_5 = arith.constant false
    %false_6 = arith.constant false
    %0 = tensor.empty() : tensor<7x3x3xf16>
    %1 = tensor.empty() : tensor<2x7xi1>
    %2 = tensor.empty() : tensor<3x7xi16>
    %3 = tensor.empty() : tensor<7x3x3xi1>
    %4 = tensor.empty() : tensor<2x7xi1>
    %5 = tensor.empty() : tensor<3x7xi16>
    %6 = tensor.empty() : tensor<3x7xi64>
    %7 = tensor.empty() : tensor<2x7xi1>
    %8 = tensor.empty() : tensor<3x2xi16>
    %9 = tensor.empty() : tensor<3x2xi64>
    %10 = tensor.empty() : tensor<7x3x3xi1>
    %11 = tensor.empty() : tensor<7x3x3xi32>
    %12 = tensor.empty() : tensor<3x7xi1>
    %13 = tensor.empty() : tensor<2x7xi1>
    %14 = tensor.empty() : tensor<3x2xi64>
    %15 = tensor.empty() : tensor<2x7xf16>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<3x7xi32>
    %alloc_7 = memref.alloc() : memref<3x2xi16>
    %alloc_8 = memref.alloc() : memref<2x7xi32>
    %alloc_9 = memref.alloc() : memref<3x7xi1>
    %alloc_10 = memref.alloc() : memref<7x3x3xi32>
    %alloc_11 = memref.alloc() : memref<3x2xf32>
    %alloc_12 = memref.alloc() : memref<2x7xf32>
    %alloc_13 = memref.alloc() : memref<3x2xf32>
    %alloc_14 = memref.alloc() : memref<2x7xf32>
    %alloc_15 = memref.alloc() : memref<7x3x3xi64>
    %alloc_16 = memref.alloc() : memref<7x3x3xi16>
    %alloc_17 = memref.alloc() : memref<3x7xi16>
    %alloc_18 = memref.alloc() : memref<3x2xi64>
    %alloc_19 = memref.alloc() : memref<7x3x3xi1>
    %alloc_20 = memref.alloc() : memref<7x3x3xi1>
    %alloc_21 = memref.alloc() : memref<3x7xi64>
    %16 = tensor.empty() : tensor<2x7xi1>
    %17 = linalg.copy ins(%4 : tensor<2x7xi1>) outs(%16 : tensor<2x7xi1>) -> tensor<2x7xi1>
    %18 = tensor.empty() : tensor<3x7x3xi32>
    %transposed = linalg.transpose ins(%alloc_10 : memref<7x3x3xi32>) outs(%18 : tensor<3x7x3xi32>) permutation = [2, 0, 1] 
    %19 = tensor.empty() : tensor<7x3xi32>
    %reduced = linalg.reduce ins(%11 : tensor<7x3x3xi32>) outs(%19 : tensor<7x3xi32>) dimensions = [2] 
      (%in: i32, %init: i32) {
        bufferization.dealloc_tensor %2 : tensor<3x7xi16>
        %expanded_53 = tensor.expand_shape %3 [[0], [1], [2, 3]] : tensor<7x3x3xi1> into tensor<7x3x3x1xi1>
        %expanded_54 = tensor.expand_shape %3 [[0], [1], [2, 3]] : tensor<7x3x3xi1> into tensor<7x3x3x1xi1>
        %251 = arith.negf %cst_4 : f32
        scf.if %false_5 {
          %255 = index.divu %c0, %c0
          %256 = tensor.empty(%c2, %c0) : tensor<?x?xi32>
          %257 = memref.load %alloc[%c0, %c2] : memref<3x7xi32>
          memref.copy %alloc_19, %alloc_20 : memref<7x3x3xi1> to memref<7x3x3xi1>
          %258 = arith.addi %false, %false_6 : i1
          %259 = arith.shli %c8066_i16, %c8066_i16 : i16
          %260 = math.log2 %0 : tensor<7x3x3xf16>
          %261 = arith.cmpf ult, %cst_4, %cst_1 : f32
        } else {
          %255 = index.divs %c2, %c4
          %256 = index.sub %255, %c10
          %257 = arith.shrui %init, %in : i32
          %258 = arith.divui %false_6, %false_5 : i1
          %259 = vector.load %alloc[%c1, %c5] : memref<3x7xi32>, vector<3x7xi32>
          %260 = vector.broadcast %c783155345_i64 : i64 to vector<3xi64>
          %261 = vector.broadcast %c783155345_i64 : i64 to vector<3x3xi64>
          %262 = vector.outerproduct %260, %260, %261 {kind = #vector.kind<minui>} : vector<3xi64>, vector<3xi64>
          %c0_i32 = arith.constant 0 : i32
          %c0_i32_55 = arith.constant 0 : i32
          %263 = vector.transfer_read %18[%c15, %c2, %c14], %c0_i32_55 {permutation_map = affine_map<(d0, d1, d2) -> (0, 0)>} : tensor<3x7x3xi32>, vector<13x3xi32>
          %264 = arith.cmpi ule, %false_6, %false_5 : i1
        }
        %252 = arith.cmpi slt, %c8066_i16, %c8066_i16 : i16
        %253 = arith.cmpi uge, %false, %false_5 : i1
        %254 = math.ctlz %14 : tensor<3x2xi64>
        %c1_i32 = arith.constant 1 : i32
        linalg.yield %c1_i32 : i32
      }
    scf.parallel (%arg2, %arg3) = (%c2, %c4) to (%c8, %c5) step (%c2, %c10) {
      %251 = memref.load %alloc_10[%c2, %c1, %c2] : memref<7x3x3xi32>
      scf.if %false_6 {
        %268 = math.floor %cst_4 : f32
        %269 = affine.max affine_map<(d0, d1) -> (d1 * 8, ((d0 floordiv 32) floordiv 2) * 32)>(%c6, %c1)
        %270 = math.round %15 : tensor<2x7xf16>
        %271 = arith.maxui %c951144787_i64, %c783155345_i64 : i64
        memref.assume_alignment %alloc_16, 8 : memref<7x3x3xi16>
        %272 = vector.broadcast %c1969275858_i32 : i32 to vector<7xi32>
        %273 = vector.broadcast %c912109256_i32 : i32 to vector<7x7xi32>
        %274 = vector.outerproduct %272, %272, %273 {kind = #vector.kind<minsi>} : vector<7xi32>, vector<7xi32>
        %275 = vector.broadcast %c1969275858_i32 : i32 to vector<1xi32>
        %276 = vector.insert %c1969275858_i32, %275 [0] : i32 into vector<1xi32>
        %277 = math.round %cst_2 : f16
      }
      %252 = vector.broadcast %c-4009_i16 : i16 to vector<7x3x3xi16>
      vector.print %252 : vector<7x3x3xi16>
      %253 = affine.apply affine_map<(d0, d1, d2) -> (d0 * 512 + 8)>(%c0, %c15, %c6)
      %254 = index.ceildivu %c12, %c6
      %expanded_53 = tensor.expand_shape %10 [[0], [1], [2, 3]] : tensor<7x3x3xi1> into tensor<7x3x3x1xi1>
      %255 = affine.load %alloc_19[%c14, %c13, %c6] : memref<7x3x3xi1>
      %256 = vector.transpose %252, [0, 2, 1] : vector<7x3x3xi16> to vector<7x3x3xi16>
      %257 = vector.broadcast %c8066_i16 : i16 to vector<3x3x3x3xi16>
      %258 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2, d3, d4) -> (d4, d0, d1)>, affine_map<(d0, d1, d2, d3, d4) -> (d4, d2, d3)>, affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3)>], iterator_types = ["parallel", "parallel", "parallel", "parallel", "reduction"], kind = #vector.kind<maxui>} %252, %252, %257 : vector<7x3x3xi16>, vector<7x3x3xi16> into vector<3x3x3x3xi16>
      %259 = arith.shli %c783155345_i64, %c783155345_i64 : i64
      %260 = vector.extract_strided_slice %252 {offsets = [1, 1], sizes = [5, 1], strides = [1, 1]} : vector<7x3x3xi16> to vector<5x1x3xi16>
      %261 = vector.broadcast %c1969275858_i32 : i32 to vector<7x3x3xi32>
      %262 = vector.broadcast %false_6 : i1 to vector<7x3x3xi1>
      %263 = vector.gather %alloc_8[%c12, %arg2] [%261], %262, %261 : memref<2x7xi32>, vector<7x3x3xi32>, vector<7x3x3xi1>, vector<7x3x3xi32> into vector<7x3x3xi32>
      %264 = arith.cmpi ule, %c912109256_i32, %c912109256_i32 : i32
      %265 = affine.apply affine_map<(d0, d1, d2, d3) -> (1)>(%c6, %c15, %c6, %c1)
      %266 = arith.mulf %cst_4, %cst_1 : f32
      %267 = scf.while (%arg4 = %alloc_9) : (memref<3x7xi1>) -> memref<3x7xi1> {
        %268 = arith.addi %false, %true : i1
        %269 = vector.broadcast %255 : i1 to vector<7xi1>
        %270 = vector.flat_transpose %269 {columns = 7 : i32, rows = 1 : i32} : vector<7xi1> -> vector<7xi1>
        %271 = arith.mulf %cst_2, %cst_2 : f16
        %272 = vector.load %alloc_13[%c2, %c1] : memref<3x2xf32>, vector<7x3x3xf32>
        %273 = arith.cmpi ult, %c8066_i16, %c-4009_i16 : i16
        %274 = index.sub %arg3, %c1
        %275 = vector.insertelement %false_5, %270[%c2 : index] : vector<7xi1>
        %276 = arith.muli %c783155345_i64, %c951144787_i64 : i64
        scf.condition(%false) %arg4 : memref<3x7xi1>
      } do {
      ^bb0(%arg4: memref<3x7xi1>):
        %268 = vector.broadcast %c1969275858_i32 : i32 to vector<7xi32>
        %269 = vector.insertelement %c1969275858_i32, %268[%arg2 : index] : vector<7xi32>
        %270 = arith.divui %255, %255 : i1
        %271 = index.sizeof
        %272 = vector.broadcast %true_3 : i1 to vector<7xi1>
        %273 = vector.multi_reduction <maxsi>, %262, %272 [1, 2] : vector<7x3x3xi1> to vector<7xi1>
        %cast_54 = tensor.cast %4 : tensor<2x7xi1> to tensor<?x?xi1>
        %274 = math.absi %18 : tensor<3x7x3xi32>
        %275 = vector.splat %false_5 : vector<7x3x3xi1>
        %276 = arith.minsi %c783155345_i64, %c951144787_i64 : i64
        %277 = math.powf %cst_1, %cst : f32
        %278 = math.exp2 %cst_2 : f16
        %279 = math.fpowi %cst_4, %c1969275858_i32 : f32, i32
        %280 = math.fma %cst_2, %cst_2, %cst_2 : f16
        %281 = vector.broadcast %c-4009_i16 : i16 to vector<3x3xi16>
        %282 = vector.insert %281, %252 [1] : vector<3x3xi16> into vector<7x3x3xi16>
        %283 = math.fma %15, %15, %15 : tensor<2x7xf16>
        %284 = memref.load %alloc_7[%c0, %c1] : memref<3x2xi16>
        %cast_55 = tensor.cast %6 : tensor<3x7xi64> to tensor<?x?xi64>
        scf.yield %arg4 : memref<3x7xi1>
      }
      scf.yield
    }
    %20 = affine.vector_load %alloc_14[%c9, %c12] : memref<2x7xf32>, vector<3xf32>
    affine.vector_store %20, %alloc_14[%c13, %c6] : memref<2x7xf32>, vector<3xf32>
    %21 = tensor.empty() : tensor<7xi32>
    %alloc_22 = memref.alloc() : memref<7xi32>
    %22 = tensor.empty() : tensor<i32>
    %23 = linalg.dot ins(%21, %alloc_22 : tensor<7xi32>, memref<7xi32>) outs(%22 : tensor<i32>) -> tensor<i32>
    %24 = arith.addf %cst, %cst_4 : f32
    %25 = scf.index_switch %c7 -> index 
    case 1 {
      %251 = arith.maxui %c912109256_i32, %c1969275858_i32 : i32
      %252 = scf.while (%arg2 = %alloc_9) : (memref<3x7xi1>) -> memref<3x7xi1> {
        %inserted_55 = tensor.insert %true into %7[%c1, %c0] : tensor<2x7xi1>
        memref.copy %arg2, %alloc_9 : memref<3x7xi1> to memref<3x7xi1>
        %264 = math.absf %15 : tensor<2x7xf16>
        %265 = math.ctlz %c8066_i16 : i16
        bufferization.dealloc_tensor %9 : tensor<3x2xi64>
        %266 = arith.maxf %cst_4, %cst_4 : f32
        %267 = tensor.empty() : tensor<3x7xf32>
        %268 = vector.broadcast %cst_1 : f32 to vector<7x3x3xf32>
        %269 = vector.broadcast %false_5 : i1 to vector<7x3x3xi1>
        %270 = vector.broadcast %c912109256_i32 : i32 to vector<7x3x3xi32>
        %271 = vector.gather %267[%c4, %c11] [%270], %269, %268 : tensor<3x7xf32>, vector<7x3x3xi32>, vector<7x3x3xi1>, vector<7x3x3xf32> into vector<7x3x3xf32>
        %272 = arith.ori %true_3, %true : i1
        scf.condition(%false) %alloc_9 : memref<3x7xi1>
      } do {
      ^bb0(%arg2: memref<3x7xi1>):
        %264 = math.tan %15 : tensor<2x7xf16>
        %265 = affine.apply affine_map<(d0) -> ((-d0) ceildiv 32)>(%c1)
        %alloca_55 = memref.alloca() : memref<3x7xi1>
        %266 = math.exp %cst_2 : f16
        %267 = arith.cmpf true, %cst, %cst : f32
        %268 = math.round %cst : f32
        %269 = index.mul %c12, %c3
        %270 = math.fma %cst_2, %cst_2, %cst_0 : f16
        %271 = index.ceildivs %c3, %c14
        %272 = arith.minsi %c951144787_i64, %c783155345_i64 : i64
        %273 = math.absi %false_6 : i1
        %274 = index.sub %c11, %c2
        memref.tensor_store %10, %alloc_19 : memref<7x3x3xi1>
        %275 = index.ceildivs %c5, %c2
        %276 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %20, %20, %cst : vector<3xf32>, vector<3xf32> into f32
        %277 = math.ctlz %10 : tensor<7x3x3xi1>
        scf.yield %arg2 : memref<3x7xi1>
      }
      %253 = arith.maxf %cst_0, %cst_2 : f16
      %254 = math.log2 %15 : tensor<2x7xf16>
      %255 = arith.shli %true_3, %true : i1
      %256 = arith.muli %c1969275858_i32, %c1969275858_i32 : i32
      %257 = vector.flat_transpose %20 {columns = 3 : i32, rows = 1 : i32} : vector<3xf32> -> vector<3xf32>
      %258 = bufferization.clone %alloc_7 : memref<3x2xi16> to memref<3x2xi16>
      %259 = scf.while (%arg2 = %alloc_11) : (memref<3x2xf32>) -> memref<3x2xf32> {
        %264 = vector.broadcast %cst : f32 to vector<3x7xf32>
        %265 = vector.fma %264, %264, %264 : vector<3x7xf32>
        %266 = vector.insertelement %cst_1, %20[%c1 : index] : vector<3xf32>
        %267 = math.roundeven %15 : tensor<2x7xf16>
        %268 = vector.broadcast %cst_1 : f32 to vector<7xf32>
        %269 = vector.contract {indexing_maps = [affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0)>], iterator_types = ["parallel", "reduction"], kind = #vector.kind<add>} %264, %20, %268 : vector<3x7xf32>, vector<3xf32> into vector<7xf32>
        %270 = math.floor %0 : tensor<7x3x3xf16>
        %271 = arith.cmpi sge, %true, %false_6 : i1
        %272 = arith.addf %cst_0, %cst_2 : f16
        %273 = arith.remf %cst_0, %cst_0 : f16
        scf.condition(%false) %arg2 : memref<3x2xf32>
      } do {
      ^bb0(%arg2: memref<3x2xf32>):
        %264 = index.maxs %c15, %c7
        %265 = arith.negf %cst_0 : f16
        %266 = vector.flat_transpose %20 {columns = 3 : i32, rows = 1 : i32} : vector<3xf32> -> vector<3xf32>
        %c934995568_i32 = arith.constant 934995568 : i32
        %267 = math.absf %cst_1 : f32
        %268 = vector.broadcast %cst_1 : f32 to vector<7x3x3xf32>
        %269 = vector.fma %268, %268, %268 : vector<7x3x3xf32>
        %270 = math.ctlz %17 : tensor<2x7xi1>
        %271 = arith.xori %c912109256_i32, %c1969275858_i32 : i32
        %272 = affine.max affine_map<(d0, d1) -> ((d0 mod 8) mod 128, d1 * 2)>(%c12, %c6)
        %true_55 = arith.constant true
        %false_56 = arith.constant false
        %273 = vector.transfer_read %4[%c14, %c6], %false_56 : tensor<2x7xi1>, vector<i1>
        %274 = math.round %0 : tensor<7x3x3xf16>
        %275 = vector.multi_reduction <add>, %266, %20 [] : vector<3xf32> to vector<3xf32>
        %276 = math.log1p %0 : tensor<7x3x3xf16>
        %277 = math.floor %0 : tensor<7x3x3xf16>
        %alloca_57 = memref.alloca() : memref<7x3x3xf16>
        vector.print %269 : vector<7x3x3xf32>
        scf.yield %arg2 : memref<3x2xf32>
      }
      %from_elements_53 = tensor.from_elements %cst_0, %cst_0, %cst_2, %cst_2, %cst_2, %cst_0 : tensor<3x2xf16>
      %inserted_54 = tensor.insert %c8066_i16 into %2[%c2, %c5] : tensor<3x7xi16>
      %260 = arith.xori %false_5, %false_5 : i1
      %261 = affine.max affine_map<(d0, d1, d2) -> (d2 * 64, d0)>(%c12, %c2, %c11)
      %262 = math.ctlz %12 : tensor<3x7xi1>
      bufferization.dealloc_tensor %0 : tensor<7x3x3xf16>
      %263 = vector.load %alloc[%c2, %c4] : memref<3x7xi32>, vector<7x3x3xi32>
      scf.yield %c8 : index
    }
    default {
      %251 = math.fpowi %cst, %c912109256_i32 : f32, i32
      %252 = arith.remui %true_3, %true : i1
      %253 = arith.minsi %c8066_i16, %c-4009_i16 : i16
      %cast_53 = tensor.cast %reduced : tensor<7x3xi32> to tensor<?x?xi32>
      %254 = math.log %15 : tensor<2x7xf16>
      %255 = math.expm1 %cst : f32
      %256 = bufferization.to_memref %3 : memref<7x3x3xi1>
      %257 = math.absi %false_6 : i1
      %258 = math.log1p %cst_4 : f32
      affine.store %c912109256_i32, %alloc_8[%c4, %c13] : memref<2x7xi32>
      %259 = vector.extract_strided_slice %20 {offsets = [0], sizes = [1], strides = [1]} : vector<3xf32> to vector<1xf32>
      vector.print %259 : vector<1xf32>
      %260 = arith.addf %cst_1, %cst : f32
      %261 = arith.cmpi ne, %c783155345_i64, %c951144787_i64 : i64
      %262 = scf.while (%arg2 = %c1969275858_i32) : (i32) -> i32 {
        %264 = arith.addf %cst_0, %cst_2 : f16
        %alloc_54 = memref.alloc() : memref<2x7xi16>
        %265 = vector.broadcast %c8066_i16 : i16 to vector<2x7xi16>
        %266 = vector.broadcast %false_6 : i1 to vector<2x7xi1>
        %267 = vector.broadcast %arg2 : i32 to vector<2x7xi32>
        %268 = vector.gather %alloc_54[%c3, %c1] [%267], %266, %265 : memref<2x7xi16>, vector<2x7xi32>, vector<2x7xi1>, vector<2x7xi16> into vector<2x7xi16>
        %269 = vector.bitcast %259 : vector<1xf32> to vector<1xf32>
        %270 = math.fpowi %cst, %arg2 : f32, i32
        %271 = math.round %15 : tensor<2x7xf16>
        %272 = arith.cmpi sgt, %c8066_i16, %c8066_i16 : i16
        %cast_55 = tensor.cast %0 : tensor<7x3x3xf16> to tensor<?x?x?xf16>
        %273 = vector.bitcast %265 : vector<2x7xi16> to vector<2x7xi16>
        scf.condition(%true_3) %arg2 : i32
      } do {
      ^bb0(%arg2: i32):
        %264 = math.ctlz %11 : tensor<7x3x3xi32>
        %265 = memref.atomic_rmw assign %cst, %alloc_13[%c2, %c0] : (f32, memref<3x2xf32>) -> f32
        %alloca_54 = memref.alloca() : memref<7x3x3xi64>
        %266 = index.add %c5, %c15
        %267 = math.expm1 %cst : f32
        %268 = vector.broadcast %c8066_i16 : i16 to vector<3x2xi16>
        %269 = vector.broadcast %true_3 : i1 to vector<3x2xi1>
        %270 = vector.broadcast %c912109256_i32 : i32 to vector<3x2xi32>
        %271 = vector.gather %alloc_16[%266, %c11, %c3] [%270], %269, %268 : memref<7x3x3xi16>, vector<3x2xi32>, vector<3x2xi1>, vector<3x2xi16> into vector<3x2xi16>
        %272 = arith.addf %cst, %cst : f32
        %273 = arith.subi %arg2, %c1969275858_i32 : i32
        %274 = vector.broadcast %arg2 : i32 to vector<3xi32>
        %275 = vector.transfer_write %274, %11[%c15, %c6, %c8] {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : vector<3xi32>, tensor<7x3x3xi32>
        %276 = vector.flat_transpose %20 {columns = 3 : i32, rows = 1 : i32} : vector<3xf32> -> vector<3xf32>
        %277 = math.ipowi %22, %23 : tensor<i32>
        %278 = memref.load %alloc[%c2, %c2] : memref<3x7xi32>
        %279 = arith.remui %false_6, %false_6 : i1
        affine.store %false_6, %alloc_19[%c11, %c14, %c10] : memref<7x3x3xi1>
        %280 = math.round %15 : tensor<2x7xf16>
        %281 = arith.remf %cst_0, %cst_0 : f16
        scf.yield %c1969275858_i32 : i32
      }
      %263 = math.expm1 %15 : tensor<2x7xf16>
      scf.yield %c5 : index
    }
    %26 = vector.create_mask %c12, %c3 : vector<3x2xi1>
    %collapsed = tensor.collapse_shape %12 [[0, 1]] : tensor<3x7xi1> into tensor<21xi1>
    %27 = math.tan %0 : tensor<7x3x3xf16>
    %28 = affine.max affine_map<(d0) -> (0)>(%c1)
    %29 = vector.flat_transpose %20 {columns = 3 : i32, rows = 1 : i32} : vector<3xf32> -> vector<3xf32>
    %30 = arith.remui %false_5, %true_3 : i1
    %31 = arith.minsi %c951144787_i64, %c783155345_i64 : i64
    %32 = vector.insert %cst_4, %29 [1] : f32 into vector<3xf32>
    %33 = math.powf %cst, %cst : f32
    %34 = affine.load %alloc[%c12, %c11] : memref<3x7xi32>
    %35 = index.floordivs %28, %c5
    %extracted = tensor.extract %10[%c5, %c0, %c1] : tensor<7x3x3xi1>
    %36 = math.round %cst_2 : f16
    %37 = index.floordivs %c7, %c14
    %38 = math.log1p %15 : tensor<2x7xf16>
    %39 = math.roundeven %0 : tensor<7x3x3xf16>
    %40 = affine.for %arg2 = 0 to 50 iter_args(%arg3 = %29) -> (vector<3xf32>) {
      affine.yield %20 : vector<3xf32>
    }
    %41 = vector.insertelement %cst, %29[%c13 : index] : vector<3xf32>
    %42 = vector.create_mask %c7, %c12 : vector<3x7xi1>
    %43 = vector.broadcast %c12 : index to vector<3xindex>
    %44 = vector.broadcast %false_5 : i1 to vector<3xi1>
    %45 = vector.broadcast %c-4009_i16 : i16 to vector<3xi16>
    vector.scatter %alloc_16[%c2, %c0, %c2] [%43], %44, %45 : memref<7x3x3xi16>, vector<3xindex>, vector<3xi1>, vector<3xi16>
    %46 = scf.index_switch %c3 -> vector<7x3x3xf16> 
    case 1 {
      %251 = tensor.empty() : tensor<2x2xi64>
      %252 = tensor.empty() : tensor<3x2xi64>
      %253 = linalg.matmul ins(%14, %251 : tensor<3x2xi64>, tensor<2x2xi64>) outs(%252 : tensor<3x2xi64>) -> tensor<3x2xi64>
      %254 = arith.addf %cst_0, %cst_2 : f16
      %255 = arith.addf %cst_4, %cst_1 : f32
      %expanded_53 = tensor.expand_shape %reduced [[0], [1, 2]] : tensor<7x3xi32> into tensor<7x3x1xi32>
      %256 = memref.atomic_rmw muli %c8066_i16, %alloc_16[%c2, %c2, %c1] : (i16, memref<7x3x3xi16>) -> i16
      %257 = index.sub %c15, %c4
      %258 = math.ctlz %11 : tensor<7x3x3xi32>
      %259 = affine.max affine_map<(d0) -> (d0 * 2, ((d0 * 9) ceildiv 16) ceildiv 16, (d0 * 7) mod 16 + 2)>(%28)
      %260 = arith.ceildivsi %true_3, %true : i1
      %alloc_54 = memref.alloc() : memref<7x2xi16>
      %261 = tensor.empty() : tensor<3x2xi16>
      %262 = linalg.matmul ins(%5, %alloc_54 : tensor<3x7xi16>, memref<7x2xi16>) outs(%261 : tensor<3x2xi16>) -> tensor<3x2xi16>
      %263 = vector.splat %28 : vector<3x2xindex>
      %264 = index.floordivs %c9, %35
      %265 = math.ctlz %11 : tensor<7x3x3xi32>
      %266 = math.absf %15 : tensor<2x7xf16>
      %267 = vector.splat %cst_4 : vector<3x7xf32>
      %268 = vector.splat %c7 : vector<3x2xindex>
      %269 = vector.broadcast %cst_0 : f16 to vector<7x3x3xf16>
      scf.yield %269 : vector<7x3x3xf16>
    }
    case 2 {
      %251 = vector.insertelement %cst_1, %20[%c2 : index] : vector<3xf32>
      %alloca_53 = memref.alloca() : memref<3x7xi1>
      %252 = math.exp2 %15 : tensor<2x7xf16>
      %253 = arith.cmpf ogt, %cst_0, %cst_2 : f16
      %true_54 = arith.constant true
      %false_55 = arith.constant false
      %254 = vector.transfer_read %1[%c15, %c3], %false_55 : tensor<2x7xi1>, vector<i1>
      %alloc_56 = memref.alloc() : memref<3x2xi16>
      memref.copy %alloc_7, %alloc_56 : memref<3x2xi16> to memref<3x2xi16>
      %255 = arith.minf %cst, %cst : f32
      %256 = math.ipowi %9, %14 : tensor<3x2xi64>
      memref.alloca_scope  {
        %264 = math.atan %0 : tensor<7x3x3xf16>
        %265 = vector.insertelement %cst_4, %20[%c8 : index] : vector<3xf32>
        %false_58 = arith.constant false
        %false_59 = arith.constant false
        %266 = vector.transfer_read %7[%c2, %c9], %false_59 : tensor<2x7xi1>, vector<i1>
        %267 = math.expm1 %15 : tensor<2x7xf16>
        %268 = math.floor %cst_2 : f16
        %269 = index.sub %c6, %c8
        %270 = math.log1p %15 : tensor<2x7xf16>
        %alloca_60 = memref.alloca() : memref<3x7xf32>
        %271 = vector.splat %false : vector<7x3x3xi1>
        %272 = math.ctpop %2 : tensor<3x7xi16>
        %273 = index.add %c5, %c11
        %274 = arith.maxsi %true, %false_6 : i1
        affine.store %false_6, %alloc_19[%c7, %c13, %c11] : memref<7x3x3xi1>
        %275 = affine.max affine_map<(d0, d1, d2) -> (d2 ceildiv 4, 0)>(%c11, %35, %c14)
        %276 = index.divu %c12, %c2
        %277 = index.maxu %c9, %c12
        %278 = vector.bitcast %26 : vector<3x2xi1> to vector<3x2xi1>
        memref.assume_alignment %alloc_17, 16 : memref<3x7xi16>
        vector.print %29 : vector<3xf32>
        %279 = math.exp %cst_2 : f16
        %280 = vector.bitcast %42 : vector<3x7xi1> to vector<3x7xi1>
        %281 = index.maxs %277, %275
        %282 = arith.divui %false, %true_54 : i1
        %283 = arith.xori %extracted, %true_3 : i1
        %expanded_61 = tensor.expand_shape %10 [[0], [1], [2, 3]] : tensor<7x3x3xi1> into tensor<7x3x3x1xi1>
        %alloca_62 = memref.alloca() : memref<3x7xi16>
        %284 = math.tan %15 : tensor<2x7xf16>
        %285 = arith.subi %false_58, %false : i1
        %286 = arith.cmpi sge, %c1969275858_i32, %c1969275858_i32 : i32
        %287 = bufferization.to_tensor %alloc_15 : memref<7x3x3xi64>
        %288 = math.absf %cst_2 : f16
        %289 = arith.shli %c-4009_i16, %c8066_i16 : i16
      }
      %257 = arith.negf %cst_1 : f32
      %extracted_57 = tensor.extract %15[%c0, %c3] : tensor<2x7xf16>
      %258 = index.castu %c11 : index to i32
      %259 = arith.remsi %true_54, %false : i1
      %260 = index.divu %c11, %28
      %261 = index.floordivs %28, %260
      %262 = math.absf %cst_4 : f32
      %263 = vector.broadcast %extracted_57 : f16 to vector<7x3x3xf16>
      scf.yield %263 : vector<7x3x3xf16>
    }
    default {
      %251 = vector.broadcast %c15 : index to vector<3xindex>
      %252 = vector.broadcast %false_6 : i1 to vector<3xi1>
      %253 = vector.broadcast %c-4009_i16 : i16 to vector<3xi16>
      vector.scatter %alloc_17[%c0, %c3] [%251], %252, %253 : memref<3x7xi16>, vector<3xindex>, vector<3xi1>, vector<3xi16>
      %254 = arith.addf %cst_1, %cst : f32
      %inserted_53 = tensor.insert %c-4009_i16 into %8[%c0, %c1] : tensor<3x2xi16>
      %255 = scf.if %false_6 -> (memref<2x7xi32>) {
        %269 = affine.min affine_map<(d0, d1) -> (-d1 - 4, d0, -d1 - 4, -d1 - 4)>(%c13, %c2)
        memref.copy %alloc_13, %alloc_11 : memref<3x2xf32> to memref<3x2xf32>
        %270 = math.ipowi %3, %10 : tensor<7x3x3xi1>
        %271 = arith.maxf %cst_1, %cst_4 : f32
        %alloc_55 = memref.alloc() : memref<7x7xi16>
        %272 = tensor.empty() : tensor<3x7xi16>
        %273 = linalg.matmul ins(%5, %alloc_55 : tensor<3x7xi16>, memref<7x7xi16>) outs(%272 : tensor<3x7xi16>) -> tensor<3x7xi16>
        %274 = index.ceildivu %c7, %c0
        %alloca_56 = memref.alloca() : memref<2x7xi32>
        %275 = vector.insert %cst, %20 [0] : f32 into vector<3xf32>
        scf.yield %alloc_8 : memref<2x7xi32>
      } else {
        %269 = arith.remf %cst_4, %cst_4 : f32
        %270 = math.expm1 %cst_4 : f32
        %alloca_55 = memref.alloca() : memref<3x7xf32>
        %271 = tensor.empty() : tensor<7x7xi1>
        %272 = tensor.empty() : tensor<2x7xi1>
        %273 = linalg.matmul ins(%1, %271 : tensor<2x7xi1>, tensor<7x7xi1>) outs(%272 : tensor<2x7xi1>) -> tensor<2x7xi1>
        %cast_56 = tensor.cast %5 : tensor<3x7xi16> to tensor<?x?xi16>
        %274 = vector.broadcast %c4 : index to vector<2xindex>
        %275 = vector.broadcast %false_6 : i1 to vector<2xi1>
        %276 = vector.broadcast %cst_4 : f32 to vector<2xf32>
        vector.scatter %alloc_14[%c0, %c2] [%274], %275, %276 : memref<2x7xf32>, vector<2xindex>, vector<2xi1>, vector<2xf32>
        %277 = affine.min affine_map<(d0, d1, d2) -> (d1 mod 32 - (d1 - 1), d2 - (d1 - 1), d2, d2 + 128)>(%37, %37, %c5)
        %c-10832_i16 = arith.constant -10832 : i16
        scf.yield %alloc_8 : memref<2x7xi32>
      }
      %256 = vector.matrix_multiply %20, %29 {lhs_columns = 3 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<3xf32>, vector<3xf32>) -> vector<1xf32>
      %257 = vector.multi_reduction <mul>, %42, %42 [] : vector<3x7xi1> to vector<3x7xi1>
      %258 = vector.broadcast %c1969275858_i32 : i32 to vector<i32>
      %259 = vector.transfer_write %258, %21[%c7] : vector<i32>, tensor<7xi32>
      %260 = index.maxu %c8, %37
      %261 = arith.minsi %34, %c912109256_i32 : i32
      %extracted_54 = tensor.extract %11[%c3, %c0, %c0] : tensor<7x3x3xi32>
      %262 = arith.minf %cst_0, %cst_2 : f16
      %263 = scf.while (%arg2 = %c8066_i16) : (i16) -> i16 {
        %inserted_55 = tensor.insert %c912109256_i32 into %19[%c1, %c2] : tensor<7x3xi32>
        %269 = math.log %cst_0 : f16
        %270 = arith.maxf %cst_4, %cst_4 : f32
        %271 = arith.addf %cst_1, %cst_4 : f32
        %272 = math.log2 %0 : tensor<7x3x3xf16>
        %273 = arith.floordivsi %arg2, %c8066_i16 : i16
        %274 = bufferization.to_memref %10 : memref<7x3x3xi1>
        %275 = arith.ori %34, %extracted_54 : i32
        scf.condition(%true_3) %arg2 : i16
      } do {
      ^bb0(%arg2: i16):
        %269 = index.add %c5, %37
        %270 = vector.bitcast %42 : vector<3x7xi1> to vector<3x7xi1>
        %271 = arith.maxf %cst_1, %cst : f32
        %272 = arith.maxsi %34, %c1969275858_i32 : i32
        %273 = math.floor %0 : tensor<7x3x3xf16>
        %274 = arith.remui %false_6, %false : i1
        %expanded_55 = tensor.expand_shape %15 [[0], [1, 2]] : tensor<2x7xf16> into tensor<2x7x1xf16>
        %275 = arith.cmpi ugt, %extracted_54, %c1969275858_i32 : i32
        %276 = arith.cmpi ugt, %c951144787_i64, %c951144787_i64 : i64
        %277 = vector.splat %c4 : vector<2x7xindex>
        %278 = vector.broadcast %true_3 : i1 to vector<2xi1>
        %279 = vector.insert %278, %26 [2] : vector<2xi1> into vector<3x2xi1>
        %280 = arith.maxf %cst_4, %cst_4 : f32
        %281 = math.roundeven %0 : tensor<7x3x3xf16>
        %282 = affine.apply affine_map<(d0) -> ((-d0) ceildiv 32)>(%c10)
        %283 = bufferization.to_memref %23 : memref<i32>
        %284 = math.tan %15 : tensor<2x7xf16>
        scf.yield %c8066_i16 : i16
      }
      %264 = index.ceildivs %c10, %c13
      %265 = scf.while (%arg2 = %alloc) : (memref<3x7xi32>) -> memref<3x7xi32> {
        %269 = arith.addi %true_3, %extracted : i1
        %270 = arith.remf %cst_4, %cst : f32
        %271 = index.divu %28, %c2
        %272 = arith.minf %cst_0, %cst_2 : f16
        %273 = arith.remui %extracted, %true : i1
        %274 = tensor.empty(%c15) : tensor<7x?x3xi32>
        %false_55 = arith.constant false
        %false_56 = arith.constant false
        %275 = vector.transfer_read %3[%c5, %c4, %37], %false_56 : tensor<7x3x3xi1>, vector<i1>
        %276 = math.fma %15, %15, %15 : tensor<2x7xf16>
        scf.condition(%false_55) %alloc : memref<3x7xi32>
      } do {
      ^bb0(%arg2: memref<3x7xi32>):
        %269 = vector.flat_transpose %20 {columns = 3 : i32, rows = 1 : i32} : vector<3xf32> -> vector<3xf32>
        %270 = arith.shli %extracted, %true : i1
        memref.tensor_store %6, %alloc_21 : memref<3x7xi64>
        %271 = vector.reduction <add>, %20 : vector<3xf32> into f32
        %272 = arith.maxui %c1969275858_i32, %extracted_54 : i32
        %273 = vector.insert %cst, %29 [2] : f32 into vector<3xf32>
        %274 = vector.broadcast %extracted : i1 to vector<3xi1>
        %275 = vector.multi_reduction <minui>, %26, %274 [1] : vector<3x2xi1> to vector<3xi1>
        %276 = arith.maxsi %c8066_i16, %c8066_i16 : i16
        %277 = index.ceildivs %c12, %c14
        %278 = math.tan %15 : tensor<2x7xf16>
        %279 = arith.cmpi sge, %false, %false : i1
        %280 = arith.remf %cst_2, %cst_0 : f16
        affine.store %cst, %alloc_11[%c13, %c1] : memref<3x2xf32>
        %281 = math.round %cst_4 : f32
        %282 = vector.broadcast %extracted : i1 to vector<2xi1>
        %dest_55, %accumulated_value_56 = vector.scan <maxsi>, %26, %282 {inclusive = true, reduction_dim = 0 : i64} : vector<3x2xi1>, vector<2xi1>
        %283 = arith.ori %true_3, %false : i1
        scf.yield %arg2 : memref<3x7xi32>
      }
      %266 = math.fpowi %cst_4, %34 : f32, i32
      %267 = vector.flat_transpose %20 {columns = 3 : i32, rows = 1 : i32} : vector<3xf32> -> vector<3xf32>
      %268 = vector.broadcast %cst_0 : f16 to vector<7x3x3xf16>
      scf.yield %268 : vector<7x3x3xf16>
    }
    %47 = arith.cmpi ugt, %c8066_i16, %c8066_i16 : i16
    %48 = vector.flat_transpose %20 {columns = 3 : i32, rows = 1 : i32} : vector<3xf32> -> vector<3xf32>
    vector.print %26 : vector<3x2xi1>
    %49 = arith.addi %c912109256_i32, %34 : i32
    %50 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %29, %48, %cst_1 : vector<3xf32>, vector<3xf32> into f32
    memref.assume_alignment %alloc_13, 1 : memref<3x2xf32>
    %51 = math.rsqrt %cst_4 : f32
    %52 = arith.addf %cst_0, %cst_0 : f16
    memref.tensor_store %3, %alloc_19 : memref<7x3x3xi1>
    %53 = arith.muli %c1969275858_i32, %c1969275858_i32 : i32
    %54 = bufferization.to_memref %7 : memref<2x7xi1>
    %55 = math.ctlz %5 : tensor<3x7xi16>
    %56 = math.roundeven %cst_1 : f32
    %57 = scf.while (%arg2 = %alloc_22) : (memref<7xi32>) -> memref<7xi32> {
      %c2023949239_i32 = arith.constant 2023949239 : i32
      %251 = math.atan2 %cst, %cst_1 : f32
      %252 = math.round %cst : f32
      %253 = math.roundeven %cst_2 : f16
      %254 = memref.atomic_rmw assign %c783155345_i64, %alloc_21[%c0, %c3] : (i64, memref<3x7xi64>) -> i64
      %255 = math.floor %cst : f32
      vector.print %26 : vector<3x2xi1>
      %256 = affine.max affine_map<(d0) -> (d0)>(%c6)
      scf.condition(%extracted) %alloc_22 : memref<7xi32>
    } do {
    ^bb0(%arg2: memref<7xi32>):
      %251 = math.exp %0 : tensor<7x3x3xf16>
      affine.store %34, %alloc_22[%c7] : memref<7xi32>
      %252 = math.fma %cst_1, %cst, %cst_4 : f32
      %253 = tensor.empty() : tensor<3x2xi32>
      %254 = arith.muli %c951144787_i64, %c783155345_i64 : i64
      %255 = vector.load %alloc_14[%c0, %c0] : memref<2x7xf32>, vector<3x2xf32>
      %alloc_53 = memref.alloc() : memref<3x2xi1>
      %256 = math.log2 %cst_2 : f16
      %257 = arith.minf %cst_4, %cst : f32
      %258 = math.round %15 : tensor<2x7xf16>
      %259 = vector.multi_reduction <mul>, %255, %48 [1] : vector<3x2xf32> to vector<3xf32>
      %260 = scf.index_switch %c8 -> tensor<3x7xf32> 
      case 1 {
        %265 = arith.minsi %true_3, %true_3 : i1
        %266 = arith.mulf %cst, %cst_4 : f32
        %267 = vector.splat %cst_4 : vector<2x7xf32>
        %268 = math.expm1 %cst_2 : f16
        %269 = vector.extract_strided_slice %26 {offsets = [1], sizes = [1], strides = [1]} : vector<3x2xi1> to vector<1x2xi1>
        %270 = math.fpowi %0, %11 : tensor<7x3x3xf16>, tensor<7x3x3xi32>
        affine.store %cst_4, %alloc_12[%c15, %c7] : memref<2x7xf32>
        %271 = arith.mulf %cst_0, %cst_0 : f16
        %272 = math.absi %2 : tensor<3x7xi16>
        %273 = index.add %c8, %28
        %274 = math.floor %0 : tensor<7x3x3xf16>
        %275 = math.fpowi %cst, %34 : f32, i32
        %276 = vector.multi_reduction <add>, %42, %42 [] : vector<3x7xi1> to vector<3x7xi1>
        %277 = math.atan2 %15, %15 : tensor<2x7xf16>
        %278 = math.round %cst_1 : f32
        %expanded_54 = tensor.expand_shape %0 [[0], [1], [2, 3]] : tensor<7x3x3xf16> into tensor<7x3x3x1xf16>
        %279 = tensor.empty() : tensor<3x7xf32>
        scf.yield %279 : tensor<3x7xf32>
      }
      default {
        %265 = arith.maxf %cst_1, %cst : f32
        %266 = vector.insert %cst_4, %20 [1] : f32 into vector<3xf32>
        %extracted_54 = tensor.extract %6[%c0, %c4] : tensor<3x7xi64>
        %267 = math.round %0 : tensor<7x3x3xf16>
        %268 = affine.load %alloc_9[%c2, %c6] : memref<3x7xi1>
        %cst_55 = arith.constant 4.774400e+04 : f16
        %269 = arith.addi %true, %268 : i1
        %270 = arith.maxf %cst_1, %cst_4 : f32
        %271 = math.fpowi %cst_0, %34 : f16, i32
        %272 = vector.load %alloc_13[%c2, %c0] : memref<3x2xf32>, vector<2x7xf32>
        %273 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<add>} %20, %20, %cst_4 : vector<3xf32>, vector<3xf32> into f32
        %274 = arith.ori %true, %false : i1
        %275 = index.ceildivs %c3, %c1
        %276 = arith.remf %cst, %cst_1 : f32
        %277 = arith.remf %cst_4, %cst : f32
        %278 = arith.cmpi sge, %extracted_54, %c951144787_i64 : i64
        %279 = tensor.empty() : tensor<3x7xf32>
        scf.yield %279 : tensor<3x7xf32>
      }
      %261 = math.log2 %0 : tensor<7x3x3xf16>
      %262 = scf.if %false_6 -> (memref<2x7xi1>) {
        %265 = math.atan2 %cst_0, %cst_2 : f16
        %266 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %48, %29, %cst_1 : vector<3xf32>, vector<3xf32> into f32
        %267 = math.atan2 %cst, %cst_1 : f32
        %268 = math.powf %0, %0 : tensor<7x3x3xf16>
        %269 = arith.divui %34, %34 : i32
        %c907213980_i64 = arith.constant 907213980 : i64
        vector.print %26 : vector<3x2xi1>
        %c13328_i16 = arith.constant 13328 : i16
        scf.yield %54 : memref<2x7xi1>
      } else {
        %265 = math.fpowi %cst_4, %c1969275858_i32 : f32, i32
        %266 = vector.load %alloc_18[%c0, %c1] : memref<3x2xi64>, vector<3x7xi64>
        %267 = math.log %15 : tensor<2x7xf16>
        %268 = math.log1p %cst_0 : f16
        %269 = affine.max affine_map<(d0) -> (d0 floordiv 2)>(%c14)
        %270 = arith.minsi %c1969275858_i32, %c1969275858_i32 : i32
        %271 = arith.minsi %false_6, %false : i1
        %cast_54 = tensor.cast %10 : tensor<7x3x3xi1> to tensor<?x?x?xi1>
        scf.yield %54 : memref<2x7xi1>
      }
      %263 = math.tan %15 : tensor<2x7xf16>
      %264 = math.cttz %c783155345_i64 : i64
      scf.yield %alloc_22 : memref<7xi32>
    }
    %58 = arith.remf %cst_2, %cst_0 : f16
    %59 = affine.min affine_map<(d0, d1) -> (d0)>(%c9, %c3)
    %60 = math.copysign %cst_4, %cst_4 : f32
    %alloca = memref.alloca() : memref<7x3x3xi32>
    %61 = arith.negf %cst_0 : f16
    %62 = index.ceildivs %c15, %c2
    %63 = scf.while (%arg2 = %alloc) : (memref<3x7xi32>) -> memref<3x7xi32> {
      %251 = vector.broadcast %false_6 : i1 to vector<7xi1>
      %252 = vector.insert %251, %42 [1] : vector<7xi1> into vector<3x7xi1>
      %253 = index.divu %62, %c12
      %cast_53 = tensor.cast %9 : tensor<3x2xi64> to tensor<?x?xi64>
      %254 = arith.maxf %cst_4, %cst : f32
      %255 = vector.reduction <maxsi>, %251 : vector<7xi1> into i1
      %256 = memref.atomic_rmw assign %c8066_i16, %alloc_7[%c1, %c1] : (i16, memref<3x2xi16>) -> i16
      %257 = vector.multi_reduction <add>, %42, %251 [0] : vector<3x7xi1> to vector<7xi1>
      %258 = affine.max affine_map<(d0, d1) -> (d1, (d0 + 128) * 2, (d0 + 128) * 2, -(d0 + 128))>(%c8, %c13)
      scf.condition(%false_5) %arg2 : memref<3x7xi32>
    } do {
    ^bb0(%arg2: memref<3x7xi32>):
      %251 = arith.maxui %34, %c912109256_i32 : i32
      %252 = vector.multi_reduction <add>, %20, %29 [] : vector<3xf32> to vector<3xf32>
      %alloc_53 = memref.alloc() : memref<3x2xi64>
      memref.copy %alloc_18, %alloc_53 : memref<3x2xi64> to memref<3x2xi64>
      %253 = math.roundeven %cst_4 : f32
      %254 = index.sub %c13, %c12
      %255 = math.floor %cst_2 : f16
      %256 = affine.for %arg3 = 0 to 82 iter_args(%arg4 = %extracted) -> (i1) {
        affine.yield %arg4 : i1
      }
      %257 = math.round %15 : tensor<2x7xf16>
      %258 = scf.while (%arg3 = %alloc_21) : (memref<3x7xi64>) -> memref<3x7xi64> {
        %266 = index.maxu %c4, %c0
        %267 = arith.remui %extracted, %true_3 : i1
        %268 = math.absf %cst_1 : f32
        %269 = arith.remsi %c1969275858_i32, %c912109256_i32 : i32
        %270 = arith.maxf %cst_4, %cst_1 : f32
        %271 = math.log2 %cst : f32
        %272 = affine.min affine_map<(d0) -> (d0 + 128, d0 * -63 - (d0 * -63 - (d0 + 128) + d0 + 128 + 64) - 64, d0)>(%c9)
        %extracted_54 = tensor.extract %reduced[%c1, %c2] : tensor<7x3xi32>
        scf.condition(%false) %arg3 : memref<3x7xi64>
      } do {
      ^bb0(%arg3: memref<3x7xi64>):
        %266 = math.exp2 %cst_2 : f16
        %267 = arith.shrui %c783155345_i64, %c783155345_i64 : i64
        %268 = arith.remf %cst, %cst_4 : f32
        %269 = bufferization.clone %alloc_17 : memref<3x7xi16> to memref<3x7xi16>
        vector.print %42 : vector<3x7xi1>
        %270 = math.ceil %cst_0 : f16
        %271 = math.floor %0 : tensor<7x3x3xf16>
        %272 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %48, %48, %cst_4 : vector<3xf32>, vector<3xf32> into f32
        %273 = math.exp %cst_0 : f16
        %274 = index.maxs %c4, %c7
        %275 = arith.remsi %false_6, %true : i1
        %276 = vector.broadcast %false_5 : i1 to vector<3xi1>
        %dest_54, %accumulated_value_55 = vector.scan <xor>, %26, %276 {inclusive = false, reduction_dim = 1 : i64} : vector<3x2xi1>, vector<3xi1>
        %277 = affine.load %alloc_13[%c4, %c13] : memref<3x2xf32>
        %278 = arith.cmpi ne, %c8066_i16, %c-4009_i16 : i16
        %279 = arith.remui %c951144787_i64, %c783155345_i64 : i64
        %280 = vector.bitcast %29 : vector<3xf32> to vector<3xf32>
        scf.yield %arg3 : memref<3x7xi64>
      }
      %259 = affine.min affine_map<(d0, d1, d2) -> (d0 + d2 ceildiv 16, 0, -(d2 - d0))>(%c3, %c1, %c0)
      %260 = bufferization.to_memref %15 : memref<2x7xf16>
      %261 = math.ceil %cst_0 : f16
      %262 = arith.maxsi %false_6, %false_5 : i1
      %263 = arith.xori %true, %false_5 : i1
      %264 = math.exp %cst_4 : f32
      %265 = arith.cmpf ogt, %cst_1, %cst_4 : f32
      scf.yield %alloc : memref<3x7xi32>
    }
    %64 = math.log1p %cst_0 : f16
    %65 = math.exp %cst_4 : f32
    %alloca_23 = memref.alloca() : memref<3x2xf32>
    %extracted_24 = tensor.extract %16[%c1, %c2] : tensor<2x7xi1>
    %66 = math.round %cst_0 : f16
    %67 = vector.create_mask %c13, %59 : vector<3x7xi1>
    %68 = math.log2 %15 : tensor<2x7xf16>
    %69 = vector.broadcast %false_5 : i1 to vector<7xi1>
    %70 = vector.insert %69, %42 [0] : vector<7xi1> into vector<3x7xi1>
    %71 = arith.addf %cst_4, %cst_1 : f32
    scf.index_switch %c4 
    case 1 {
      %false_53 = index.bool.constant false
      %251 = tensor.empty() : tensor<7x2xi16>
      %252 = tensor.empty() : tensor<3x2xi16>
      %253 = linalg.matmul ins(%2, %251 : tensor<3x7xi16>, tensor<7x2xi16>) outs(%252 : tensor<3x2xi16>) -> tensor<3x2xi16>
      %alloca_54 = memref.alloca() : memref<2x7xi1>
      %254 = math.log1p %cst_4 : f32
      %255 = vector.bitcast %42 : vector<3x7xi1> to vector<3x7xi1>
      %256 = math.roundeven %cst_0 : f16
      %257 = scf.execute_region -> vector<7x3x3xi32> {
        %266 = index.floordivs %c9, %62
        %267 = math.roundeven %cst : f32
        %268 = index.sub %c10, %59
        %cst_56 = arith.constant 1.66223373E+9 : f32
        %269 = arith.maxsi %false, %true_3 : i1
        %270 = vector.reduction <minf>, %20 : vector<3xf32> into f32
        %271 = bufferization.clone %alloc : memref<3x7xi32> to memref<3x7xi32>
        %cast_57 = tensor.cast %11 : tensor<7x3x3xi32> to tensor<?x?x?xi32>
        %cst_58 = arith.constant 5.792000e+03 : f16
        %272 = vector.load %alloc_16[%c1, %c2, %c0] : memref<7x3x3xi16>, vector<2x7xi16>
        %273 = vector.splat %c15 : vector<3x7xindex>
        %alloc_59 = memref.alloc() : memref<3x7xi16>
        memref.copy %alloc_17, %alloc_59 : memref<3x7xi16> to memref<3x7xi16>
        %274 = arith.minsi %false_53, %false : i1
        %275 = vector.multi_reduction <add>, %48, %cst [0] : vector<3xf32> to f32
        %276 = index.mul %266, %c9
        %277 = vector.insert %cst, %48 [1] : f32 into vector<3xf32>
        %278 = vector.broadcast %34 : i32 to vector<7x3x3xi32>
        scf.yield %278 : vector<7x3x3xi32>
      }
      %258 = math.sqrt %0 : tensor<7x3x3xf16>
      %259 = math.rsqrt %cst_2 : f16
      %260 = math.round %0 : tensor<7x3x3xf16>
      %261 = vector.extract_strided_slice %42 {offsets = [0], sizes = [3], strides = [1]} : vector<3x7xi1> to vector<3x7xi1>
      scf.if %false_5 {
        %266 = tensor.empty() : tensor<2x7xi1>
        %267 = arith.muli %true, %extracted : i1
        %268 = arith.minsi %c8066_i16, %c8066_i16 : i16
        %269 = vector.create_mask %c0, %c11 : vector<3x2xi1>
        %270 = math.expm1 %15 : tensor<2x7xf16>
        %271 = memref.load %alloc_15[%c5, %c0, %c0] : memref<7x3x3xi64>
        %272 = arith.cmpi ule, %true_3, %false_5 : i1
        %273 = math.round %15 : tensor<2x7xf16>
      }
      %262 = arith.addf %cst_1, %cst_4 : f32
      %false_55 = arith.constant false
      %263 = vector.transfer_read %3[%c12, %c10, %c6], %false_55 : tensor<7x3x3xi1>, vector<7x7xi1>
      %264 = math.absi %12 : tensor<3x7xi1>
      %265 = math.atan2 %0, %0 : tensor<7x3x3xf16>
      scf.yield
    }
    case 2 {
      scf.if %true_3 {
        %264 = arith.divui %c951144787_i64, %c783155345_i64 : i64
        %265 = math.powf %15, %15 : tensor<2x7xf16>
        %cst_56 = arith.constant 1.000000e+00 : f16
        %266 = vector.transfer_read %15[%62, %c14], %cst_56 : tensor<2x7xf16>, vector<f16>
        %267 = arith.remf %cst_0, %cst_2 : f16
        %268 = bufferization.clone %alloc_22 : memref<7xi32> to memref<7xi32>
        %269 = math.ceil %0 : tensor<7x3x3xf16>
        %270 = vector.insertelement %cst_4, %20[%c7 : index] : vector<3xf32>
        %271 = affine.max affine_map<(d0) -> (d0)>(%c0)
      }
      %251 = math.absi %4 : tensor<2x7xi1>
      memref.tensor_store %8, %alloc_7 : memref<3x2xi16>
      vector.print %69 : vector<7xi1>
      %252 = memref.load %alloc_17[%c1, %c6] : memref<3x7xi16>
      %253 = arith.cmpi ult, %false_5, %true : i1
      %254 = math.roundeven %0 : tensor<7x3x3xf16>
      %255 = arith.xori %c912109256_i32, %34 : i32
      %256 = vector.flat_transpose %29 {columns = 3 : i32, rows = 1 : i32} : vector<3xf32> -> vector<3xf32>
      %257 = scf.while (%arg2 = %48) : (vector<3xf32>) -> vector<3xf32> {
        %264 = math.ctlz %c-4009_i16 : i16
        %265 = arith.maxsi %c783155345_i64, %c783155345_i64 : i64
        %266 = vector.broadcast %false_6 : i1 to vector<3xi1>
        %dest_56, %accumulated_value_57 = vector.scan <maxsi>, %26, %266 {inclusive = false, reduction_dim = 1 : i64} : vector<3x2xi1>, vector<3xi1>
        %267 = math.ceil %cst_0 : f16
        %from_elements_58 = tensor.from_elements %c783155345_i64, %c783155345_i64, %c783155345_i64, %c951144787_i64, %c783155345_i64, %c783155345_i64 : tensor<3x2xi64>
        %268 = arith.shli %c951144787_i64, %c951144787_i64 : i64
        %269 = arith.maxf %cst, %cst_4 : f32
        %270 = arith.shli %c8066_i16, %c8066_i16 : i16
        scf.condition(%false_6) %48 : vector<3xf32>
      } do {
      ^bb0(%arg2: vector<3xf32>):
        %264 = math.powf %15, %15 : tensor<2x7xf16>
        %265 = vector.bitcast %69 : vector<7xi1> to vector<7xi1>
        %266 = arith.negf %cst_2 : f16
        %267 = arith.maxf %cst_0, %cst_0 : f16
        %268 = affine.max affine_map<(d0, d1, d2) -> (d0, (d0 - 16) * 64)>(%c12, %c11, %37)
        %269 = vector.extract_strided_slice %42 {offsets = [1], sizes = [2], strides = [1]} : vector<3x7xi1> to vector<2x7xi1>
        %270 = math.log1p %cst_2 : f16
        %collapsed_56 = tensor.collapse_shape %2 [[0, 1]] : tensor<3x7xi16> into tensor<21xi16>
        %271 = vector.insert %cst, %20 [1] : f32 into vector<3xf32>
        %272 = affine.min affine_map<(d0, d1, d2) -> (d2 * 2 + 31)>(%c6, %c13, %c8)
        %273 = math.expm1 %cst_2 : f16
        %274 = math.log1p %15 : tensor<2x7xf16>
        %275 = math.round %cst_4 : f32
        %276 = arith.addf %cst_4, %cst_1 : f32
        %277 = arith.cmpi ult, %true, %true : i1
        %278 = arith.shrui %c951144787_i64, %c783155345_i64 : i64
        scf.yield %48 : vector<3xf32>
      }
      %258 = arith.remf %cst, %cst_1 : f32
      %259 = vector.broadcast %false : i1 to vector<3xi1>
      %dest_53, %accumulated_value_54 = vector.scan <or>, %26, %259 {inclusive = true, reduction_dim = 1 : i64} : vector<3x2xi1>, vector<3xi1>
      %260 = bufferization.to_memref %13 : memref<2x7xi1>
      %261 = arith.maxsi %true_3, %extracted_24 : i1
      %262 = scf.execute_region -> memref<7x3x3xi32> {
        %264 = vector.insert %69, %42 [1] : vector<7xi1> into vector<3x7xi1>
        %265 = affine.max affine_map<(d0) -> ((d0 + d0 floordiv 4 + 16) * 2, ((d0 + d0 floordiv 4 + 16) * 2) floordiv 64)>(%c14)
        %266 = vector.insertelement %false, %69[%35 : index] : vector<7xi1>
        %267 = arith.addi %extracted, %true : i1
        %268 = arith.shli %extracted, %false_5 : i1
        %269 = index.sub %c3, %c5
        %270 = vector.broadcast %false : i1 to vector<3xi1>
        %271 = vector.contract {indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0)>], iterator_types = ["parallel", "reduction"], kind = #vector.kind<minui>} %69, %67, %270 : vector<7xi1>, vector<3x7xi1> into vector<3xi1>
        %272 = affine.max affine_map<(d0) -> (d0, d0 - (((d0 + 4) ceildiv 64) mod 128) * 64 + 16)>(%c12)
        %273 = memref.atomic_rmw muli %c783155345_i64, %alloc_15[%c3, %c0, %c0] : (i64, memref<7x3x3xi64>) -> i64
        %274 = affine.apply affine_map<(d0, d1) -> ((d1 + 18) ceildiv 32)>(%62, %c15)
        %275 = math.log1p %cst_2 : f16
        %276 = math.ceil %15 : tensor<2x7xf16>
        %277 = arith.minf %cst, %cst_1 : f32
        %278 = index.maxs %c1, %272
        %cast_56 = tensor.cast %1 : tensor<2x7xi1> to tensor<?x?xi1>
        %279 = index.divu %c15, %269
        scf.yield %alloc_10 : memref<7x3x3xi32>
      }
      %alloc_55 = memref.alloc() : memref<3xi1>
      %263 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>, affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_55, %10, %alloc_55 : memref<3xi1>, tensor<7x3x3xi1>, memref<3xi1>) outs(%10 : tensor<7x3x3xi1>) {
      ^bb0(%in: i1, %in_56: i1, %in_57: i1, %out: i1):
        %264 = math.log %0 : tensor<7x3x3xf16>
        %265 = arith.muli %c951144787_i64, %c783155345_i64 : i64
        %266 = vector.insertelement %cst_4, %48[%62 : index] : vector<3xf32>
        %267 = math.fma %cst_4, %cst_1, %cst_1 : f32
        %268 = math.floor %15 : tensor<2x7xf16>
        %269 = arith.negf %cst_1 : f32
        %270 = math.expm1 %15 : tensor<2x7xf16>
        %271 = arith.remui %extracted_24, %extracted_24 : i1
        %272 = affine.max affine_map<(d0, d1, d2, d3) -> (-(d3 - d2))>(%c8, %37, %c8, %c10)
        %cast_58 = tensor.cast %9 : tensor<3x2xi64> to tensor<?x?xi64>
