module {
  func.func @func1(%arg0: i1, %arg1: index, %arg2: vector<16x15x10xf32>) -> i1 {
    %c767099878_i64 = arith.constant 767099878 : i64
    %cst = arith.constant 6.278400e+04 : f16
    %cst_0 = arith.constant 1.441600e+04 : f16
    %c28366_i16 = arith.constant 28366 : i16
    %cst_1 = arith.constant 4.195200e+04 : f16
    %cst_2 = arith.constant 1.82508826E+9 : f32
    %c522205298_i32 = arith.constant 522205298 : i32
    %cst_3 = arith.constant 1.42153408E+9 : f32
    %c1063595746_i32 = arith.constant 1063595746 : i32
    %c223865476_i64 = arith.constant 223865476 : i64
    %c2124661813_i32 = arith.constant 2124661813 : i32
    %c872239861_i32 = arith.constant 872239861 : i32
    %cst_4 = arith.constant 1.77924237E+9 : f32
    %c-11434_i16 = arith.constant -11434 : i16
    %c1514081338_i64 = arith.constant 1514081338 : i64
    %true = arith.constant true
    %0 = tensor.empty() : tensor<3xi16>
    %1 = tensor.empty() : tensor<15x15xi64>
    %2 = tensor.empty() : tensor<3xi32>
    %3 = tensor.empty() : tensor<16x3x10xf16>
    %4 = tensor.empty() : tensor<3xi32>
    %5 = tensor.empty() : tensor<3xi16>
    %6 = tensor.empty() : tensor<15x15xi1>
    %7 = tensor.empty() : tensor<16x15x10xi1>
    %8 = tensor.empty() : tensor<15x15xf16>
    %9 = tensor.empty() : tensor<3xf16>
    %10 = tensor.empty() : tensor<16x15x10xi16>
    %11 = tensor.empty() : tensor<16x3x10xf16>
    %12 = tensor.empty() : tensor<16x3x10xf32>
    %13 = tensor.empty() : tensor<15x15xf32>
    %14 = tensor.empty() : tensor<3xi16>
    %15 = tensor.empty() : tensor<15x15xf16>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<15x15xi1>
    %alloc_5 = memref.alloc() : memref<16x15x10xi64>
    %alloc_6 = memref.alloc() : memref<15x15xi16>
    %alloc_7 = memref.alloc() : memref<16x15x10xf32>
    %alloc_8 = memref.alloc() : memref<15x15xf32>
    %alloc_9 = memref.alloc() : memref<15x15xf32>
    %alloc_10 = memref.alloc() : memref<3xi64>
    %alloc_11 = memref.alloc() : memref<16x3x10xi64>
    %alloc_12 = memref.alloc() : memref<15x15xi16>
    %alloc_13 = memref.alloc() : memref<3xi32>
    %alloc_14 = memref.alloc() : memref<3xf16>
    %alloc_15 = memref.alloc() : memref<15x15xi16>
    %alloc_16 = memref.alloc() : memref<16x15x10xf32>
    %alloc_17 = memref.alloc() : memref<3xf32>
    %alloc_18 = memref.alloc() : memref<16x15x10xi1>
    %alloc_19 = memref.alloc() : memref<3xi64>
    %16 = tensor.empty() : tensor<16x3x10xf16>
    %17 = linalg.copy ins(%3 : tensor<16x3x10xf16>) outs(%16 : tensor<16x3x10xf16>) -> tensor<16x3x10xf16>
    %18 = tensor.empty() : tensor<3xi64>
    %transposed = linalg.transpose ins(%alloc_19 : memref<3xi64>) outs(%18 : tensor<3xi64>) permutation = [0] 
    %alloc_20 = memref.alloc() : memref<10xf16>
    linalg.reduce ins(%17 : tensor<16x3x10xf16>) outs(%alloc_20 : memref<10xf16>) dimensions = [0, 1] 
      (%in: f16, %init: f16) {
        bufferization.dealloc_tensor %transposed : tensor<3xi64>
        memref.alloca_scope  {
          %258 = math.ctpop %14 : tensor<3xi16>
          affine.store %c-11434_i16, %alloc_6[%c12, %c6] : memref<15x15xi16>
          %259 = math.round %9 : tensor<3xf16>
          %260 = math.absi %14 : tensor<3xi16>
          %261 = index.divs %c0, %c9
          %262 = math.log10 %3 : tensor<16x3x10xf16>
          %263 = index.maxs %c3, %c14
          %c1_i64_53 = arith.constant 1 : i64
          %c0_i64_54 = arith.constant 0 : i64
          %264 = vector.transfer_read %alloc_5[%c15, %c1, %c7], %c0_i64_54 {permutation_map = affine_map<(d0, d1, d2) -> (0)>} : memref<16x15x10xi64>, vector<10xi64>
          %265 = math.tan %8 : tensor<15x15xf16>
          %266 = index.maxs %c13, %c10
          %267 = math.tan %12 : tensor<16x3x10xf32>
          %268 = arith.shli %c1_i64_53, %c223865476_i64 : i64
          %269 = math.powf %3, %11 : tensor<16x3x10xf16>
          %270 = arith.cmpf uge, %cst, %init : f16
          %271 = arith.minsi %true, %true : i1
          %272 = vector.broadcast %c28366_i16 : i16 to vector<15xi16>
          %273 = vector.reduction <maxui>, %272 : vector<15xi16> into i16
          %274 = math.cos %cst_4 : f32
          %275 = vector.broadcast %c28366_i16 : i16 to vector<1xi16>
          %276 = vector.extract %275[0] : vector<1xi16>
          %277 = math.atan2 %11, %17 : tensor<16x3x10xf16>
          affine.store %c28366_i16, %alloc_12[%c12, %c7] : memref<15x15xi16>
          %cst_55 = arith.constant 3.321600e+04 : f16
          %278 = index.floordivs %261, %c9
          %279 = arith.shrsi %c767099878_i64, %c1514081338_i64 : i64
          %c344474965_i64 = arith.constant 344474965 : i64
          %280 = math.cos %in : f16
          %c0_i64_56 = arith.constant 0 : i64
          %c0_i64_57 = arith.constant 0 : i64
          %281 = vector.transfer_read %alloc_11[%c3, %c7, %c0], %c0_i64_57 {permutation_map = affine_map<(d0, d1, d2) -> (d0, d1)>} : memref<16x3x10xi64>, vector<16x10xi64>
          %true_58 = index.bool.constant true
          %282 = tensor.empty() : tensor<16x3x10xi32>
          %283 = math.exp %9 : tensor<3xf16>
          %284 = bufferization.to_memref %1 : memref<15x15xi64>
          %285 = arith.addf %init, %in : f16
          %inserted_59 = tensor.insert %cst_1 into %8[%c4, %c11] : tensor<15x15xf16>
        }
        %254 = affine.load %alloc_15[%c14, %c8] : memref<15x15xi16>
        %extracted_51 = tensor.extract %2[%c2] : tensor<3xi32>
        %255 = index.divs %c5, %c1
        %256 = arith.divui %c872239861_i32, %c522205298_i32 : i32
        affine.store %cst_4, %alloc_16[%c1, %c1, %c15] : memref<16x15x10xf32>
        %257 = arith.remf %cst, %in : f16
        %cst_52 = arith.constant 1.000000e+00 : f16
        linalg.yield %cst_52 : f16
      }
    %19 = scf.parallel (%arg3, %arg4) = (%c0, %c13) to (%c2, %c5) step (%c9, %c11) init (%alloc_20) -> memref<10xf16> {
      %254 = index.ceildivs %c6, %arg4
      %255 = math.exp2 %15 : tensor<15x15xf16>
      %256 = arith.remsi %c-11434_i16, %c-11434_i16 : i16
      memref.assume_alignment %alloc, 1 : memref<15x15xi1>
      %257 = arith.shrui %c767099878_i64, %c767099878_i64 : i64
      %258 = arith.minf %cst_3, %cst_4 : f32
      %inserted_51 = tensor.insert %cst_4 into %12[%c15, %c1, %c9] : tensor<16x3x10xf32>
      %259 = arith.muli %c1514081338_i64, %c767099878_i64 : i64
      %260 = math.absf %9 : tensor<3xf16>
      %261 = vector.broadcast %c767099878_i64 : i64 to vector<3xi64>
      %262 = vector.flat_transpose %261 {columns = 3 : i32, rows = 1 : i32} : vector<3xi64> -> vector<3xi64>
      %263 = index.mul %c14, %c10
      %264 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minui>} %261, %262, %c1514081338_i64 : vector<3xi64>, vector<3xi64> into i64
      %265 = math.round %cst_4 : f32
      %266 = tensor.empty(%arg4, %c1) : tensor<?x?x10xi16>
      %267 = math.ceil %cst_2 : f32
      %268 = affine.load %alloc_6[%c11, %c15] : memref<15x15xi16>
      %alloc_52 = memref.alloc() : memref<10xf16>
      scf.reduce(%alloc_52)  : memref<10xf16> {
      ^bb0(%arg5: memref<10xf16>, %arg6: memref<10xf16>):
        %269 = math.exp %cst_2 : f32
        %270 = math.roundeven %12 : tensor<16x3x10xf32>
        %271 = bufferization.clone %arg5 : memref<10xf16> to memref<10xf16>
        %splat_53 = tensor.splat %cst_1 : tensor<16x15x10xf16>
        %272 = math.exp %8 : tensor<15x15xf16>
        %273 = math.log2 %17 : tensor<16x3x10xf16>
        %274 = index.floordivs %arg3, %c14
        %inserted_54 = tensor.insert %c1514081338_i64 into %18[%c2] : tensor<3xi64>
        %alloc_55 = memref.alloc() : memref<10xf16>
        scf.reduce.return %alloc_55 : memref<10xf16>
      }
      scf.yield
    }
    %20 = affine.vector_load %alloc_16[%c14, %c12, %c0] : memref<16x15x10xf32>, vector<15xf32>
    affine.vector_store %20, %alloc_8[%c9, %c2] : memref<15x15xf32>, vector<15xf32>
    %21 = tensor.empty() : tensor<10xf16>
    %22 = tensor.empty() : tensor<f16>
    %23 = linalg.dot ins(%alloc_20, %21 : memref<10xf16>, tensor<10xf16>) outs(%22 : tensor<f16>) -> tensor<f16>
    %24 = arith.remui %c767099878_i64, %c767099878_i64 : i64
    %25 = math.cos %cst : f16
    %26 = arith.maxui %c767099878_i64, %c223865476_i64 : i64
    %27 = tensor.empty() : tensor<15x15xi16>
    %mapped = linalg.map ins(%alloc_6, %alloc_12 : memref<15x15xi16>, memref<15x15xi16>) outs(%27 : tensor<15x15xi16>)
      (%in: i16, %in_51: i16) {
        %254 = tensor.empty(%c9) : tensor<16x?x10xi32>
        %255 = arith.addi %c1514081338_i64, %c767099878_i64 : i64
        %256 = math.roundeven %13 : tensor<15x15xf32>
        %257 = math.copysign %16, %17 : tensor<16x3x10xf16>
        %258 = math.ceil %cst_1 : f16
        %alloca_52 = memref.alloca() : memref<16x15x10xi32>
        %259 = math.cttz %6 : tensor<15x15xi1>
        %260 = arith.ceildivsi %in_51, %in : i16
        %261 = math.exp %cst_0 : f16
        %extracted_53 = tensor.extract %7[%c6, %c11, %c7] : tensor<16x15x10xi1>
        %262 = math.fma %12, %12, %12 : tensor<16x3x10xf32>
        %263 = arith.muli %c872239861_i32, %c2124661813_i32 : i32
        %264 = arith.addf %cst_2, %cst_3 : f32
        %expanded_54 = tensor.expand_shape %21 [[0, 1]] : tensor<10xf16> into tensor<10x1xf16>
        %265 = math.ceil %cst_3 : f32
        %266 = math.roundeven %cst_1 : f16
        %267 = arith.ceildivsi %c223865476_i64, %c767099878_i64 : i64
        %268 = index.floordivs %c0, %c9
        %269 = vector.reduction <mul>, %20 : vector<15xf32> into f32
        %270 = bufferization.clone %alloc_9 : memref<15x15xf32> to memref<15x15xf32>
        %271 = arith.divf %cst_1, %cst_1 : f16
        %272 = index.mul %c2, %c3
        %273 = affine.if affine_set<(d0, d1, d2, d3) : (-(d1 - 64) >= 0)>(%c12, %c7, %c13, %c11) -> memref<16x15x10xf32> {
          %282 = index.casts %c1063595746_i32 : i32 to index
          %283 = index.maxs %c0, %c0
          %284 = arith.maxf %cst_4, %cst_3 : f32
          %285 = math.sqrt %3 : tensor<16x3x10xf16>
          %286 = arith.divf %cst_4, %cst_2 : f32
          %287 = tensor.empty() : tensor<15x15xf32>
          %288 = linalg.matmul ins(%13, %13 : tensor<15x15xf32>, tensor<15x15xf32>) outs(%287 : tensor<15x15xf32>) -> tensor<15x15xf32>
          %289 = index.add %c10, %c14
          %rank_57 = tensor.rank %0 : tensor<3xi16>
          affine.yield %alloc_7 : memref<16x15x10xf32>
        } else {
          %282 = math.ceil %expanded_54 : tensor<10x1xf16>
          %283 = math.log2 %13 : tensor<15x15xf32>
          %284 = math.absi %27 : tensor<15x15xi16>
          %285 = tensor.empty() : tensor<3xf32>
          %286 = vector.broadcast %cst_2 : f32 to vector<16x3x10xf32>
          %287 = vector.broadcast %true : i1 to vector<16x3x10xi1>
          %288 = vector.broadcast %c2124661813_i32 : i32 to vector<16x3x10xi32>
          %289 = vector.gather %285[%c13] [%288], %287, %286 : tensor<3xf32>, vector<16x3x10xi32>, vector<16x3x10xi1>, vector<16x3x10xf32> into vector<16x3x10xf32>
          %true_57 = index.bool.constant true
          %290 = index.sizeof
          %291 = memref.realloc %alloc_13 : memref<3xi32> to memref<16xi32>
          %292 = vector.bitcast %286 : vector<16x3x10xf32> to vector<16x3x10xf32>
          affine.yield %alloc_16 : memref<16x15x10xf32>
        }
        %false_55 = index.bool.constant false
        %274 = index.casts %c522205298_i32 : i32 to index
        %275 = vector.bitcast %20 : vector<15xf32> to vector<15xf32>
        %276 = vector.broadcast %cst_2 : f32 to vector<15x15xf32>
        %277 = vector.outerproduct %275, %20, %276 {kind = #vector.kind<mul>} : vector<15xf32>, vector<15xf32>
        %278 = index.divs %c2, %272
        affine.for %arg3 = 0 to 12 {
        }
        %279 = arith.xori %false_55, %true : i1
        %280 = arith.negf %cst_1 : f16
        %281 = index.add %c8, %c6
        %c0_i16_56 = arith.constant 0 : i16
        linalg.yield %c0_i16_56 : i16
      }
    %28 = tensor.empty() : tensor<3xf32>
    %29 = vector.broadcast %cst_3 : f32 to vector<16x15x10xf32>
    %30 = vector.broadcast %true : i1 to vector<16x15x10xi1>
    %31 = vector.broadcast %c1063595746_i32 : i32 to vector<16x15x10xi32>
    %32 = vector.gather %28[%c4] [%31], %30, %29 : tensor<3xf32>, vector<16x15x10xi32>, vector<16x15x10xi1>, vector<16x15x10xf32> into vector<16x15x10xf32>
    %33 = math.expm1 %cst_1 : f16
    %34 = arith.andi %true, %true : i1
    %35 = math.atan %9 : tensor<3xf16>
    %36 = vector.extract_strided_slice %29 {offsets = [14, 10], sizes = [1, 4], strides = [1, 1]} : vector<16x15x10xf32> to vector<1x4x10xf32>
    %37 = arith.minsi %c522205298_i32, %c522205298_i32 : i32
    %inserted = tensor.insert %c767099878_i64 into %18[%c1] : tensor<3xi64>
    %38 = arith.ceildivsi %true, %true : i1
    %39 = math.ipowi %7, %7 : tensor<16x15x10xi1>
    %40 = math.atan %11 : tensor<16x3x10xf16>
    memref.store %c223865476_i64, %alloc_19[%c0] : memref<3xi64>
    %inserted_21 = tensor.insert %cst into %3[%c5, %c0, %c5] : tensor<16x3x10xf16>
    %41 = index.divs %c3, %c13
    %42 = index.casts %c522205298_i32 : i32 to index
    %43 = affine.load %alloc_5[%c10, %c3, %c14] : memref<16x15x10xi64>
    %44 = math.ipowi %true, %true : i1
    %45 = tensor.empty(%c11) : tensor<?xi64>
    scf.if %true {
      %254 = vector.flat_transpose %20 {columns = 5 : i32, rows = 3 : i32} : vector<15xf32> -> vector<15xf32>
      %255 = index.sub %c8, %c13
      %256 = math.ctlz %c767099878_i64 : i64
      %257 = affine.max affine_map<(d0, d1) -> (d1 * 8, d1 floordiv 8, (d1 * 4) ceildiv 32)>(%c1, %c7)
      %258 = index.maxu %c6, %c8
      %259 = math.expm1 %8 : tensor<15x15xf16>
      memref.assume_alignment %alloc_5, 4 : memref<16x15x10xi64>
      %260 = vector.broadcast %c1514081338_i64 : i64 to vector<15xi64>
      %261 = vector.transfer_write %260, %1[%c0, %c2] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<15xi64>, tensor<15x15xi64>
    }
    %46 = vector.reduction <mul>, %20 : vector<15xf32> into f32
    %47 = math.round %3 : tensor<16x3x10xf16>
    %48 = math.log2 %3 : tensor<16x3x10xf16>
    %49 = math.atan2 %16, %16 : tensor<16x3x10xf16>
    %50 = arith.minsi %c872239861_i32, %c1063595746_i32 : i32
    %51 = arith.shrui %c223865476_i64, %c1514081338_i64 : i64
    %52 = index.castu %c3 : index to i32
    %53 = vector.broadcast %c15 : index to vector<3xindex>
    %54 = vector.broadcast %true : i1 to vector<3xi1>
    %55 = vector.broadcast %c872239861_i32 : i32 to vector<3xi32>
    vector.scatter %alloc_13[%c0] [%53], %54, %55 : memref<3xi32>, vector<3xindex>, vector<3xi1>, vector<3xi32>
    %splat = tensor.splat %c28366_i16 : tensor<16x15x10xi16>
    %56 = index.divs %c10, %c10
    %57 = arith.mulf %cst_1, %cst_0 : f16
    scf.index_switch %42 
    case 1 {
      %254 = arith.cmpf uge, %cst, %cst_0 : f16
      %255 = math.ctpop %splat : tensor<16x15x10xi16>
      %256 = arith.muli %c28366_i16, %c-11434_i16 : i16
      %257 = math.round %16 : tensor<16x3x10xf16>
      %258 = math.round %cst_4 : f32
      %259 = arith.minsi %c767099878_i64, %c1514081338_i64 : i64
      %260 = arith.remf %cst_3, %cst_3 : f32
      %261 = index.castu %c28366_i16 : i16 to index
      %c-14420_i16 = arith.constant -14420 : i16
      %262 = vector.bitcast %30 : vector<16x15x10xi1> to vector<16x15x10xi1>
      %263 = arith.divui %true, %true : i1
      %264 = vector.extract %262[13] : vector<16x15x10xi1>
      %265 = index.divs %c5, %c1
      %266 = math.ipowi %c223865476_i64, %43 : i64
      %extracted_51 = tensor.extract %12[%c7, %c2, %c8] : tensor<16x3x10xf32>
      %267 = index.divs %c12, %265
      scf.yield
    }
    case 2 {
      memref.alloca_scope  {
        %alloca_52 = memref.alloca() : memref<16x15x10xf32>
        %266 = arith.subi %c28366_i16, %c28366_i16 : i16
        %267 = vector.extract_strided_slice %32 {offsets = [3], sizes = [4], strides = [1]} : vector<16x15x10xf32> to vector<4x15x10xf32>
        %268 = tensor.empty() : tensor<16x3x10xf16>
        %269 = vector.broadcast %cst_2 : f32 to vector<15x15xf32>
        %270 = vector.outerproduct %20, %20, %269 {kind = #vector.kind<maxf>} : vector<15xf32>, vector<15xf32>
        %271 = vector.broadcast %c522205298_i32 : i32 to vector<10xi32>
        %272 = vector.insert %271, %31 [2, 6] : vector<10xi32> into vector<16x15x10xi32>
        %273 = math.ctlz %true : i1
        %274 = math.copysign %11, %268 : tensor<16x3x10xf16>
        %275 = math.exp2 %22 : tensor<f16>
        %276 = arith.divf %cst_1, %cst_0 : f16
        %277 = index.divs %42, %c11
        %278 = affine.apply affine_map<(d0) -> ((((d0 * 2) ceildiv 16) ceildiv 4) mod 8)>(%56)
        %279 = math.exp2 %9 : tensor<3xf16>
        %280 = math.cos %11 : tensor<16x3x10xf16>
        %collapsed_53 = tensor.collapse_shape %8 [[0, 1]] : tensor<15x15xf16> into tensor<225xf16>
        %281 = math.log1p %21 : tensor<10xf16>
        %282 = vector.reduction <maxf>, %20 : vector<15xf32> into f32
        %283 = index.mul %c11, %c10
        %284 = bufferization.clone %alloc_12 : memref<15x15xi16> to memref<15x15xi16>
        %285 = math.fma %15, %15, %8 : tensor<15x15xf16>
        %286 = math.sqrt %collapsed_53 : tensor<225xf16>
        %287 = arith.shrui %43, %c767099878_i64 : i64
        %288 = index.divu %c3, %56
        %expanded_54 = tensor.expand_shape %18 [[0, 1]] : tensor<3xi64> into tensor<3x1xi64>
        %expanded_55 = tensor.expand_shape %18 [[0, 1]] : tensor<3xi64> into tensor<3x1xi64>
        %289 = math.ctpop %14 : tensor<3xi16>
        %290 = vector.multi_reduction <minf>, %267, %20 [0, 2] : vector<4x15x10xf32> to vector<15xf32>
        %cst_56 = arith.constant 1.000000e+00 : f32
        %291 = vector.transfer_read %alloc_7[%c3, %c3, %c4], %cst_56 : memref<16x15x10xf32>, vector<16x15xf32>
        %292 = arith.subi %43, %c767099878_i64 : i64
        %293 = vector.broadcast %cst_2 : f32 to vector<16x3x10xf32>
        %294 = vector.fma %293, %293, %293 : vector<16x3x10xf32>
        %295 = affine.min affine_map<(d0, d1) -> (d1, d0 floordiv 32)>(%c3, %c3)
        %296 = math.floor %collapsed_53 : tensor<225xf16>
      }
      %254 = arith.shli %c2124661813_i32, %c1063595746_i32 : i32
      %255 = memref.atomic_rmw muli %c28366_i16, %alloc_6[%c7, %c1] : (i16, memref<15x15xi16>) -> i16
      affine.for %arg3 = 0 to 69 {
      }
      memref.alloca_scope  {
        %266 = arith.minsi %true, %true : i1
        %267 = math.rsqrt %11 : tensor<16x3x10xf16>
        %alloc_52 = memref.alloc() : memref<16x3x10xf32>
        %268 = vector.broadcast %cst_3 : f32 to vector<3xf32>
        %269 = vector.broadcast %true : i1 to vector<3xi1>
        %270 = vector.broadcast %c522205298_i32 : i32 to vector<3xi32>
        %271 = vector.gather %alloc_52[%c15, %c2, %c9] [%270], %269, %268 : memref<16x3x10xf32>, vector<3xi32>, vector<3xi1>, vector<3xf32> into vector<3xf32>
        %272 = arith.subi %c2124661813_i32, %c872239861_i32 : i32
        %273 = index.floordivs %c2, %c12
        %274 = math.roundeven %3 : tensor<16x3x10xf16>
        %275 = arith.andi %c1514081338_i64, %43 : i64
        %alloca_53 = memref.alloca() : memref<16x3x10xf16>
        %276 = vector.broadcast %cst_0 : f16 to vector<3xf16>
        %277 = vector.maskedload %alloc_14[%c2], %269, %276 : memref<3xf16>, vector<3xi1>, vector<3xf16> into vector<3xf16>
        %278 = math.atan %23 : tensor<f16>
        %279 = arith.cmpi eq, %c522205298_i32, %c872239861_i32 : i32
        %280 = index.mul %c13, %c14
        %281 = vector.broadcast %c2124661813_i32 : i32 to vector<3x3xi32>
        %282 = vector.outerproduct %270, %270, %281 {kind = #vector.kind<mul>} : vector<3xi32>, vector<3xi32>
        %283 = math.roundeven %21 : tensor<10xf16>
        %284 = math.copysign %3, %3 : tensor<16x3x10xf16>
        %285 = arith.maxsi %c1514081338_i64, %c767099878_i64 : i64
        %expanded_54 = tensor.expand_shape %15 [[0], [1, 2]] : tensor<15x15xf16> into tensor<15x15x1xf16>
        %286 = arith.subi %c28366_i16, %c-11434_i16 : i16
        %287 = vector.broadcast %cst_4 : f32 to vector<3x3xf32>
        %288 = vector.outerproduct %268, %271, %287 {kind = #vector.kind<add>} : vector<3xf32>, vector<3xf32>
        %289 = math.cttz %c2124661813_i32 : i32
        %290 = affine.apply affine_map<(d0, d1) -> (-((d0 + 64) floordiv 128) + (d0 + 64) floordiv 128 + d0 + 80)>(%c5, %c5)
        %291 = math.cos %9 : tensor<3xf16>
        %292 = vector.extract %269[2] : vector<3xi1>
        %293 = tensor.empty() : tensor<15x15xf32>
        %294 = linalg.matmul ins(%13, %13 : tensor<15x15xf32>, tensor<15x15xf32>) outs(%293 : tensor<15x15xf32>) -> tensor<15x15xf32>
        %295 = arith.remui %c522205298_i32, %c2124661813_i32 : i32
        %296 = math.tan %15 : tensor<15x15xf16>
        %297 = arith.subi %c1063595746_i32, %c2124661813_i32 : i32
        %298 = math.roundeven %12 : tensor<16x3x10xf32>
        %299 = vector.broadcast %cst_2 : f32 to vector<16x15x10xf32>
        %300 = vector.fma %299, %299, %29 : vector<16x15x10xf32>
        %301 = index.floordivs %41, %c0
        %302 = math.fma %21, %21, %21 : tensor<10xf16>
        %303 = bufferization.clone %alloc_16 : memref<16x15x10xf32> to memref<16x15x10xf32>
      }
      %256 = math.floor %13 : tensor<15x15xf32>
      %257 = arith.minui %c223865476_i64, %43 : i64
      %extracted_51 = tensor.extract %12[%c4, %c2, %c4] : tensor<16x3x10xf32>
      %258 = math.round %8 : tensor<15x15xf16>
      %259 = arith.cmpi sle, %c1063595746_i32, %c2124661813_i32 : i32
      %260 = vector.extract_strided_slice %29 {offsets = [2], sizes = [2], strides = [1]} : vector<16x15x10xf32> to vector<2x15x10xf32>
      %261 = tensor.empty(%42) : tensor<?xi16>
      %262 = index.mul %56, %c7
      %263 = memref.alloca_scope  -> (f32) {
        %266 = math.cos %17 : tensor<16x3x10xf16>
        memref.store %cst_3, %alloc_17[%c1] : memref<3xf32>
        %267 = index.casts %41 : index to i32
        %268 = index.casts %56 : index to i32
        %cst_52 = arith.constant 1.000000e+00 : f32
        %269 = vector.transfer_read %13[%c8, %c7], %cst_52 : tensor<15x15xf32>, vector<f32>
        %270 = arith.remui %true, %true : i1
        %271 = math.round %9 : tensor<3xf16>
        %272 = index.castu %c1 : index to i32
        memref.assume_alignment %alloc_9, 4 : memref<15x15xf32>
        %273 = math.floor %cst_0 : f16
        %274 = arith.maxf %cst_1, %cst : f16
        %275 = math.tan %cst_52 : f32
        %276 = math.ipowi %10, %10 : tensor<16x15x10xi16>
        %277 = vector.extract_strided_slice %32 {offsets = [14], sizes = [2], strides = [1]} : vector<16x15x10xf32> to vector<2x15x10xf32>
        %expanded_53 = tensor.expand_shape %7 [[0], [1], [2, 3]] : tensor<16x15x10xi1> into tensor<16x15x10x1xi1>
        %278 = math.floor %cst_2 : f32
        %279 = math.ctpop %2 : tensor<3xi32>
        %280 = vector.broadcast %cst_2 : f32 to vector<2x10x16x10xf32>
        %281 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2, d3, d4) -> (d0, d4, d1)>, affine_map<(d0, d1, d2, d3, d4) -> (d2, d4, d3)>, affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3)>], iterator_types = ["parallel", "parallel", "parallel", "parallel", "reduction"], kind = #vector.kind<minf>} %260, %32, %280 : vector<2x15x10xf32>, vector<16x15x10xf32> into vector<2x10x16x10xf32>
        %282 = math.exp2 %3 : tensor<16x3x10xf16>
        %283 = index.castu %true : i1 to index
        %284 = arith.cmpf une, %cst_52, %cst_2 : f32
        %splat_54 = tensor.splat %c2124661813_i32 : tensor<16x15x10xi32>
        %285 = index.mul %c6, %c0
        %286 = arith.floordivsi %c767099878_i64, %c1514081338_i64 : i64
        %splat_55 = tensor.splat %c-11434_i16 : tensor<3xi16>
        %287 = math.ipowi %c1063595746_i32, %c872239861_i32 : i32
        %288 = math.round %9 : tensor<3xf16>
        %289 = vector.extract_strided_slice %260 {offsets = [0, 10], sizes = [2, 4], strides = [1, 1]} : vector<2x15x10xf32> to vector<2x4x10xf32>
        %290 = arith.remf %cst_2, %cst_4 : f32
        %291 = vector.bitcast %31 : vector<16x15x10xi32> to vector<16x15x10xf32>
        %292 = arith.cmpf ult, %cst_2, %cst_4 : f32
        %293 = index.maxs %c2, %c3
        memref.alloca_scope.return %extracted_51 : f32
      }
      %264 = memref.atomic_rmw addi %c767099878_i64, %alloc_10[%c0] : (i64, memref<3xi64>) -> i64
      %265 = math.expm1 %8 : tensor<15x15xf16>
      scf.yield
    }
    case 3 {
      %254 = index.add %41, %56
      %255 = arith.remf %cst_4, %cst_3 : f32
      %alloc_51 = memref.alloc() : memref<3xi16>
      %256 = vector.reduction <maxf>, %20 : vector<15xf32> into f32
      %257 = vector.reduction <minf>, %20 : vector<15xf32> into f32
      %258 = math.atan %12 : tensor<16x3x10xf32>
      %259 = arith.ori %c1063595746_i32, %c1063595746_i32 : i32
      %260 = arith.subi %c223865476_i64, %c767099878_i64 : i64
      %261 = arith.remui %true, %true : i1
      %262 = math.roundeven %cst_1 : f16
      %263 = tensor.empty() : tensor<3xi32>
      %mapped_52 = linalg.map ins(%alloc_13, %alloc_13 : memref<3xi32>, memref<3xi32>) outs(%263 : tensor<3xi32>)
        (%in: i32, %in_54: i32) {
          %268 = math.cttz %14 : tensor<3xi16>
          %269 = vector.reduction <add>, %20 : vector<15xf32> into f32
          %270 = math.floor %9 : tensor<3xf16>
          %271 = arith.muli %in, %c872239861_i32 : i32
          %272 = tensor.empty() : tensor<16x3x10xf16>
          %273 = math.absf %8 : tensor<15x15xf16>
          %rank_55 = tensor.rank %8 : tensor<15x15xf16>
          %274 = index.maxs %c3, %c8
          %275 = memref.realloc %alloc_20 : memref<10xf16> to memref<15xf16>
          %276 = math.log10 %8 : tensor<15x15xf16>
          %277 = arith.minui %c1063595746_i32, %c522205298_i32 : i32
          %278 = bufferization.clone %alloc_8 : memref<15x15xf32> to memref<15x15xf32>
          %279 = math.absi %in : i32
          %280 = vector.broadcast %c-11434_i16 : i16 to vector<3xi16>
          %281 = vector.broadcast %true : i1 to vector<3xi1>
          %282 = vector.maskedload %alloc_15[%c14, %c10], %281, %280 : memref<15x15xi16>, vector<3xi1>, vector<3xi16> into vector<3xi16>
          %283 = vector.broadcast %c11 : index to vector<15xindex>
          %284 = vector.broadcast %true : i1 to vector<15xi1>
          vector.scatter %alloc_8[%c2, %c13] [%283], %284, %20 : memref<15x15xf32>, vector<15xindex>, vector<15xi1>, vector<15xf32>
          %285 = arith.shrsi %in, %in : i32
          %286 = math.fma %11, %272, %272 : tensor<16x3x10xf16>
          %287 = memref.realloc %alloc_20 : memref<10xf16> to memref<3xf16>
          %288 = affine.apply affine_map<(d0, d1, d2, d3) -> ((d2 mod 64 + d0) * 8)>(%c11, %c11, %rank_55, %c5)
          %289 = affine.load %alloc_6[%c11, %c1] : memref<15x15xi16>
          %290 = arith.remf %cst_0, %cst_1 : f16
          %291 = arith.mulf %cst_4, %cst_2 : f32
          %292 = arith.mulf %cst_1, %cst_1 : f16
          %293 = tensor.empty() : tensor<15x15xi1>
          %294 = linalg.matmul ins(%6, %6 : tensor<15x15xi1>, tensor<15x15xi1>) outs(%293 : tensor<15x15xi1>) -> tensor<15x15xi1>
          %295 = arith.remf %cst_1, %cst_1 : f16
          %296 = vector.broadcast %c1 : index to vector<10xindex>
          %297 = vector.broadcast %true : i1 to vector<10xi1>
          %298 = vector.broadcast %cst_0 : f16 to vector<10xf16>
          vector.scatter %alloc_20[%c8] [%296], %297, %298 : memref<10xf16>, vector<10xindex>, vector<10xi1>, vector<10xf16>
          %299 = bufferization.to_tensor %alloc_9 : memref<15x15xf32>
          %300 = vector.flat_transpose %281 {columns = 3 : i32, rows = 1 : i32} : vector<3xi1> -> vector<3xi1>
          %301 = vector.reduction <maxui>, %280 : vector<3xi16> into i16
          %c1_i16 = arith.constant 1 : i16
          %302 = vector.transfer_read %0[%c1], %c1_i16 : tensor<3xi16>, vector<i16>
          memref.assume_alignment %alloc_15, 16 : memref<15x15xi16>
          %303 = math.exp2 %16 : tensor<16x3x10xf16>
          %c0_i32 = arith.constant 0 : i32
          linalg.yield %c0_i32 : i32
        }
      %264 = affine.if affine_set<(d0, d1, d2, d3) : (-(d1 - 64) >= 0)>(%c15, %c0, %c14, %c10) -> i64 {
        %268 = math.floor %11 : tensor<16x3x10xf16>
        %269 = memref.realloc %alloc_10 : memref<3xi64> to memref<10xi64>
        %alloc_54 = memref.alloc() : memref<16x15x10xi1>
        memref.copy %alloc_18, %alloc_54 : memref<16x15x10xi1> to memref<16x15x10xi1>
        %270 = math.roundeven %15 : tensor<15x15xf16>
        %271 = arith.remsi %c522205298_i32, %c1063595746_i32 : i32
        %272 = arith.xori %c223865476_i64, %c223865476_i64 : i64
        %273 = arith.ceildivsi %c28366_i16, %c28366_i16 : i16
        %274 = arith.maxf %cst_4, %cst_3 : f32
        affine.yield %c767099878_i64 : i64
      } else {
        %268 = tensor.empty() : tensor<16x15x10xf32>
        %269 = math.ceil %cst_2 : f32
        %alloca_54 = memref.alloca() : memref<15x15xf16>
        %270 = arith.ceildivsi %c28366_i16, %c-11434_i16 : i16
        %271 = vector.broadcast %c28366_i16 : i16 to vector<i16>
        %272 = vector.transfer_write %271, %14[%c3] : vector<i16>, tensor<3xi16>
        %273 = math.copysign %15, %15 : tensor<15x15xf16>
        %274 = arith.xori %c767099878_i64, %43 : i64
        %275 = math.fma %cst_1, %cst, %cst_1 : f16
        affine.yield %c1514081338_i64 : i64
      }
      %265 = memref.realloc %alloc_14 : memref<3xf16> to memref<3xf16>
      %266 = arith.muli %c-11434_i16, %c28366_i16 : i16
      %extracted_53 = tensor.extract %6[%c11, %c2] : tensor<15x15xi1>
      %267 = arith.cmpi sle, %c1514081338_i64, %c1514081338_i64 : i64
      scf.yield
    }
    default {
      %254 = math.exp %28 : tensor<3xf32>
      %255 = affine.load %alloc_15[%c14, %c9] : memref<15x15xi16>
      %256 = arith.xori %c-11434_i16, %255 : i16
      %257 = arith.remui %c522205298_i32, %c1063595746_i32 : i32
      %258 = tensor.empty() : tensor<15x15xi64>
      %259 = linalg.matmul ins(%1, %1 : tensor<15x15xi64>, tensor<15x15xi64>) outs(%258 : tensor<15x15xi64>) -> tensor<15x15xi64>
      %inserted_51 = tensor.insert %cst_3 into %12[%c4, %c0, %c8] : tensor<16x3x10xf32>
      %260 = index.ceildivu %c3, %c5
      %261 = vector.matrix_multiply %20, %20 {lhs_columns = 15 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<15xf32>, vector<15xf32>) -> vector<1xf32>
      %262 = bufferization.to_tensor %alloc_8 : memref<15x15xf32>
      %263 = memref.realloc %alloc_19 : memref<3xi64> to memref<10xi64>
      %rank_52 = tensor.rank %4 : tensor<3xi32>
      %264 = affine.apply affine_map<(d0, d1) -> ((d1 - (d0 - 2)) floordiv 2)>(%c4, %c12)
      %265 = memref.atomic_rmw maxu %255, %alloc_12[%c11, %c1] : (i16, memref<15x15xi16>) -> i16
      %266 = index.divs %c4, %264
      %267 = math.tan %28 : tensor<3xf32>
      %268 = math.ipowi %c2124661813_i32, %c872239861_i32 : i32
    }
    %58 = math.atan2 %cst_0, %cst_1 : f16
    %59 = arith.shli %c2124661813_i32, %c2124661813_i32 : i32
    %60 = memref.atomic_rmw addi %c1063595746_i32, %alloc_13[%c1] : (i32, memref<3xi32>) -> i32
    %splat_22 = tensor.splat %c872239861_i32 : tensor<16x3x10xi32>
    %61 = arith.ceildivsi %43, %c223865476_i64 : i64
    %62 = math.expm1 %11 : tensor<16x3x10xf16>
    %63 = math.fma %3, %11, %3 : tensor<16x3x10xf16>
    %64 = arith.floordivsi %c1514081338_i64, %c223865476_i64 : i64
    %65 = affine.load %alloc_12[%c9, %c7] : memref<15x15xi16>
    %66 = math.rsqrt %9 : tensor<3xf16>
    %alloc_23 = memref.alloc() : memref<16xf16>
    %67 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_23 : memref<16xf16>) outs(%11 : tensor<16x3x10xf16>) {
    ^bb0(%in: f16, %out: f16):
      %254 = index.add %c3, %c8
      %255 = arith.remf %cst, %cst : f16
      %256 = arith.remui %true, %true : i1
      %257 = math.ipowi %10, %10 : tensor<16x15x10xi16>
      memref.assume_alignment %alloc_5, 8 : memref<16x15x10xi64>
      %258 = arith.shrui %c2124661813_i32, %c1063595746_i32 : i32
      %259 = vector.flat_transpose %20 {columns = 5 : i32, rows = 3 : i32} : vector<15xf32> -> vector<15xf32>
      %260 = math.powf %in, %cst_0 : f16
      %261 = memref.load %alloc_13[%c2] : memref<3xi32>
      %262 = math.absf %cst_1 : f16
      %263 = vector.extract_strided_slice %29 {offsets = [11], sizes = [3], strides = [1]} : vector<16x15x10xf32> to vector<3x15x10xf32>
      %264 = vector.broadcast %c2 : index to vector<3xindex>
      %265 = vector.broadcast %true : i1 to vector<3xi1>
      %266 = vector.broadcast %cst_2 : f32 to vector<3xf32>
      vector.scatter %alloc_9[%c5, %c4] [%264], %265, %266 : memref<15x15xf32>, vector<3xindex>, vector<3xi1>, vector<3xf32>
      %267 = index.mul %c4, %c2
      %268 = math.exp2 %in : f16
      %269 = math.fma %21, %21, %21 : tensor<10xf16>
      %270 = vector.bitcast %30 : vector<16x15x10xi1> to vector<16x15x10xi1>
      %271 = math.atan2 %23, %22 : tensor<f16>
      %true_51 = index.bool.constant true
      %272 = math.copysign %8, %8 : tensor<15x15xf16>
      %inserted_52 = tensor.insert %cst into %11[%c4, %c2, %c1] : tensor<16x3x10xf16>
      memref.alloca_scope  {
        %283 = math.tan %11 : tensor<16x3x10xf16>
        %284 = arith.remui %c-11434_i16, %c-11434_i16 : i16
        %285 = arith.cmpf ord, %cst, %cst_0 : f16
        %286 = math.expm1 %cst_0 : f16
        %287 = vector.broadcast %cst_2 : f32 to vector<15x15xf32>
        %288 = vector.outerproduct %259, %20, %287 {kind = #vector.kind<maxf>} : vector<15xf32>, vector<15xf32>
        %289 = arith.shrui %c-11434_i16, %c-11434_i16 : i16
        %290 = math.ctlz %4 : tensor<3xi32>
        %291 = math.ipowi %4, %4 : tensor<3xi32>
        memref.assume_alignment %alloc, 8 : memref<15x15xi1>
        %alloc_54 = memref.alloc() : memref<16x15x10xi16>
        memref.tensor_store %10, %alloc_54 : memref<16x15x10xi16>
        %292 = memref.realloc %alloc_10 : memref<3xi64> to memref<16xi64>
        %293 = math.tan %23 : tensor<f16>
        %294 = vector.broadcast %cst_4 : f32 to vector<15x15xf32>
        %295 = vector.outerproduct %259, %20, %294 {kind = #vector.kind<add>} : vector<15xf32>, vector<15xf32>
        %296 = bufferization.clone %alloc_17 : memref<3xf32> to memref<3xf32>
        %297 = math.exp2 %3 : tensor<16x3x10xf16>
        memref.store %cst_4, %296[%c1] : memref<3xf32>
        %298 = affine.min affine_map<(d0, d1, d2, d3) -> (d1 - 2, (d2 + d1) * -8, (d2 + d1 + d1 + d1) floordiv 2)>(%c12, %c7, %c1, %c11)
        %299 = arith.minui %true_51, %true : i1
        %300 = arith.maxui %c2124661813_i32, %c1063595746_i32 : i32
        %301 = vector.broadcast %true : i1 to vector<16x15xi1>
        %302 = vector.multi_reduction <maxui>, %30, %301 [2] : vector<16x15x10xi1> to vector<16x15xi1>
        %303 = math.fma %cst_3, %cst_2, %cst_3 : f32
        %304 = arith.muli %43, %43 : i64
        %305 = math.round %9 : tensor<3xf16>
        affine.store %c28366_i16, %alloc_12[%c0, %c5] : memref<15x15xi16>
        %306 = arith.ceildivsi %65, %c28366_i16 : i16
        %307 = math.copysign %17, %3 : tensor<16x3x10xf16>
        affine.store %true, %alloc_18[%c2, %c6, %c14] : memref<16x15x10xi1>
        %308 = math.roundeven %15 : tensor<15x15xf16>
        %309 = arith.maxf %cst_0, %cst_1 : f16
        %310 = vector.broadcast %cst_4 : f32 to vector<15x10xf32>
        %dest_55, %accumulated_value_56 = vector.scan <add>, %263, %310 {inclusive = false, reduction_dim = 0 : i64} : vector<3x15x10xf32>, vector<15x10xf32>
        %311 = vector.flat_transpose %20 {columns = 5 : i32, rows = 3 : i32} : vector<15xf32> -> vector<15xf32>
        %312 = vector.broadcast %c13 : index to vector<3xindex>
        %313 = vector.broadcast %true_51 : i1 to vector<3xi1>
        %314 = vector.broadcast %cst_2 : f32 to vector<3xf32>
        vector.scatter %alloc_17[%c1] [%312], %313, %314 : memref<3xf32>, vector<3xindex>, vector<3xi1>, vector<3xf32>
      }
      %273 = math.tan %9 : tensor<3xf16>
      %274 = memref.alloca_scope  -> (i1) {
        %283 = math.cos %22 : tensor<f16>
        %284 = math.fma %11, %17, %16 : tensor<16x3x10xf16>
        %inserted_54 = tensor.insert %cst_3 into %13[%c4, %c1] : tensor<15x15xf32>
        %285 = vector.broadcast %267 : index to vector<15xindex>
        %286 = vector.broadcast %true_51 : i1 to vector<15xi1>
        vector.scatter %alloc_16[%c0, %c10, %c7] [%285], %286, %259 : memref<16x15x10xf32>, vector<15xindex>, vector<15xi1>, vector<15xf32>
        %287 = arith.subi %true_51, %true : i1
        memref.tensor_store %28, %alloc_17 : memref<3xf32>
        %288 = tensor.empty() : tensor<15x15xi16>
        %289 = linalg.matmul ins(%27, %27 : tensor<15x15xi16>, tensor<15x15xi16>) outs(%288 : tensor<15x15xi16>) -> tensor<15x15xi16>
        %290 = affine.min affine_map<(d0) -> (d0 * 2)>(%c10)
        %291 = arith.subi %c28366_i16, %65 : i16
        %292 = arith.subi %c-11434_i16, %65 : i16
        %293 = arith.maxf %cst, %cst : f16
        %294 = math.tan %15 : tensor<15x15xf16>
        %true_55 = index.bool.constant true
        %295 = vector.bitcast %20 : vector<15xf32> to vector<15xf32>
        %c2143740252_i32 = arith.constant 2143740252 : i32
        %cst_56 = arith.constant 1.000000e+00 : f32
        %296 = vector.transfer_read %alloc_16[%c1, %c2, %c10], %cst_56 : memref<16x15x10xf32>, vector<16xf32>
        affine.store %c28366_i16, %alloc_15[%c9, %c0] : memref<15x15xi16>
        %297 = tensor.empty() : tensor<15x15xf16>
        %298 = linalg.matmul ins(%8, %8 : tensor<15x15xf16>, tensor<15x15xf16>) outs(%297 : tensor<15x15xf16>) -> tensor<15x15xf16>
        %299 = math.cos %22 : tensor<f16>
        %300 = arith.minf %in, %cst_1 : f16
        %301 = arith.maxui %true_51, %true : i1
        %302 = affine.load %alloc_15[%c10, %c10] : memref<15x15xi16>
        %303 = arith.maxf %cst_56, %cst_3 : f32
        %304 = math.cttz %c-11434_i16 : i16
        %305 = arith.muli %c-11434_i16, %302 : i16
        %extracted_57 = tensor.extract %7[%c2, %c5, %c4] : tensor<16x15x10xi1>
        %306 = vector.flat_transpose %295 {columns = 5 : i32, rows = 3 : i32} : vector<15xf32> -> vector<15xf32>
        %307 = affine.min affine_map<(d0, d1, d2, d3) -> (0)>(%c15, %c1, %c6, %c10)
        %308 = math.roundeven %cst_4 : f32
        %309 = vector.bitcast %36 : vector<1x4x10xf32> to vector<1x4x10xi32>
        %310 = index.divs %c7, %41
        %311 = tensor.empty() : tensor<3xf32>
        memref.alloca_scope.return %true_51 : i1
      }
      %275 = affine.if affine_set<(d0) : (d0 >= 0, -d0 >= 0, 30 >= 0, 1 == 0)>(%c15) -> f16 {
        %283 = math.copysign %cst_4, %cst_2 : f32
        %284 = arith.cmpi ule, %true_51, %true_51 : i1
        %285 = arith.minui %c223865476_i64, %c223865476_i64 : i64
        %286 = arith.minsi %true_51, %true_51 : i1
        %287 = index.divs %c2, %41
        %288 = index.casts %c9 : index to i32
        %289 = arith.minf %cst_2, %cst_3 : f32
        %290 = math.log %15 : tensor<15x15xf16>
        affine.yield %in : f16
      } else {
        %283 = index.add %c14, %56
        %284 = memref.atomic_rmw assign %cst_2, %alloc_7[%c11, %c12, %c9] : (f32, memref<16x15x10xf32>) -> f32
        %285 = index.castu %c522205298_i32 : i32 to index
        %286 = index.divs %267, %283
        %287 = index.add %c4, %254
        %288 = arith.maxf %cst_4, %cst_2 : f32
        %289 = arith.maxsi %true_51, %274 : i1
        %290 = math.rsqrt %15 : tensor<15x15xf16>
        affine.yield %in : f16
      }
      %276 = memref.alloca_scope  -> (i16) {
        %283 = math.tan %cst_3 : f32
        %284 = arith.shrui %c28366_i16, %c28366_i16 : i16
        %285 = math.log1p %15 : tensor<15x15xf16>
        %286 = arith.shrui %c1063595746_i32, %c2124661813_i32 : i32
        %287 = index.add %c14, %267
        %288 = arith.shrsi %c223865476_i64, %c767099878_i64 : i64
        %289 = index.sub %287, %c14
        %290 = arith.cmpf ult, %out, %out : f16
        %291 = math.absi %c872239861_i32 : i32
        %292 = arith.ori %true, %true_51 : i1
        %true_54 = index.bool.constant true
        bufferization.dealloc_tensor %1 : tensor<15x15xi64>
        %293 = arith.remf %cst_0, %cst_1 : f16
        memref.assume_alignment %alloc_16, 2 : memref<16x15x10xf32>
        %294 = vector.flat_transpose %259 {columns = 5 : i32, rows = 3 : i32} : vector<15xf32> -> vector<15xf32>
        %295 = arith.shrui %c-11434_i16, %c-11434_i16 : i16
        %296 = arith.maxui %c522205298_i32, %c1063595746_i32 : i32
        %297 = arith.minf %cst_2, %cst_4 : f32
        %298 = arith.shrui %c223865476_i64, %c1514081338_i64 : i64
        %299 = vector.broadcast %c7 : index to vector<16xindex>
        %300 = vector.broadcast %274 : i1 to vector<16xi1>
        vector.scatter %alloc_18[%c10, %c7, %c3] [%299], %300, %300 : memref<16x15x10xi1>, vector<16xindex>, vector<16xi1>, vector<16xi1>
        %301 = vector.broadcast %cst_3 : f32 to vector<3xf32>
        %302 = arith.remui %c2124661813_i32, %c2124661813_i32 : i32
        %303 = math.fma %cst_1, %cst_1, %in : f16
        %304 = arith.andi %true, %true_51 : i1
        %alloc_55 = memref.alloc() : memref<15x15xf16>
        %305 = memref.realloc %alloc_17 : memref<3xf32> to memref<15xf32>
        %306 = math.cos %13 : tensor<15x15xf32>
        affine.store %65, %alloc_12[%c7, %c6] : memref<15x15xi16>
        %inserted_56 = tensor.insert %c-11434_i16 into %14[%c1] : tensor<3xi16>
        %307 = index.add %c6, %c3
        %308 = math.ipowi %5, %14 : tensor<3xi16>
        %309 = arith.remf %cst_0, %cst_0 : f16
        memref.alloca_scope.return %c-11434_i16 : i16
      }
      %277 = arith.subi %65, %c-11434_i16 : i16
      %extracted_53 = tensor.extract %16[%c10, %c2, %c3] : tensor<16x3x10xf16>
      %278 = math.copysign %15, %8 : tensor<15x15xf16>
      %279 = arith.minui %276, %276 : i16
      %280 = affine.min affine_map<(d0, d1) -> (0, -(d0 + 8) + 132)>(%56, %c6)
      %281 = vector.create_mask %c13, %c1 : vector<15x15xi1>
      %282 = arith.minui %274, %274 : i1
      linalg.yield %cst_0 : f16
    } -> tensor<16x3x10xf16>
    %68 = math.roundeven %23 : tensor<f16>
    %69 = math.log2 %cst_0 : f16
    %70 = memref.alloca_scope  -> (memref<3xf32>) {
      %254 = index.floordivs %c2, %c8
      %cast = tensor.cast %23 : tensor<f16> to tensor<f16>
      %255 = index.divu %c0, %56
      %256 = arith.minsi %c1063595746_i32, %c872239861_i32 : i32
      bufferization.dealloc_tensor %splat_22 : tensor<16x3x10xi32>
      %generated_51 = tensor.generate %c14 {
      ^bb0(%arg3: index, %arg4: index, %arg5: index):
        %285 = arith.remsi %c767099878_i64, %c767099878_i64 : i64
        %286 = math.exp2 %12 : tensor<16x3x10xf32>
        %287 = tensor.empty() : tensor<3xi32>
        %288 = arith.addi %c28366_i16, %c28366_i16 : i16
        tensor.yield %c28366_i16 : i16
      } : tensor<?x15x10xi16>
      %257 = math.ipowi %1, %1 : tensor<15x15xi64>
      %258 = math.copysign %22, %22 : tensor<f16>
      %259 = vector.extract_strided_slice %36 {offsets = [0], sizes = [1], strides = [1]} : vector<1x4x10xf32> to vector<1x4x10xf32>
      %260 = arith.floordivsi %c1063595746_i32, %c872239861_i32 : i32
      %261 = vector.broadcast %c28366_i16 : i16 to vector<3xi16>
      %262 = vector.broadcast %true : i1 to vector<3xi1>
      %263 = vector.maskedload %alloc_15[%c0, %c5], %262, %261 : memref<15x15xi16>, vector<3xi1>, vector<3xi16> into vector<3xi16>
      %264 = vector.broadcast %cst_4 : f32 to vector<16x15x10xf32>
      %265 = vector.fma %264, %29, %264 : vector<16x15x10xf32>
      %266 = memref.alloca_scope  -> (memref<15x15xf32>) {
        %285 = math.roundeven %cst : f16
        %286 = math.exp %cst_0 : f16
        memref.store %cst_4, %alloc_9[%c9, %c2] : memref<15x15xf32>
        %287 = arith.minf %cst, %cst : f16
        %288 = vector.broadcast %c1063595746_i32 : i32 to vector<16x15xi32>
        %dest_54, %accumulated_value_55 = vector.scan <add>, %31, %288 {inclusive = false, reduction_dim = 2 : i64} : vector<16x15x10xi32>, vector<16x15xi32>
        %289 = vector.broadcast %cst_2 : f32 to vector<3xf32>
        %290 = index.divu %c8, %41
        %291 = math.absi %c2124661813_i32 : i32
        %cst_56 = arith.constant 0x4D87E0C6 : f32
        %292 = vector.insertelement %cst_2, %289[%c15 : index] : vector<3xf32>
        %293 = arith.ori %43, %c223865476_i64 : i64
        %294 = vector.broadcast %cst_3 : f32 to vector<16x15xf32>
        %dest_57, %accumulated_value_58 = vector.scan <minf>, %32, %294 {inclusive = false, reduction_dim = 2 : i64} : vector<16x15x10xf32>, vector<16x15xf32>
        %295 = tensor.empty(%c8) : tensor<15x?xi1>
        %296 = math.fma %11, %11, %17 : tensor<16x3x10xf16>
        %297 = bufferization.clone %alloc_10 : memref<3xi64> to memref<3xi64>
        %false_59 = arith.constant false
        %false_60 = arith.constant false
        %298 = vector.transfer_read %alloc[%c2, %c7], %false_60 : memref<15x15xi1>, vector<i1>
        %splat_61 = tensor.splat %cst_3 : tensor<16x15x10xf32>
        %299 = math.ctpop %c1063595746_i32 : i32
        %300 = vector.broadcast %cst_3 : f32 to vector<16x10xf32>
        %dest_62, %accumulated_value_63 = vector.scan <minf>, %29, %300 {inclusive = false, reduction_dim = 1 : i64} : vector<16x15x10xf32>, vector<16x10xf32>
        %301 = vector.broadcast %cst_3 : f32 to vector<3xf32>
        %302 = vector.fma %301, %301, %289 : vector<3xf32>
        %303 = arith.shrui %c2124661813_i32, %c1063595746_i32 : i32
        %304 = arith.floordivsi %65, %c28366_i16 : i16
        %305 = arith.xori %c223865476_i64, %43 : i64
        %306 = vector.insertelement %c28366_i16, %261[%c1 : index] : vector<3xi16>
        %alloca_64 = memref.alloca() : memref<3xf32>
        %307 = arith.addf %cst_3, %cst_4 : f32
        %308 = arith.shli %c1514081338_i64, %c1514081338_i64 : i64
        memref.assume_alignment %alloc_16, 4 : memref<16x15x10xf32>
        %309 = arith.minui %c223865476_i64, %c223865476_i64 : i64
        %310 = math.atan %cst_0 : f16
        %311 = index.castu %false_59 : i1 to index
        %312 = arith.xori %c2124661813_i32, %c2124661813_i32 : i32
        memref.alloca_scope.return %alloc_9 : memref<15x15xf32>
      }
      %267 = tensor.empty() : tensor<16x15x10xf16>
      %268 = arith.cmpi sle, %true, %true : i1
      %269 = math.absi %6 : tensor<15x15xi1>
      %270 = math.powf %16, %3 : tensor<16x3x10xf16>
      %extracted_52 = tensor.extract %12[%c9, %c0, %c6] : tensor<16x3x10xf32>
      %271 = arith.remsi %true, %true : i1
      %272 = vector.extract %265[2] : vector<16x15x10xf32>
      %273 = index.casts %c522205298_i32 : i32 to index
      %274 = arith.minui %c28366_i16, %65 : i16
      %275 = index.casts %65 : i16 to index
      %276 = math.expm1 %267 : tensor<16x15x10xf16>
      %277 = memref.alloca_scope  -> (memref<16x15x10xf32>) {
        bufferization.dealloc_tensor %8 : tensor<15x15xf16>
        %285 = vector.broadcast %extracted_52 : f32 to vector<16x15xf32>
        %dest_54, %accumulated_value_55 = vector.scan <mul>, %29, %285 {inclusive = false, reduction_dim = 2 : i64} : vector<16x15x10xf32>, vector<16x15xf32>
        %286 = vector.extract_strided_slice %32 {offsets = [7], sizes = [1], strides = [1]} : vector<16x15x10xf32> to vector<1x15x10xf32>
        %inserted_56 = tensor.insert %65 into %splat[%c6, %c7, %c0] : tensor<16x15x10xi16>
        %287 = index.divs %255, %56
        %288 = index.divs %c11, %c4
        %289 = arith.muli %true, %true : i1
        %290 = math.exp %11 : tensor<16x3x10xf16>
        %291 = arith.maxui %c1514081338_i64, %c223865476_i64 : i64
        %292 = math.absf %17 : tensor<16x3x10xf16>
        %293 = arith.andi %c223865476_i64, %43 : i64
        %294 = index.add %c6, %c0
        %295 = math.absf %11 : tensor<16x3x10xf16>
        %296 = affine.apply affine_map<(d0, d1, d2, d3) -> ((d3 - 132) ceildiv 2)>(%c14, %287, %41, %c8)
        %297 = arith.negf %cst : f16
        %298 = vector.broadcast %c2 : index to vector<16xindex>
        %299 = vector.broadcast %true : i1 to vector<16xi1>
        %300 = vector.broadcast %cst_3 : f32 to vector<16xf32>
        vector.scatter %alloc_7[%c2, %c13, %c5] [%298], %299, %300 : memref<16x15x10xf32>, vector<16xindex>, vector<16xi1>, vector<16xf32>
        %301 = arith.xori %c767099878_i64, %c767099878_i64 : i64
        %302 = math.absi %1 : tensor<15x15xi64>
        %extracted_57 = tensor.extract %transposed[%c2] : tensor<3xi64>
        %303 = arith.floordivsi %extracted_57, %43 : i64
        %304 = arith.mulf %extracted_52, %cst_2 : f32
        %305 = arith.remf %cst_2, %cst_2 : f32
        %306 = index.add %275, %273
        memref.assume_alignment %alloc_8, 8 : memref<15x15xf32>
        %307 = math.floor %23 : tensor<f16>
        %308 = math.ctpop %10 : tensor<16x15x10xi16>
        %309 = arith.maxf %cst_4, %cst_4 : f32
        %310 = index.maxs %255, %294
        %311 = vector.broadcast %c9 : index to vector<3xindex>
        vector.scatter %alloc_15[%c2, %c14] [%311], %262, %261 : memref<15x15xi16>, vector<3xindex>, vector<3xi1>, vector<3xi16>
        %c1_i16 = arith.constant 1 : i16
        %c0_i16_58 = arith.constant 0 : i16
        %312 = vector.transfer_read %14[%c7], %c0_i16_58 : tensor<3xi16>, vector<i16>
        %313 = math.absf %8 : tensor<15x15xf16>
        %314 = math.exp %11 : tensor<16x3x10xf16>
        memref.alloca_scope.return %alloc_7 : memref<16x15x10xf32>
      }
      %278 = math.cttz %transposed : tensor<3xi64>
