module {
  func.func @func1(%arg0: memref<10xi16>, %arg1: tensor<10x2x10xi64>) {
    %false = arith.constant false
    %false_0 = arith.constant false
    %cst = arith.constant 4.300800e+04 : f16
    %c727661701_i64 = arith.constant 727661701 : i64
    %false_1 = arith.constant false
    %cst_2 = arith.constant 2.472000e+04 : f16
    %cst_3 = arith.constant 0x4E0A06C9 : f32
    %c939322342_i64 = arith.constant 939322342 : i64
    %cst_4 = arith.constant 7.636000e+03 : f16
    %c-14039_i16 = arith.constant -14039 : i16
    %cst_5 = arith.constant 0x4D69BE02 : f32
    %cst_6 = arith.constant 0x4E50306D : f32
    %false_7 = arith.constant false
    %true = arith.constant true
    %cst_8 = arith.constant 0x4E3BBEA5 : f32
    %c1721459475_i32 = arith.constant 1721459475 : i32
    %0 = tensor.empty() : tensor<2xi1>
    %1 = tensor.empty() : tensor<10x2x10xi1>
    %2 = tensor.empty() : tensor<2xf16>
    %3 = tensor.empty() : tensor<10x2x10xf32>
    %4 = tensor.empty() : tensor<10xi1>
    %5 = tensor.empty() : tensor<10xf32>
    %6 = tensor.empty() : tensor<10x2x10xi64>
    %7 = tensor.empty() : tensor<2xi1>
    %8 = tensor.empty() : tensor<10x2x10xi16>
    %9 = tensor.empty() : tensor<10xf16>
    %10 = tensor.empty() : tensor<10x2x10xi16>
    %11 = tensor.empty() : tensor<10xi32>
    %12 = tensor.empty() : tensor<2xf32>
    %13 = tensor.empty() : tensor<2xi64>
    %14 = tensor.empty() : tensor<10xf16>
    %15 = tensor.empty() : tensor<2xf16>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<10xf16>
    %alloc_9 = memref.alloc() : memref<10xi32>
    %alloc_10 = memref.alloc() : memref<10xi32>
    %alloc_11 = memref.alloc() : memref<10xf16>
    %alloc_12 = memref.alloc() : memref<10x2x10xi64>
    %alloc_13 = memref.alloc() : memref<2xi64>
    %alloc_14 = memref.alloc() : memref<10x2x10xf16>
    %alloc_15 = memref.alloc() : memref<2xi16>
    %alloc_16 = memref.alloc() : memref<10x2x10xi16>
    %alloc_17 = memref.alloc() : memref<2xi16>
    %alloc_18 = memref.alloc() : memref<10x2x10xf16>
    %alloc_19 = memref.alloc() : memref<10xi16>
    %alloc_20 = memref.alloc() : memref<10xi64>
    %alloc_21 = memref.alloc() : memref<2xf16>
    %alloc_22 = memref.alloc() : memref<2xi32>
    %alloc_23 = memref.alloc() : memref<10xi16>
    %16 = tensor.empty() : tensor<10xf16>
    %17 = linalg.copy ins(%14 : tensor<10xf16>) outs(%16 : tensor<10xf16>) -> tensor<10xf16>
    %alloc_24 = memref.alloc() : memref<2xi64>
    linalg.transpose ins(%13 : tensor<2xi64>) outs(%alloc_24 : memref<2xi64>) permutation = [0] 
    %alloc_25 = memref.alloc() : memref<i16>
    linalg.reduce ins(%alloc_16 : memref<10x2x10xi16>) outs(%alloc_25 : memref<i16>) dimensions = [0, 1, 2] 
      (%in: i16, %init: i16) {
        %273 = index.castu %c11 : index to i32
        %274 = vector.broadcast %c939322342_i64 : i64 to vector<10x2x10xi64>
        vector.print %274 : vector<10x2x10xi64>
        %275 = math.atan2 %3, %3 : tensor<10x2x10xf32>
        %276 = arith.addi %false_0, %true : i1
        %277 = arith.addf %cst_8, %cst_5 : f32
        %278 = arith.xori %false, %false : i1
        %279 = arith.xori %c727661701_i64, %c939322342_i64 : i64
        %280 = vector.broadcast %cst_4 : f16 to vector<10xf16>
        %c1_i16 = arith.constant 1 : i16
        linalg.yield %c1_i16 : i16
      }
    scf.parallel (%arg2, %arg3) = (%c5, %c2) to (%c0, %c6) step (%c4, %c2) {
      %273 = affine.min affine_map<(d0, d1, d2, d3) -> (d2 * 4, d3 mod 16 + 64, -d3)>(%c11, %c10, %c10, %c10)
      %274 = vector.create_mask %arg2 : vector<10xi1>
      %275 = affine.load %alloc[%c7] : memref<10xf16>
      %276 = index.maxu %c2, %c13
      %277 = arith.xori %false_7, %false_1 : i1
      %cast_39 = tensor.cast %3 : tensor<10x2x10xf32> to tensor<?x?x?xf32>
      %278 = scf.execute_region -> tensor<10xf16> {
        %289 = arith.remf %cst_2, %275 : f16
        %290 = math.fma %cst_2, %cst_2, %275 : f16
        %291 = math.log2 %12 : tensor<2xf32>
        %292 = vector.shuffle %274, %274 [0, 2, 4, 9, 10, 16, 19] : vector<10xi1>, vector<10xi1>
        %293 = vector.broadcast %c1721459475_i32 : i32 to vector<10xi32>
        %294 = vector.gather %alloc_22[%c9] [%293], %274, %293 : memref<2xi32>, vector<10xi32>, vector<10xi1>, vector<10xi32> into vector<10xi32>
        %295 = vector.create_mask %c3 : vector<10xi1>
        %296 = vector.splat %c9 : vector<10xindex>
        %297 = arith.remsi %true, %true : i1
        %298 = math.fma %cst_5, %cst_8, %cst_3 : f32
        %299 = index.mul %c9, %c6
        %300 = index.castu %false_0 : i1 to index
        %301 = index.floordivs %c2, %c15
        %302 = vector.broadcast %cst_4 : f16 to vector<10xf16>
        %303 = math.cttz %10 : tensor<10x2x10xi16>
        %304 = arith.divf %cst_3, %cst_6 : f32
        %305 = arith.divui %c727661701_i64, %c939322342_i64 : i64
        scf.yield %16 : tensor<10xf16>
      }
      %279 = arith.divsi %false_1, %false_0 : i1
      %280 = vector.shuffle %274, %274 [7, 8, 11, 12, 15, 16, 17, 19] : vector<10xi1>, vector<10xi1>
      %281 = vector.shuffle %274, %274 [1, 2, 4, 5, 6, 8, 9, 12, 13, 14, 15, 17] : vector<10xi1>, vector<10xi1>
      %282 = scf.if %false_1 -> (memref<10x2x10xf32>) {
        %289 = arith.remsi %false_7, %false_7 : i1
        %290 = arith.shrui %c727661701_i64, %c727661701_i64 : i64
        %291 = math.floor %3 : tensor<10x2x10xf32>
        %292 = arith.shrui %false, %false_7 : i1
        %293 = vector.extract_strided_slice %274 {offsets = [5], sizes = [3], strides = [1]} : vector<10xi1> to vector<3xi1>
        %294 = math.sqrt %9 : tensor<10xf16>
        %295 = vector.broadcast %cst_8 : f32 to vector<10x2x10xf32>
        %296 = vector.fma %295, %295, %295 : vector<10x2x10xf32>
        %297 = vector.load %alloc_12[%c6, %c1, %c1] : memref<10x2x10xi64>, vector<2xi64>
        %alloc_40 = memref.alloc() : memref<10x2x10xf32>
        scf.yield %alloc_40 : memref<10x2x10xf32>
      } else {
        %289 = math.round %cst_3 : f32
        %290 = math.cos %cst_5 : f32
        %291 = math.fma %278, %14, %9 : tensor<10xf16>
        %292 = arith.remf %cst_8, %cst_8 : f32
        %293 = math.log2 %3 : tensor<10x2x10xf32>
        %294 = arith.divui %c-14039_i16, %c-14039_i16 : i16
        %from_elements_40 = tensor.from_elements %false_7, %true, %false_0, %false_1, %true, %true, %false_0, %false, %false, %false_7 : tensor<10xi1>
        %295 = arith.remf %cst, %cst : f16
        %alloc_41 = memref.alloc() : memref<10x2x10xf32>
        scf.yield %alloc_41 : memref<10x2x10xf32>
      }
      %283 = arith.muli %c939322342_i64, %c727661701_i64 : i64
      %284 = vector.broadcast %c-14039_i16 : i16 to vector<4x2xi16>
      %285 = vector.broadcast %c-14039_i16 : i16 to vector<4xi16>
      %dest, %accumulated_value = vector.scan <mul>, %284, %285 {inclusive = true, reduction_dim = 1 : i64} : vector<4x2xi16>, vector<4xi16>
      %286 = math.cttz %7 : tensor<2xi1>
      %287 = index.mul %c4, %c5
      %288 = affine.load %alloc_9[%c5] : memref<10xi32>
      scf.yield
    }
    %18 = affine.vector_load %alloc_10[%c2] : memref<10xi32>, vector<4xi32>
    affine.vector_store %18, %alloc_22[%c13] : memref<2xi32>, vector<4xi32>
    %alloc_26 = memref.alloc() : memref<10xi32>
    %19 = tensor.empty() : tensor<i32>
    %20 = linalg.dot ins(%11, %alloc_26 : tensor<10xi32>, memref<10xi32>) outs(%19 : tensor<i32>) -> tensor<i32>
    %21 = arith.remui %c1721459475_i32, %c1721459475_i32 : i32
    %22 = math.log10 %cst_4 : f16
    %23 = math.cos %cst_6 : f32
    bufferization.dealloc_tensor %7 : tensor<2xi1>
    %24 = math.absi %19 : tensor<i32>
    %25 = vector.load %alloc_15[%c1] : memref<2xi16>, vector<10xi16>
    %26 = bufferization.to_memref %19 : memref<i32>
    %27 = index.floordivs %c11, %c12
    %28 = memref.realloc %alloc_15 : memref<2xi16> to memref<10xi16>
    %29 = vector.splat %true : vector<10xi1>
    %30 = arith.minsi %false_0, %false_1 : i1
    %31 = math.fma %2, %15, %15 : tensor<2xf16>
    %extracted = tensor.extract %10[%c4, %c0, %c7] : tensor<10x2x10xi16>
    %32 = arith.maxf %cst_4, %cst_4 : f16
    %33 = arith.maxf %cst_6, %cst_3 : f32
    %34 = math.tan %cst_5 : f32
    %35 = memref.realloc %alloc_19 : memref<10xi16> to memref<10xi16>
    %cast = tensor.cast %1 : tensor<10x2x10xi1> to tensor<?x?x?xi1>
    %36 = vector.shuffle %25, %25 [0, 1, 5, 8, 9, 11, 13, 14, 15, 16] : vector<10xi16>, vector<10xi16>
    %37 = math.absi %1 : tensor<10x2x10xi1>
    %38 = vector.extract_strided_slice %25 {offsets = [4], sizes = [6], strides = [1]} : vector<10xi16> to vector<6xi16>
    %39 = arith.cmpi sgt, %extracted, %c-14039_i16 : i16
    %40 = index.maxs %c7, %c5
    %41 = vector.matrix_multiply %25, %38 {lhs_columns = 2 : i32, lhs_rows = 5 : i32, rhs_columns = 3 : i32} : (vector<10xi16>, vector<6xi16>) -> vector<15xi16>
    %42 = bufferization.to_memref %0 : memref<2xi1>
    %43 = arith.addi %extracted, %extracted : i16
    %44 = math.fma %15, %2, %2 : tensor<2xf16>
    %alloca = memref.alloca() : memref<2xi64>
    %45 = math.absi %6 : tensor<10x2x10xi64>
    %46 = tensor.empty() : tensor<10x2x10xi64>
    %mapped = linalg.map ins(%6 : tensor<10x2x10xi64>) outs(%46 : tensor<10x2x10xi64>)
      (%in: i64) {
        %273 = arith.mulf %cst_3, %cst_5 : f32
        %274 = vector.broadcast %c939322342_i64 : i64 to vector<2xi64>
        %275 = vector.transfer_write %274, %46[%c9, %c14, %c10] {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : vector<2xi64>, tensor<10x2x10xi64>
        %276 = vector.broadcast %c1721459475_i32 : i32 to vector<2xi32>
        %277 = math.ipowi %6, %6 : tensor<10x2x10xi64>
        %278 = math.atan2 %2, %2 : tensor<2xf16>
        %279 = bufferization.to_memref %9 : memref<10xf16>
        %280 = arith.muli %c-14039_i16, %extracted : i16
        %cst_39 = arith.constant 2.801600e+04 : f16
        %281 = arith.andi %true, %false_7 : i1
        %from_elements_40 = tensor.from_elements %false_0, %false_1, %false_7, %false_7, %false_7, %false_7, %false_1, %false, %false_1, %false, %false_1, %false_7, %false, %true, %false_0, %false_0, %true, %false_1, %true, %false, %false_0, %false_0, %false_0, %true, %false_7, %true, %false_7, %false_0, %true, %false_7, %false_7, %false_7, %false, %false_1, %true, %false_0, %false_7, %false, %false_7, %false, %true, %false_7, %false, %false_1, %false, %false_0, %false_7, %false, %false, %false_0, %true, %false_1, %false_7, %false_7, %false_1, %false, %false_1, %false_7, %true, %true, %false, %false_1, %false_1, %false_0, %false_0, %false, %false_1, %false_1, %false_1, %false_7, %true, %false, %false, %false, %false_7, %false_1, %true, %false_7, %true, %false_7, %false_1, %false_7, %false_7, %false_1, %true, %false_0, %false_0, %false_1, %false, %false, %false, %true, %true, %false_0, %false, %true, %false_1, %false_1, %false_7, %false_1, %false_1, %false_7, %true, %false_1, %false_0, %false, %true, %false_7, %false_0, %false_1, %false_0, %false_0, %false_0, %false, %false_7, %false, %true, %false, %false, %false_7, %true, %false, %false_7, %false_1, %false_0, %false_1, %true, %false_1, %false, %false_0, %false_7, %false_1, %false_1, %false, %true, %false_7, %false_0, %false_0, %false, %false_1, %false, %false_7, %false_7, %false_7, %false_7, %true, %true, %false_7, %false, %false_0, %false_7, %false_1, %false_7, %false_1, %false_7, %false_0, %false_0, %false_7, %false_7, %false_0, %false_1, %false_7, %false_1, %false, %false_7, %true, %false_0, %true, %false_0, %true, %false_0, %false, %false_1, %false_0, %false_7, %false_1, %true, %true, %false, %false_7, %false, %false_7, %false_7, %false_0, %false_0, %false, %false_1, %true, %false_0, %false_1, %false_0, %false_1, %false_7, %false_7, %false_0, %false, %false_1, %true, %false_1, %false_0 : tensor<10x2x10xi1>
        %282 = tensor.empty() : tensor<10xi16>
        %283 = memref.realloc %alloc_22 : memref<2xi32> to memref<10xi32>
        %284 = arith.minf %cst_3, %cst_3 : f32
        %285 = affine.max affine_map<(d0) -> (d0, 0, d0 * 4 + 1, 0)>(%c9)
        %286 = math.roundeven %cst_8 : f32
        %287 = vector.matrix_multiply %18, %276 {lhs_columns = 2 : i32, lhs_rows = 2 : i32, rhs_columns = 1 : i32} : (vector<4xi32>, vector<2xi32>) -> vector<2xi32>
        %288 = vector.transpose %18, [0] : vector<4xi32> to vector<4xi32>
        %289 = vector.extract %25[6] : vector<10xi16>
        %290 = arith.remf %cst, %cst : f16
        %291 = vector.load %alloc_15[%c1] : memref<2xi16>, vector<10x2x10xi16>
        %292 = math.log10 %cst_2 : f16
        %293 = arith.maxsi %false_0, %false_1 : i1
        %294 = index.ceildivs %c5, %c7
        %295 = arith.shli %false_1, %false_1 : i1
        %296 = arith.shli %false_1, %true : i1
        %297 = bufferization.clone %alloc_18 : memref<10x2x10xf16> to memref<10x2x10xf16>
        %298 = arith.maxui %c1721459475_i32, %c1721459475_i32 : i32
        %299 = vector.broadcast %false_0 : i1 to vector<10xi1>
        %300 = vector.broadcast %c1721459475_i32 : i32 to vector<10xi32>
        %301 = vector.gather %282[%c13] [%300], %299, %25 : tensor<10xi16>, vector<10xi32>, vector<10xi1>, vector<10xi16> into vector<10xi16>
        %302 = math.cos %cst_2 : f16
        %303 = arith.maxsi %extracted, %extracted : i16
        %304 = arith.divui %false, %true : i1
        %305 = vector.matrix_multiply %301, %25 {lhs_columns = 10 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<10xi16>, vector<10xi16>) -> vector<1xi16>
        %c1_i64 = arith.constant 1 : i64
        linalg.yield %c1_i64 : i64
      }
    %47 = vector.broadcast %cst_3 : f32 to vector<10xf32>
    %48 = arith.xori %c-14039_i16, %extracted : i16
    %49 = vector.extract %25[3] : vector<10xi16>
    %50 = math.expm1 %cst_6 : f32
    %51 = arith.floordivsi %c939322342_i64, %c727661701_i64 : i64
    %52 = vector.matrix_multiply %38, %38 {lhs_columns = 6 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<6xi16>, vector<6xi16>) -> vector<1xi16>
    %53 = tensor.empty(%c9) : tensor<?xi1>
    %54 = math.ipowi %13, %13 : tensor<2xi64>
    %55 = vector.splat %false_1 : vector<10xi1>
    %56 = math.ctpop %false_1 : i1
    %57 = arith.divsi %extracted, %extracted : i16
    %58 = math.ctlz %11 : tensor<10xi32>
    %59 = math.tanh %14 : tensor<10xf16>
    %60 = vector.transpose %18, [0] : vector<4xi32> to vector<4xi32>
    %61 = arith.ceildivsi %c939322342_i64, %c939322342_i64 : i64
    %62 = affine.max affine_map<(d0) -> (-(d0 floordiv 128 + 1), -(d0 floordiv 128 + 1), d0)>(%c0)
    %63 = bufferization.clone %alloc_20 : memref<10xi64> to memref<10xi64>
    %64 = math.log2 %12 : tensor<2xf32>
    %splat = tensor.splat %cst_6 : tensor<10xf32>
    %65 = vector.load %alloc_25[] : memref<i16>, vector<2xi16>
    %66 = vector.extract %41[13] : vector<15xi16>
    %67 = index.ceildivs %c6, %c15
    %68 = index.floordivs %c10, %c4
    %69 = math.exp %17 : tensor<10xf16>
    %70 = memref.alloca_scope  -> (memref<10x2x10xf16>) {
      %273 = arith.remf %cst, %cst_4 : f16
      %274 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} outs(%1 : tensor<10x2x10xi1>) {
      ^bb0(%out: i1):
        %306 = arith.shrsi %extracted, %extracted : i16
        %307 = arith.minf %cst, %cst_2 : f16
        %308 = arith.andi %true, %false : i1
        %309 = math.log1p %14 : tensor<10xf16>
        %310 = tensor.empty(%c14) : tensor<?xi16>
        %311 = index.add %c13, %c12
        %312 = vector.extract_strided_slice %38 {offsets = [0], sizes = [5], strides = [1]} : vector<6xi16> to vector<5xi16>
        %313 = arith.divsi %c-14039_i16, %extracted : i16
        %314 = math.expm1 %2 : tensor<2xf16>
        %cast_40 = tensor.cast %9 : tensor<10xf16> to tensor<?xf16>
        %315 = math.expm1 %3 : tensor<10x2x10xf32>
        %316 = vector.broadcast %false_7 : i1 to vector<2xi1>
        %317 = vector.splat %cst_4 : vector<10x2x10xf16>
        %318 = arith.andi %c-14039_i16, %c-14039_i16 : i16
        %319 = vector.splat %false_0 : vector<10xi1>
        %320 = math.ipowi %0, %7 : tensor<2xi1>
        %321 = math.copysign %14, %9 : tensor<10xf16>
        %alloca_41 = memref.alloca() : memref<10x2x10xi32>
        %322 = math.log2 %cst_3 : f32
        %323 = memref.realloc %63 : memref<10xi64> to memref<2xi64>
        memref.assume_alignment %alloc_18, 1 : memref<10x2x10xf16>
        %324 = bufferization.to_tensor %alloc_18 : memref<10x2x10xf16>
        %325 = arith.cmpi ne, %extracted, %extracted : i16
        %326 = index.divu %c4, %27
        %327 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxui>} %25, %25, %extracted : vector<10xi16>, vector<10xi16> into i16
        %328 = vector.splat %cst_5 : vector<10xf32>
        %329 = arith.minui %c1721459475_i32, %c1721459475_i32 : i32
        %330 = math.expm1 %17 : tensor<10xf16>
        %331 = arith.divui %c-14039_i16, %c-14039_i16 : i16
        %332 = vector.broadcast %cst : f16 to vector<2xf16>
        %333 = vector.broadcast %c1721459475_i32 : i32 to vector<2xi32>
        %334 = vector.gather %alloc_14[%c13, %68, %c14] [%333], %316, %332 : memref<10x2x10xf16>, vector<2xi32>, vector<2xi1>, vector<2xf16> into vector<2xf16>
        %335 = arith.divsi %extracted, %c-14039_i16 : i16
        %336 = memref.realloc %alloc_23 : memref<10xi16> to memref<10xi16>
        linalg.yield %false_7 : i1
      } -> tensor<10x2x10xi1>
      %275 = vector.splat %c1721459475_i32 : vector<10x2x10xi32>
      %276 = arith.divsi %false_7, %false_1 : i1
      %277 = bufferization.clone %alloc_9 : memref<10xi32> to memref<10xi32>
      %278 = math.log2 %splat : tensor<10xf32>
      %279 = arith.shrsi %c-14039_i16, %c-14039_i16 : i16
      %280 = arith.divui %true, %false_7 : i1
      %281 = arith.remui %c-14039_i16, %c-14039_i16 : i16
      %282 = arith.shrsi %c939322342_i64, %c727661701_i64 : i64
      %283 = math.cos %5 : tensor<10xf32>
      %284 = arith.negf %cst_5 : f32
      %285 = index.castu %c939322342_i64 : i64 to index
      %286 = arith.maxf %cst, %cst_2 : f16
      memref.tensor_store %9, %alloc : memref<10xf16>
      %287 = math.tanh %9 : tensor<10xf16>
      %288 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%13 : tensor<2xi64>) outs(%46 : tensor<10x2x10xi64>) {
      ^bb0(%in: i64, %out: i64):
        %c681478521_i32 = arith.constant 681478521 : i32
        %306 = memref.atomic_rmw maxs %c1721459475_i32, %26[] : (i32, memref<i32>) -> i32
        %alloca_40 = memref.alloca() : memref<10xi64>
        %307 = vector.broadcast %true : i1 to vector<2xi1>
        %308 = vector.maskedload %alloc_17[%c0], %307, %65 : memref<2xi16>, vector<2xi1>, vector<2xi16> into vector<2xi16>
        %309 = math.round %cst_2 : f16
        %310 = math.rsqrt %12 : tensor<2xf32>
        affine.store %cst_4, %alloc_14[%c11, %c11, %c7] : memref<10x2x10xf16>
        %311 = index.castu %c14 : index to i32
        %312 = arith.maxf %cst_8, %cst_6 : f32
        %313 = arith.remui %out, %c939322342_i64 : i64
        %314 = vector.create_mask %c6 : vector<10xi1>
        %315 = affine.load %63[%c10] : memref<10xi64>
        %316 = memref.atomic_rmw minu %extracted, %alloc_25[] : (i16, memref<i16>) -> i16
        memref.tensor_store %16, %alloc_11 : memref<10xf16>
        %splat_41 = tensor.splat %c1721459475_i32 : tensor<10x2x10xi32>
        %317 = affine.min affine_map<(d0, d1, d2, d3) -> ((d2 - 32) * 32, (d2 - 32) * 32)>(%c3, %c5, %27, %c1)
        %318 = arith.divui %false, %false : i1
        %319 = arith.maxsi %out, %315 : i64
        %320 = math.ctpop %4 : tensor<10xi1>
        %321 = math.expm1 %15 : tensor<2xf16>
        %322 = arith.maxsi %in, %315 : i64
        %323 = arith.divf %cst_2, %cst_2 : f16
        %324 = index.castu %c12 : index to i32
        %325 = arith.minf %cst_2, %cst_2 : f16
        %326 = arith.divui %false_1, %true : i1
        %327 = math.cos %15 : tensor<2xf16>
        %328 = index.sub %27, %c0
        %329 = index.divs %c5, %67
        %alloca_42 = memref.alloca() : memref<10xi32>
        %330 = vector.transpose %65, [0] : vector<2xi16> to vector<2xi16>
        affine.store %c1721459475_i32, %26[] : memref<i32>
        %331 = arith.minsi %out, %in : i64
        linalg.yield %in : i64
      } -> tensor<10x2x10xi64>
      %289 = vector.create_mask %40 : vector<2xi1>
      %290 = index.floordivs %c11, %c5
      memref.assume_alignment %42, 8 : memref<2xi1>
      %291 = arith.minsi %false_7, %false_0 : i1
      %alloc_39 = memref.alloc() : memref<10x2x10xf32>
      %292 = vector.broadcast %false_7 : i1 to vector<10xi1>
      %293 = vector.broadcast %c1721459475_i32 : i32 to vector<10xi32>
      %294 = vector.gather %alloc_39[%c8, %27, %c3] [%293], %292, %47 : memref<10x2x10xf32>, vector<10xi32>, vector<10xi1>, vector<10xf32> into vector<10xf32>
      %295 = index.ceildivu %c14, %c8
      %296 = vector.transpose %294, [0] : vector<10xf32> to vector<10xf32>
      %297 = arith.remf %cst_2, %cst : f16
      %298 = math.expm1 %15 : tensor<2xf16>
      %299 = math.expm1 %9 : tensor<10xf16>
      %300 = tensor.empty() : tensor<10xi16>
      %301 = vector.broadcast %c1721459475_i32 : i32 to vector<2xi32>
      %302 = vector.gather %300[%c14] [%301], %289, %65 : tensor<10xi16>, vector<2xi32>, vector<2xi1>, vector<2xi16> into vector<2xi16>
      bufferization.dealloc_tensor %6 : tensor<10x2x10xi64>
      %303 = vector.flat_transpose %302 {columns = 1 : i32, rows = 2 : i32} : vector<2xi16> -> vector<2xi16>
      %304 = arith.maxf %cst_8, %cst_3 : f32
      %305 = arith.shrsi %false_7, %false_7 : i1
      memref.alloca_scope.return %alloc_18 : memref<10x2x10xf16>
    }
    %71 = math.roundeven %14 : tensor<10xf16>
    %72 = index.castu %68 : index to i32
    %from_elements = tensor.from_elements %c-14039_i16, %extracted, %extracted, %c-14039_i16, %extracted, %extracted, %extracted, %extracted, %extracted, %extracted : tensor<10xi16>
    %73 = math.ipowi %7, %0 : tensor<2xi1>
    %74 = math.log1p %17 : tensor<10xf16>
    %inserted = tensor.insert %c1721459475_i32 into %19[] : tensor<i32>
    %75 = vector.extract_strided_slice %41 {offsets = [5], sizes = [9], strides = [1]} : vector<15xi16> to vector<9xi16>
    memref.store %cst_4, %alloc_14[%c1, %c0, %c8] : memref<10x2x10xf16>
    %76 = arith.divsi %c939322342_i64, %c727661701_i64 : i64
    %77 = arith.minf %cst_8, %cst_3 : f32
    %alloc_27 = memref.alloc() : memref<10x10x2xf32>
    %78 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d2, d1)>, affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d1)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_27, %splat, %12 : memref<10x10x2xf32>, tensor<10xf32>, tensor<2xf32>) outs(%3 : tensor<10x2x10xf32>) {
    ^bb0(%in: f32, %in_39: f32, %in_40: f32, %out: f32):
      %alloca_41 = memref.alloca() : memref<2xi16>
      %273 = vector.splat %cst_6 : vector<10xf32>
      %274 = affine.max affine_map<(d0) -> (d0 * 3, d0 - 2)>(%40)
      %275 = math.powf %14, %17 : tensor<10xf16>
      %276 = vector.transpose %41, [0] : vector<15xi16> to vector<15xi16>
      %277 = bufferization.clone %alloc_26 : memref<10xi32> to memref<10xi32>
      %278 = arith.maxsi %c1721459475_i32, %c1721459475_i32 : i32
      scf.if %false_1 {
        %302 = index.floordivs %c13, %c15
        %303 = arith.divsi %c-14039_i16, %c-14039_i16 : i16
        %304 = arith.addi %c939322342_i64, %c939322342_i64 : i64
        %from_elements_43 = tensor.from_elements %c727661701_i64, %c727661701_i64, %c727661701_i64, %c939322342_i64, %c727661701_i64, %c727661701_i64, %c727661701_i64, %c939322342_i64, %c727661701_i64, %c939322342_i64 : tensor<10xi64>
        %305 = index.mul %302, %c7
        %306 = vector.shuffle %52, %25 [3, 4, 8, 9, 10] : vector<1xi16>, vector<10xi16>
        %307 = memref.atomic_rmw addf %cst_2, %alloc_11[%c9] : (f16, memref<10xf16>) -> f16
        %308 = math.absi %7 : tensor<2xi1>
      } else {
        %302 = index.add %67, %c11
        %303 = arith.mulf %in_39, %cst_5 : f32
        %304 = math.atan2 %cst_5, %out : f32
        %305 = vector.extract_strided_slice %18 {offsets = [0], sizes = [3], strides = [1]} : vector<4xi32> to vector<3xi32>
        %306 = arith.divui %true, %false : i1
        %307 = math.absf %splat : tensor<10xf32>
        %308 = affine.load %alloc_18[%c7, %c11, %c3] : memref<10x2x10xf16>
        %309 = vector.transpose %65, [0] : vector<2xi16> to vector<2xi16>
      }
      %279 = bufferization.to_tensor %alloc_15 : memref<2xi16>
      %280 = math.sqrt %5 : tensor<10xf32>
      %281 = vector.broadcast %false_7 : i1 to vector<10xi1>
      %282 = vector.matrix_multiply %25, %38 {lhs_columns = 2 : i32, lhs_rows = 5 : i32, rhs_columns = 3 : i32} : (vector<10xi16>, vector<6xi16>) -> vector<15xi16>
      %283 = arith.minf %cst_3, %cst_3 : f32
      %284 = arith.minf %cst_3, %out : f32
      %285 = memref.realloc %alloc : memref<10xf16> to memref<2xf16>
      memref.assume_alignment %alloc_19, 1 : memref<10xi16>
      %286 = arith.shrsi %false_7, %false : i1
      %287 = bufferization.clone %alloc_17 : memref<2xi16> to memref<2xi16>
      %288 = vector.broadcast %c-14039_i16 : i16 to vector<i16>
      %289 = vector.transfer_write %288, %from_elements[%c3] : vector<i16>, tensor<10xi16>
      %290 = arith.remf %cst_6, %cst_5 : f32
      %291 = vector.extract %75[6] : vector<9xi16>
      %292 = vector.extract_strided_slice %281 {offsets = [6], sizes = [1], strides = [1]} : vector<10xi1> to vector<1xi1>
      %293 = math.cos %cst_3 : f32
      %294 = index.casts %true : i1 to index
      %295 = index.maxs %c0, %c2
      %296 = vector.splat %cst_5 : vector<10xf32>
      %297 = vector.create_mask %c7 : vector<2xi1>
      %298 = arith.maxf %out, %cst_6 : f32
      %299 = math.log2 %cst_8 : f32
      %extracted_42 = tensor.extract %1[%c9, %c0, %c8] : tensor<10x2x10xi1>
      %300 = vector.insert %c-14039_i16, %38 [3] : i16 into vector<6xi16>
      %301 = bufferization.clone %alloc_26 : memref<10xi32> to memref<10xi32>
      linalg.yield %out : f32
    } -> tensor<10x2x10xf32>
    %79 = index.floordivs %67, %c12
    %80 = memref.atomic_rmw assign %c1721459475_i32, %alloc_9[%c4] : (i32, memref<10xi32>) -> i32
    %81 = arith.maxf %cst_5, %cst_8 : f32
    %82 = vector.flat_transpose %41 {columns = 5 : i32, rows = 3 : i32} : vector<15xi16> -> vector<15xi16>
    %83 = vector.extract_strided_slice %41 {offsets = [6], sizes = [1], strides = [1]} : vector<15xi16> to vector<1xi16>
    %84 = arith.addf %cst_4, %cst_4 : f16
    %85 = math.expm1 %cst_6 : f32
    %86 = index.ceildivu %c11, %c10
    %87 = math.ipowi %1, %1 : tensor<10x2x10xi1>
    %88 = vector.insertelement %cst_8, %47[%c8 : index] : vector<10xf32>
    %cast_28 = tensor.cast %7 : tensor<2xi1> to tensor<?xi1>
    %89 = arith.remui %false_7, %false_1 : i1
    %90 = index.sub %67, %c5
    %91 = vector.transpose %47, [0] : vector<10xf32> to vector<10xf32>
    %92 = bufferization.to_memref %46 : memref<10x2x10xi64>
    %93 = index.ceildivs %c11, %c7
    %94 = vector.broadcast %cst_6 : f32 to vector<10x2x10xf32>
    %95 = vector.broadcast %false_1 : i1 to vector<10x2x10xi1>
    %96 = vector.broadcast %c1721459475_i32 : i32 to vector<10x2x10xi32>
    %97 = vector.gather %splat[%79] [%96], %95, %94 : tensor<10xf32>, vector<10x2x10xi32>, vector<10x2x10xi1>, vector<10x2x10xf32> into vector<10x2x10xf32>
    %98 = vector.insert %47, %94 [2, 1] : vector<10xf32> into vector<10x2x10xf32>
    %99 = vector.flat_transpose %38 {columns = 2 : i32, rows = 3 : i32} : vector<6xi16> -> vector<6xi16>
    %100 = arith.mulf %cst_8, %cst_5 : f32
    %101 = index.castu %true : i1 to index
    %102 = math.fma %14, %14, %16 : tensor<10xf16>
    %103 = math.expm1 %cst_8 : f32
    %inserted_29 = tensor.insert %false_7 into %0[%c0] : tensor<2xi1>
    %104 = arith.addf %cst_3, %cst_5 : f32
    %105 = vector.insert %extracted, %65 [0] : i16 into vector<2xi16>
    %106 = vector.broadcast %93 : index to vector<2xindex>
    %107 = vector.broadcast %false_7 : i1 to vector<2xi1>
    %108 = vector.broadcast %c1721459475_i32 : i32 to vector<2xi32>
    vector.scatter %alloc_26[%c9] [%106], %107, %108 : memref<10xi32>, vector<2xindex>, vector<2xi1>, vector<2xi32>
    %109 = math.tanh %cst : f16
    %110 = math.expm1 %cst_5 : f32
    %111 = tensor.empty() : tensor<2xi64>
    %mapped_30 = linalg.map ins(%13, %alloc_24 : tensor<2xi64>, memref<2xi64>) outs(%111 : tensor<2xi64>)
      (%in: i64, %in_39: i64) {
        %273 = vector.flat_transpose %52 {columns = 1 : i32, rows = 1 : i32} : vector<1xi16> -> vector<1xi16>
        %274 = bufferization.clone %alloc_15 : memref<2xi16> to memref<2xi16>
        %275 = math.exp %cst_4 : f16
        %276 = arith.maxsi %c1721459475_i32, %c1721459475_i32 : i32
        %277 = index.sizeof
        %278 = arith.maxsi %false_0, %false_7 : i1
        %279 = math.sqrt %14 : tensor<10xf16>
        %280 = index.mul %27, %79
        %281 = arith.remsi %false_0, %false : i1
        %282 = index.ceildivs %93, %c3
        %283 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxui>} %38, %38, %extracted : vector<6xi16>, vector<6xi16> into i16
        %284 = arith.remsi %false, %false_1 : i1
        %285 = math.ipowi %c727661701_i64, %c939322342_i64 : i64
        %286 = arith.remf %cst_5, %cst_6 : f32
        %287 = arith.divsi %false, %false : i1
        scf.if %false {
          %303 = bufferization.to_tensor %alloc_16 : memref<10x2x10xi16>
          %304 = math.ceil %15 : tensor<2xf16>
          %305 = math.cttz %8 : tensor<10x2x10xi16>
          %306 = vector.matrix_multiply %18, %18 {lhs_columns = 4 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<4xi32>, vector<4xi32>) -> vector<1xi32>
          %307 = vector.broadcast %cst_6 : f32 to vector<10x2xf32>
          %dest, %accumulated_value = vector.scan <mul>, %94, %307 {inclusive = true, reduction_dim = 2 : i64} : vector<10x2x10xf32>, vector<10x2xf32>
          %alloca_41 = memref.alloca() : memref<10xf32>
          %alloc_42 = memref.alloc() : memref<10x2x10xf32>
          memref.tensor_store %3, %alloc_42 : memref<10x2x10xf32>
          %308 = arith.divf %cst_4, %cst : f16
        }
        %288 = vector.matrix_multiply %82, %273 {lhs_columns = 1 : i32, lhs_rows = 15 : i32, rhs_columns = 1 : i32} : (vector<15xi16>, vector<1xi16>) -> vector<15xi16>
        %289 = bufferization.to_memref %12 : memref<2xf32>
        %290 = math.log1p %17 : tensor<10xf16>
        %291 = tensor.empty() : tensor<10x2x10xf16>
        %292 = arith.andi %in, %c939322342_i64 : i64
        %293 = math.cttz %false_7 : i1
        %294 = vector.insertelement %extracted, %288[%90 : index] : vector<15xi16>
        %295 = vector.transpose %94, [1, 0, 2] : vector<10x2x10xf32> to vector<2x10x10xf32>
        memref.tensor_store %14, %alloc_11 : memref<10xf16>
        %296 = math.cos %15 : tensor<2xf16>
        %297 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<add>} %288, %41, %c-14039_i16 : vector<15xi16>, vector<15xi16> into i16
        %298 = arith.maxf %cst_5, %cst_3 : f32
        %299 = index.divs %79, %62
        %300 = math.ctlz %1 : tensor<10x2x10xi1>
        %alloc_40 = memref.alloc() : memref<10x10xf32>
        %301 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%5, %alloc_40, %5 : tensor<10xf32>, memref<10x10xf32>, tensor<10xf32>) outs(%3 : tensor<10x2x10xf32>) {
        ^bb0(%in_41: f32, %in_42: f32, %in_43: f32, %out: f32):
          %303 = index.add %c14, %c2
          %304 = arith.remf %cst_5, %cst_5 : f32
          %305 = math.tan %9 : tensor<10xf16>
          %306 = arith.addf %cst_2, %cst_4 : f16
          %307 = arith.addi %true, %false_1 : i1
          %308 = arith.shrsi %false, %false : i1
          %309 = arith.remui %true, %false : i1
          %310 = arith.remsi %false_7, %false_1 : i1
          %cst_44 = arith.constant 0x4E63D306 : f32
          %311 = index.ceildivu %282, %299
          %312 = math.sqrt %16 : tensor<10xf16>
          %313 = arith.remui %false_0, %false : i1
          %alloc_45 = memref.alloc() : memref<i16>
          memref.copy %alloc_25, %alloc_45 : memref<i16> to memref<i16>
          %314 = math.ipowi %46, %6 : tensor<10x2x10xi64>
          %315 = index.maxu %c1, %68
          %316 = index.castu %c4 : index to i32
          %317 = vector.extract_strided_slice %25 {offsets = [2], sizes = [3], strides = [1]} : vector<10xi16> to vector<3xi16>
          %318 = arith.remf %in_43, %cst_6 : f32
          %319 = arith.minsi %false_1, %false_1 : i1
          %320 = math.ctlz %10 : tensor<10x2x10xi16>
          affine.store %extracted, %alloc_16[%c14, %c12, %c5] : memref<10x2x10xi16>
          %321 = vector.flat_transpose %47 {columns = 5 : i32, rows = 2 : i32} : vector<10xf32> -> vector<10xf32>
          %322 = math.expm1 %3 : tensor<10x2x10xf32>
          %323 = math.ceil %cst_2 : f16
          %324 = math.ipowi %10, %10 : tensor<10x2x10xi16>
          %325 = arith.maxsi %false_0, %false_1 : i1
          %326 = bufferization.to_tensor %alloc_20 : memref<10xi64>
          %327 = bufferization.clone %70 : memref<10x2x10xf16> to memref<10x2x10xf16>
          %328 = math.expm1 %291 : tensor<10x2x10xf16>
          %329 = vector.splat %86 : vector<10x2x10xindex>
          %330 = arith.maxsi %c727661701_i64, %in_39 : i64
          %331 = vector.flat_transpose %82 {columns = 5 : i32, rows = 3 : i32} : vector<15xi16> -> vector<15xi16>
          linalg.yield %cst_3 : f32
        } -> tensor<10x2x10xf32>
        %302 = math.powf %291, %291 : tensor<10x2x10xf16>
        %c0_i64 = arith.constant 0 : i64
        linalg.yield %c0_i64 : i64
      }
    %112 = vector.broadcast %c-14039_i16 : i16 to vector<6x6xi16>
    %113 = vector.outerproduct %99, %99, %112 {kind = #vector.kind<xor>} : vector<6xi16>, vector<6xi16>
    %114 = bufferization.clone %alloc_26 : memref<10xi32> to memref<10xi32>
    %115 = index.castu %c939322342_i64 : i64 to index
    %116 = arith.muli %c-14039_i16, %extracted : i16
    %117 = arith.negf %cst_2 : f16
    %118 = math.ctpop %c727661701_i64 : i64
    %119 = tensor.empty() : tensor<2xi64>
    %120 = math.ctpop %extracted : i16
    %121 = scf.while (%arg2 = %cst) : (f16) -> f16 {
      %273 = arith.addi %false_1, %false_1 : i1
      %274 = math.sqrt %cst_8 : f32
      %275 = math.absi %4 : tensor<10xi1>
      %276 = arith.shrsi %false_0, %true : i1
      %277 = math.expm1 %17 : tensor<10xf16>
      %278 = arith.remui %false, %false_0 : i1
      %279 = vector.matrix_multiply %41, %65 {lhs_columns = 1 : i32, lhs_rows = 15 : i32, rhs_columns = 2 : i32} : (vector<15xi16>, vector<2xi16>) -> vector<30xi16>
      %280 = index.castu %c6 : index to i32
      scf.condition(%false) %cst : f16
    } do {
    ^bb0(%arg2: f16):
      %extracted_39 = tensor.extract %5[%c8] : tensor<10xf32>
      %273 = index.ceildivu %c11, %c12
      %274 = vector.matrix_multiply %82, %75 {lhs_columns = 3 : i32, lhs_rows = 5 : i32, rhs_columns = 3 : i32} : (vector<15xi16>, vector<9xi16>) -> vector<15xi16>
      %275 = math.ipowi %false, %false_1 : i1
      %276 = index.castu %c727661701_i64 : i64 to index
      %277 = math.sqrt %cst_8 : f32
      %278 = arith.addf %cst_6, %cst_6 : f32
      %cast_40 = tensor.cast %7 : tensor<2xi1> to tensor<?xi1>
      %279 = vector.flat_transpose %41 {columns = 5 : i32, rows = 3 : i32} : vector<15xi16> -> vector<15xi16>
      %280 = index.mul %40, %c12
      %281 = vector.splat %c8 : vector<10xindex>
      %282 = tensor.empty() : tensor<10xi64>
      %283 = vector.broadcast %c939322342_i64 : i64 to vector<2xi64>
      %284 = vector.broadcast %false_1 : i1 to vector<2xi1>
      %285 = vector.broadcast %c1721459475_i32 : i32 to vector<2xi32>
      %286 = vector.gather %282[%c8] [%285], %284, %283 : tensor<10xi64>, vector<2xi32>, vector<2xi1>, vector<2xi64> into vector<2xi64>
      %287 = vector.flat_transpose %279 {columns = 5 : i32, rows = 3 : i32} : vector<15xi16> -> vector<15xi16>
      %288 = vector.insert %c939322342_i64, %286 [0] : i64 into vector<2xi64>
      %289 = math.log1p %3 : tensor<10x2x10xf32>
      %290 = affine.load %alloc_25[] : memref<i16>
      scf.yield %cst_4 : f16
    }
    %122 = arith.xori %false_1, %false : i1
    scf.if %false_1 {
      %273 = arith.xori %false_1, %false_7 : i1
      %274 = math.ceil %14 : tensor<10xf16>
      %275 = affine.load %alloc_20[%c11] : memref<10xi64>
      %276 = arith.shrsi %false_0, %false_7 : i1
      %277 = math.round %cst : f16
      %278 = math.atan2 %cst, %cst : f16
      %279 = vector.flat_transpose %82 {columns = 5 : i32, rows = 3 : i32} : vector<15xi16> -> vector<15xi16>
      %280 = index.add %c8, %c7
    } else {
      %273 = affine.load %alloc_17[%c13] : memref<2xi16>
      %collapsed = tensor.collapse_shape %46 [[0, 1], [2]] : tensor<10x2x10xi64> into tensor<20x10xi64>
      %274 = index.floordivs %40, %c11
      %275 = vector.shuffle %95, %95 [0, 8, 9, 13, 14, 19] : vector<10x2x10xi1>, vector<10x2x10xi1>
      %276 = arith.remui %false_7, %false_0 : i1
      %277 = math.round %16 : tensor<10xf16>
      %278 = math.ceil %12 : tensor<2xf32>
      %279 = math.exp %5 : tensor<10xf32>
    }
    %123 = math.ctlz %c939322342_i64 : i64
    %124 = math.cos %15 : tensor<2xf16>
    bufferization.dealloc_tensor %4 : tensor<10xi1>
    %125 = math.tanh %9 : tensor<10xf16>
    %126 = affine.min affine_map<(d0, d1) -> (-(d1 - d0 ceildiv 4 - 2), d1 - 2, d1 - d0 ceildiv 4 - 2)>(%62, %c9)
    %127 = scf.index_switch %62 -> memref<2xf32> 
    case 1 {
      %273 = vector.broadcast %extracted : i16 to vector<10x2x10xi16>
      %274 = vector.gather %from_elements[%c8] [%96], %95, %273 : tensor<10xi16>, vector<10x2x10xi32>, vector<10x2x10xi1>, vector<10x2x10xi16> into vector<10x2x10xi16>
      %275 = arith.divsi %false_1, %false : i1
      %generated_39 = tensor.generate %c4, %c4, %79 {
      ^bb0(%arg2: index, %arg3: index, %arg4: index):
        %286 = memref.atomic_rmw assign %c727661701_i64, %alloc_13[%c1] : (i64, memref<2xi64>) -> i64
        %287 = math.absf %9 : tensor<10xf16>
        %cst_43 = arith.constant 1.692800e+04 : f16
        %288 = index.add %c6, %115
        tensor.yield %c727661701_i64 : i64
      } : tensor<?x?x?xi64>
      %276 = arith.minsi %c1721459475_i32, %c1721459475_i32 : i32
      %277 = vector.matrix_multiply %75, %25 {lhs_columns = 1 : i32, lhs_rows = 9 : i32, rhs_columns = 10 : i32} : (vector<9xi16>, vector<10xi16>) -> vector<90xi16>
      %278 = index.divu %c10, %c3
      %279 = math.powf %2, %2 : tensor<2xf16>
      %280 = arith.divf %cst, %cst_4 : f16
      %281 = bufferization.to_memref %46 : memref<10x2x10xi64>
      %282 = vector.flat_transpose %65 {columns = 1 : i32, rows = 2 : i32} : vector<2xi16> -> vector<2xi16>
      scf.execute_region {
        %286 = arith.divsi %c-14039_i16, %extracted : i16
        %287 = index.maxu %c8, %93
        %288 = bufferization.clone %alloc_9 : memref<10xi32> to memref<10xi32>
        %289 = arith.divf %cst_2, %cst_2 : f16
        %290 = arith.minsi %false_1, %false_1 : i1
        %291 = vector.matrix_multiply %18, %18 {lhs_columns = 4 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<4xi32>, vector<4xi32>) -> vector<1xi32>
        %from_elements_43 = tensor.from_elements %cst_3, %cst_5 : tensor<2xf32>
        %292 = arith.divsi %c-14039_i16, %extracted : i16
        %cast_44 = tensor.cast %20 : tensor<i32> to tensor<i32>
        %from_elements_45 = tensor.from_elements %false_1, %true, %false_0, %false_0, %false_7, %false_1, %false_7, %false_1, %false_7, %false_1, %false_0, %false_0, %false, %true, %true, %false_7, %false_7, %false_0, %false_1, %false_1, %false_0, %false_7, %false_1, %false_1, %true, %true, %false_0, %false_7, %true, %false_1, %false_1, %true, %false_1, %true, %false, %false_7, %false_1, %false, %false_0, %true, %false, %false, %false, %true, %true, %false, %false_1, %false_1, %true, %false_1, %true, %false_1, %false_7, %false, %false_1, %false_1, %false, %false_7, %true, %true, %false, %false, %false_0, %false_1, %false_0, %true, %false_0, %true, %false_1, %false_1, %false_7, %false_0, %false, %false, %false_7, %false_0, %false, %false_1, %false_1, %true, %false_1, %false_1, %false_7, %false_7, %false_1, %false, %false_7, %false_1, %false_7, %false_0, %false_7, %true, %false, %false_0, %false, %false_1, %false_0, %false_1, %false_1, %false_7, %false_0, %true, %false_0, %false_7, %false_0, %false, %false, %false_7, %true, %true, %true, %false_1, %false_0, %false_7, %false_0, %false_0, %false, %false_0, %false_0, %false, %false_7, %false, %false_1, %false_7, %false_0, %false_1, %false_1, %true, %false, %false, %false_1, %false_7, %false_7, %false_7, %false, %false_1, %false_1, %false, %false_0, %false, %false_7, %false_1, %false_7, %false_0, %false_0, %false_7, %false, %false, %false_7, %false_0, %false, %false_0, %false_1, %false_1, %true, %false_1, %false_1, %false_1, %false_1, %true, %false_0, %false_1, %false_7, %false, %true, %true, %false_0, %false_1, %true, %false, %false_1, %false_7, %false_0, %true, %true, %false_1, %false, %false_7, %false, %false_0, %false, %false_7, %false_1, %true, %false_0, %true, %false_1, %false, %true, %false, %false_1, %false_0, %true, %true, %true, %false_7, %false_0, %false_1, %true, %true : tensor<10x2x10xi1>
        %293 = bufferization.to_memref %0 : memref<2xi1>
        %294 = index.floordivs %27, %c6
        %295 = arith.shrsi %c1721459475_i32, %c1721459475_i32 : i32
        %296 = math.tanh %cst : f16
        %297 = arith.minsi %false_1, %false : i1
        %298 = math.cos %from_elements_43 : tensor<2xf32>
        scf.yield
      }
      %from_elements_40 = tensor.from_elements %cst_4, %cst_2, %cst_4, %cst_4, %cst_4, %cst_4, %cst_4, %cst_2, %cst_4, %cst_2, %cst_4, %cst_2, %cst, %cst_4, %cst, %cst, %cst_2, %cst_2, %cst, %cst, %cst_4, %cst_4, %cst_4, %cst_2, %cst, %cst_2, %cst_4, %cst_2, %cst_2, %cst_2, %cst, %cst_4, %cst_4, %cst_2, %cst_4, %cst_2, %cst_2, %cst_4, %cst, %cst_2, %cst, %cst_4, %cst_2, %cst, %cst_2, %cst_2, %cst_4, %cst, %cst_4, %cst, %cst, %cst_4, %cst, %cst_2, %cst_4, %cst_4, %cst_2, %cst_4, %cst_4, %cst_2, %cst, %cst, %cst_2, %cst, %cst, %cst_4, %cst, %cst_4, %cst_2, %cst_4, %cst_4, %cst_2, %cst_2, %cst_4, %cst, %cst_2, %cst_2, %cst, %cst, %cst_2, %cst_2, %cst_4, %cst, %cst_2, %cst_4, %cst, %cst_4, %cst, %cst_2, %cst_4, %cst, %cst, %cst_4, %cst, %cst_4, %cst_2, %cst, %cst, %cst, %cst_2, %cst_2, %cst, %cst_2, %cst_4, %cst_4, %cst, %cst_2, %cst_2, %cst_4, %cst_2, %cst, %cst, %cst, %cst_4, %cst_4, %cst, %cst_4, %cst_2, %cst_4, %cst_2, %cst_4, %cst_2, %cst, %cst, %cst_2, %cst_2, %cst_2, %cst_4, %cst, %cst, %cst_4, %cst_4, %cst, %cst_4, %cst, %cst, %cst, %cst, %cst_2, %cst, %cst_4, %cst_2, %cst_2, %cst_4, %cst_4, %cst, %cst, %cst_4, %cst_2, %cst, %cst, %cst, %cst_2, %cst, %cst_4, %cst_2, %cst_2, %cst_2, %cst_4, %cst, %cst_4, %cst_4, %cst_2, %cst_4, %cst, %cst_4, %cst_2, %cst, %cst, %cst_2, %cst_4, %cst_2, %cst, %cst, %cst, %cst, %cst_4, %cst_2, %cst, %cst_2, %cst, %cst, %cst, %cst, %cst_4, %cst_2, %cst_4, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst, %cst, %cst_2, %cst_4, %cst_4, %cst, %cst_4, %cst_4 : tensor<10x2x10xf16>
      %cast_41 = tensor.cast %from_elements : tensor<10xi16> to tensor<?xi16>
      %283 = vector.splat %false_1 : vector<10xi1>
      %284 = bufferization.clone %alloc_24 : memref<2xi64> to memref<2xi64>
      %285 = math.exp %5 : tensor<10xf32>
      %alloc_42 = memref.alloc() : memref<2xf32>
      scf.yield %alloc_42 : memref<2xf32>
    }
    case 2 {
      %273 = math.ceil %5 : tensor<10xf32>
      %274 = affine.load %alloc_11[%c1] : memref<10xf16>
      %275 = vector.splat %c4 : vector<2xindex>
      %276 = math.ipowi %c-14039_i16, %extracted : i16
      %277 = arith.addi %c1721459475_i32, %c1721459475_i32 : i32
      vector.print %97 : vector<10x2x10xf32>
      %278 = math.log %cst_4 : f16
      %279 = math.expm1 %cst_5 : f32
      %280 = math.sqrt %splat : tensor<10xf32>
      %281 = tensor.empty(%115) : tensor<?xf32>
      %282 = affine.apply affine_map<(d0, d1, d2) -> ((d2 ceildiv 2) * 8)>(%c7, %c8, %c2)
      %283 = arith.mulf %cst_4, %cst : f16
      scf.index_switch %c3 
      case 1 {
        %287 = arith.shrsi %c727661701_i64, %c939322342_i64 : i64
        %288 = tensor.empty() : tensor<10xf32>
        %289 = bufferization.clone %alloc_12 : memref<10x2x10xi64> to memref<10x2x10xi64>
        %290 = arith.negf %cst_3 : f32
        %291 = bufferization.clone %114 : memref<10xi32> to memref<10xi32>
        %292 = index.mul %90, %62
        %293 = arith.maxui %false, %false_0 : i1
        %294 = math.atan2 %3, %3 : tensor<10x2x10xf32>
        %295 = index.castu %false_1 : i1 to index
        %296 = math.log2 %2 : tensor<2xf16>
        %alloca_40 = memref.alloca() : memref<10xi64>
        %297 = memref.atomic_rmw maxs %c1721459475_i32, %alloc_26[%c5] : (i32, memref<10xi32>) -> i32
        %298 = math.absi %10 : tensor<10x2x10xi16>
        %299 = vector.broadcast %c8 : index to vector<10xindex>
        %300 = vector.broadcast %false_1 : i1 to vector<10xi1>
        %301 = vector.broadcast %c727661701_i64 : i64 to vector<10xi64>
        vector.scatter %alloc_12[%c7, %c1, %c0] [%299], %300, %301 : memref<10x2x10xi64>, vector<10xindex>, vector<10xi1>, vector<10xi64>
        %302 = arith.shrsi %extracted, %extracted : i16
        vector.print %97 : vector<10x2x10xf32>
        scf.yield
      }
      case 2 {
        %287 = vector.insert %c-14039_i16, %75 [3] : i16 into vector<9xi16>
        bufferization.dealloc_tensor %11 : tensor<10xi32>
        %288 = arith.cmpi ne, %extracted, %c-14039_i16 : i16
        %collapsed = tensor.collapse_shape %8 [[0, 1], [2]] : tensor<10x2x10xi16> into tensor<20x10xi16>
        %289 = arith.cmpi ule, %c1721459475_i32, %c1721459475_i32 : i32
        %inserted_40 = tensor.insert %274 into %15[%c0] : tensor<2xf16>
        %290 = math.log1p %cst_6 : f32
        %rank = tensor.rank %13 : tensor<2xi64>
        %291 = tensor.empty() : tensor<2xi16>
        %292 = vector.broadcast %true : i1 to vector<2xi1>
        %293 = vector.broadcast %c1721459475_i32 : i32 to vector<2xi32>
        %294 = vector.gather %291[%c12] [%293], %292, %65 : tensor<2xi16>, vector<2xi32>, vector<2xi1>, vector<2xi16> into vector<2xi16>
        %295 = arith.andi %true, %false : i1
        %296 = bufferization.to_memref %17 : memref<10xf16>
        %alloc_41 = memref.alloc() : memref<10x2xi16>
        %297 = tensor.empty() : tensor<20x2xi16>
        %298 = linalg.matmul ins(%collapsed, %alloc_41 : tensor<20x10xi16>, memref<10x2xi16>) outs(%297 : tensor<20x2xi16>) -> tensor<20x2xi16>
        %299 = index.mul %c4, %c13
        %300 = math.expm1 %cst : f16
        %301 = math.exp %14 : tensor<10xf16>
        %302 = math.absf %14 : tensor<10xf16>
        scf.yield
      }
      default {
        %from_elements_40 = tensor.from_elements %cst_5, %cst_6, %cst_8, %cst_6, %cst_6, %cst_3, %cst_5, %cst_5, %cst_5, %cst_5 : tensor<10xf32>
        %287 = index.ceildivs %c13, %86
        %288 = arith.ceildivsi %c939322342_i64, %c939322342_i64 : i64
        %289 = bufferization.to_memref %12 : memref<2xf32>
        %290 = memref.realloc %alloc_11 : memref<10xf16> to memref<10xf16>
        %291 = tensor.empty() : tensor<2xi32>
        %292 = vector.broadcast %c1721459475_i32 : i32 to vector<10xi32>
        %293 = vector.broadcast %false_7 : i1 to vector<10xi1>
        %294 = vector.gather %291[%287] [%292], %293, %292 : tensor<2xi32>, vector<10xi32>, vector<10xi1>, vector<10xi32> into vector<10xi32>
        %295 = arith.minsi %c727661701_i64, %c939322342_i64 : i64
        %296 = math.expm1 %274 : f16
        %297 = arith.remf %274, %cst_2 : f16
        %298 = arith.minf %cst_4, %cst_2 : f16
