module {
  func.func @func1(%arg0: i64, %arg1: vector<5x3xi64>) -> vector<3x7xi1> {
    %cst = arith.constant 2.587200e+04 : f16
    %cst_0 = arith.constant 0x4DAFC963 : f32
    %cst_1 = arith.constant 0x4D4C457D : f32
    %c8444_i16 = arith.constant 8444 : i16
    %c1819932308_i64 = arith.constant 1819932308 : i64
    %c-32532_i16 = arith.constant -32532 : i16
    %c1322531054_i32 = arith.constant 1322531054 : i32
    %cst_2 = arith.constant 1.896970e+09 : f32
    %c-7432_i16 = arith.constant -7432 : i16
    %cst_3 = arith.constant 0x4E63B73C : f32
    %c1821487250_i32 = arith.constant 1821487250 : i32
    %false = arith.constant false
    %c-25136_i16 = arith.constant -25136 : i16
    %c87979853_i32 = arith.constant 87979853 : i32
    %c24758_i16 = arith.constant 24758 : i16
    %c-2387_i16 = arith.constant -2387 : i16
    %0 = tensor.empty() : tensor<10x10x7xi1>
    %1 = tensor.empty() : tensor<3x7xi1>
    %2 = tensor.empty() : tensor<3x7xi64>
    %3 = tensor.empty() : tensor<3x10xi32>
    %4 = tensor.empty() : tensor<3x10xi64>
    %5 = tensor.empty() : tensor<10x10x7xi32>
    %6 = tensor.empty() : tensor<5x3xi32>
    %7 = tensor.empty() : tensor<3x10xi64>
    %8 = tensor.empty() : tensor<10x10x7xi1>
    %9 = tensor.empty() : tensor<5x3xi64>
    %10 = tensor.empty() : tensor<3x7xf32>
    %11 = tensor.empty() : tensor<10x10x7xi16>
    %12 = tensor.empty() : tensor<10x10x7xi1>
    %13 = tensor.empty() : tensor<10x10x7xi64>
    %14 = tensor.empty() : tensor<5x3xf16>
    %15 = tensor.empty() : tensor<3x10xi32>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<3x10xf16>
    %alloc_4 = memref.alloc() : memref<3x7xf16>
    %alloc_5 = memref.alloc() : memref<5x3xi64>
    %alloc_6 = memref.alloc() : memref<5x3xi16>
    %alloc_7 = memref.alloc() : memref<3x7xi64>
    %alloc_8 = memref.alloc() : memref<10x10x7xi64>
    %alloc_9 = memref.alloc() : memref<10x10x7xi16>
    %alloc_10 = memref.alloc() : memref<3x7xf32>
    %alloc_11 = memref.alloc() : memref<3x10xi64>
    %alloc_12 = memref.alloc() : memref<3x10xi16>
    %alloc_13 = memref.alloc() : memref<10x10x7xi64>
    %alloc_14 = memref.alloc() : memref<3x10xi64>
    %alloc_15 = memref.alloc() : memref<5x3xi32>
    %alloc_16 = memref.alloc() : memref<3x7xi64>
    %alloc_17 = memref.alloc() : memref<3x10xi1>
    %alloc_18 = memref.alloc() : memref<3x10xf32>
    %16 = tensor.empty() : tensor<10x10x7xi64>
    %17 = linalg.copy ins(%13 : tensor<10x10x7xi64>) outs(%16 : tensor<10x10x7xi64>) -> tensor<10x10x7xi64>
    %18 = tensor.empty() : tensor<7x10x10xi64>
    %transposed = linalg.transpose ins(%13 : tensor<10x10x7xi64>) outs(%18 : tensor<7x10x10xi64>) permutation = [2, 0, 1] 
    %alloc_19 = memref.alloc() : memref<10xi64>
    linalg.reduce ins(%4 : tensor<3x10xi64>) outs(%alloc_19 : memref<10xi64>) dimensions = [0] 
      (%in: i64, %init: i64) {
        %248 = vector.broadcast %init : i64 to vector<3xi64>
        %249 = vector.reduction <minsi>, %248 : vector<3xi64> into i64
        %250 = affine.load %alloc_7[%c3, %c13] : memref<3x7xi64>
        %251 = arith.andi %c1322531054_i32, %c1821487250_i32 : i32
        %252 = memref.realloc %alloc_19 : memref<10xi64> to memref<5xi64>
        %253 = vector.broadcast %cst_0 : f32 to vector<3x7xf32>
        %254 = memref.atomic_rmw maxf %cst, %alloc[%c1, %c9] : (f16, memref<3x10xf16>) -> f16
        %255 = math.sqrt %cst : f16
        memref.alloca_scope  {
          %256 = arith.floordivsi %c-2387_i16, %c-7432_i16 : i16
          %257 = index.maxu %c14, %c14
          %258 = arith.subi %in, %init : i64
          %259 = math.sqrt %10 : tensor<3x7xf32>
          %260 = arith.shrsi %c1322531054_i32, %c87979853_i32 : i32
          %261 = math.floor %cst_2 : f32
          %262 = memref.load %alloc_9[%c8, %c1, %c5] : memref<10x10x7xi16>
          %263 = arith.shrui %c8444_i16, %c-25136_i16 : i16
          %264 = memref.realloc %alloc_19 : memref<10xi64> to memref<3xi64>
          %265 = math.tan %cst_1 : f32
          %266 = vector.broadcast %cst_3 : f32 to vector<5xf32>
          %267 = vector.broadcast %cst_2 : f32 to vector<5x5xf32>
          %268 = vector.outerproduct %266, %266, %267 {kind = #vector.kind<add>} : vector<5xf32>, vector<5xf32>
          %269 = vector.broadcast %c87979853_i32 : i32 to vector<7xi32>
          %270 = vector.insertelement %c87979853_i32, %269[%c13 : index] : vector<7xi32>
          %271 = vector.broadcast %cst_1 : f32 to vector<3x7xf32>
          %272 = vector.fma %271, %253, %271 : vector<3x7xf32>
          %273 = arith.andi %c-32532_i16, %c24758_i16 : i16
          %274 = vector.flat_transpose %269 {columns = 7 : i32, rows = 1 : i32} : vector<7xi32> -> vector<7xi32>
          %275 = math.roundeven %cst_0 : f32
          %276 = vector.broadcast %c13 : index to vector<10xindex>
          %277 = vector.broadcast %false : i1 to vector<10xi1>
          %278 = vector.broadcast %init : i64 to vector<10xi64>
          vector.scatter %alloc_8[%c7, %c9, %c0] [%276], %277, %278 : memref<10x10x7xi64>, vector<10xindex>, vector<10xi1>, vector<10xi64>
          %279 = vector.create_mask %c11, %c6 : vector<3x10xi1>
          %280 = vector.broadcast %c5 : index to vector<7xindex>
          %281 = vector.broadcast %false : i1 to vector<7xi1>
          vector.scatter %alloc_15[%c4, %c1] [%280], %281, %274 : memref<5x3xi32>, vector<7xindex>, vector<7xi1>, vector<7xi32>
          %282 = vector.flat_transpose %274 {columns = 7 : i32, rows = 1 : i32} : vector<7xi32> -> vector<7xi32>
          %from_elements_38 = tensor.from_elements %cst_1, %cst_1, %cst_1, %cst_0, %cst_2, %cst_1, %cst_3, %cst_1, %cst_3, %cst_1, %cst_1, %cst_1, %cst_3, %cst_3, %cst_1, %cst_3, %cst_1, %cst_1, %cst_2, %cst_2, %cst_2 : tensor<3x7xf32>
          %283 = math.copysign %cst_0, %cst_3 : f32
          memref.assume_alignment %alloc_10, 4 : memref<3x7xf32>
          %284 = memref.realloc %alloc_19 : memref<10xi64> to memref<5xi64>
          %285 = arith.mulf %cst_3, %cst_1 : f32
          %286 = arith.mulf %cst_2, %cst_3 : f32
          memref.tensor_store %6, %alloc_15 : memref<5x3xi32>
          %from_elements_39 = tensor.from_elements %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false : tensor<3x10xi1>
          %287 = vector.reduction <xor>, %274 : vector<7xi32> into i32
          %288 = bufferization.clone %alloc_18 : memref<3x10xf32> to memref<3x10xf32>
          %289 = arith.minf %cst_1, %cst_1 : f32
          %alloc_40 = memref.alloc() : memref<10x10x7xi1>
          memref.tensor_store %8, %alloc_40 : memref<10x10x7xi1>
        }
        %c0_i64 = arith.constant 0 : i64
        linalg.yield %c0_i64 : i64
      }
    %19 = scf.parallel (%arg2) = (%c6) to (%c4) step (%c13) init (%11) -> tensor<10x10x7xi16> {
      %248 = affine.max affine_map<(d0, d1) -> (d0 + 8, (-(d1 floordiv 16)) ceildiv 4)>(%c7, %c3)
      %249 = tensor.empty(%c9) : tensor<?x10xi32>
      %250 = math.log2 %14 : tensor<5x3xf16>
      %251 = vector.broadcast %cst : f16 to vector<5xf16>
      %252 = vector.broadcast %cst : f16 to vector<5x5xf16>
      %253 = vector.outerproduct %251, %251, %252 {kind = #vector.kind<mul>} : vector<5xf16>, vector<5xf16>
      bufferization.dealloc_tensor %0 : tensor<10x10x7xi1>
      %254 = vector.broadcast %c1322531054_i32 : i32 to vector<3x10xi32>
      vector.print %254 : vector<3x10xi32>
      %255 = bufferization.to_memref %transposed : memref<7x10x10xi64>
      %256 = vector.broadcast %c-2387_i16 : i16 to vector<10xi16>
      %257 = vector.reduction <minui>, %256 : vector<10xi16> into i16
      scf.execute_region {
        %264 = math.powf %cst_0, %cst_0 : f32
        %rank_42 = tensor.rank %13 : tensor<10x10x7xi64>
        %265 = vector.broadcast %cst : f16 to vector<10xf16>
        %266 = vector.matrix_multiply %265, %265 {lhs_columns = 10 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<10xf16>, vector<10xf16>) -> vector<1xf16>
        %267 = math.exp2 %cst : f16
        %268 = index.castu %248 : index to i32
        %269 = bufferization.clone %alloc_5 : memref<5x3xi64> to memref<5x3xi64>
        %270 = tensor.empty() : tensor<7x7xi64>
        %271 = tensor.empty() : tensor<3x7xi64>
        %272 = linalg.matmul ins(%2, %270 : tensor<3x7xi64>, tensor<7x7xi64>) outs(%271 : tensor<3x7xi64>) -> tensor<3x7xi64>
        %273 = math.cos %14 : tensor<5x3xf16>
        %274 = math.absf %cst_3 : f32
        %275 = tensor.empty() : tensor<10x10x7xf32>
        %276 = vector.extract_strided_slice %265 {offsets = [1], sizes = [2], strides = [1]} : vector<10xf16> to vector<2xf16>
        %277 = bufferization.to_memref %5 : memref<10x10x7xi32>
        memref.store %c1322531054_i32, %277[%c5, %c1, %c5] : memref<10x10x7xi32>
        %278 = vector.flat_transpose %265 {columns = 5 : i32, rows = 2 : i32} : vector<10xf16> -> vector<10xf16>
        %279 = vector.extract_strided_slice %265 {offsets = [2], sizes = [2], strides = [1]} : vector<10xf16> to vector<2xf16>
        %280 = arith.remf %cst, %cst : f16
        scf.yield
      }
      %258 = arith.cmpf oge, %cst_2, %cst_1 : f32
      %true_38 = index.bool.constant true
      %generated_39 = tensor.generate %c6, %c5 {
      ^bb0(%arg3: index, %arg4: index):
        %264 = tensor.empty() : tensor<3x10xf16>
        %265 = math.ceil %14 : tensor<5x3xf16>
        %266 = vector.bitcast %254 : vector<3x10xi32> to vector<3x10xi32>
        %267 = arith.muli %c-32532_i16, %c-32532_i16 : i16
        tensor.yield %c1819932308_i64 : i64
      } : tensor<?x?xi64>
      %259 = memref.atomic_rmw ori %c-7432_i16, %alloc_12[%c2, %c6] : (i16, memref<3x10xi16>) -> i16
      %260 = arith.ceildivsi %false, %false : i1
      %261 = math.sqrt %cst_1 : f32
      %262 = vector.broadcast %c1322531054_i32 : i32 to vector<3xi32>
      %dest_40, %accumulated_value_41 = vector.scan <mul>, %254, %262 {inclusive = false, reduction_dim = 1 : i64} : vector<3x10xi32>, vector<3xi32>
      %263 = tensor.empty() : tensor<10x10x7xi16>
      scf.reduce(%263)  : tensor<10x10x7xi16> {
      ^bb0(%arg3: tensor<10x10x7xi16>, %arg4: tensor<10x10x7xi16>):
        %264 = affine.apply affine_map<(d0, d1) -> (d0)>(%c13, %c12)
        %265 = math.log1p %14 : tensor<5x3xf16>
        %266 = vector.extract_strided_slice %254 {offsets = [1], sizes = [2], strides = [1]} : vector<3x10xi32> to vector<2x10xi32>
        %267 = arith.minui %true_38, %true_38 : i1
        vector.print %254 : vector<3x10xi32>
        %268 = arith.minui %false, %true_38 : i1
        %269 = math.floor %14 : tensor<5x3xf16>
        %270 = math.log %cst_2 : f32
        %271 = tensor.empty() : tensor<10x10x7xi16>
        scf.reduce.return %271 : tensor<10x10x7xi16>
      }
      scf.yield
    }
    %20 = affine.vector_load %alloc[%c13, %c1] : memref<3x10xf16>, vector<3xf16>
    affine.vector_store %20, %alloc_4[%c3, %c14] : memref<3x7xf16>, vector<3xf16>
    %21 = tensor.empty() : tensor<10xi64>
    %22 = tensor.empty() : tensor<i64>
    %23 = linalg.dot ins(%alloc_19, %21 : memref<10xi64>, tensor<10xi64>) outs(%22 : tensor<i64>) -> tensor<i64>
    %24 = arith.maxui %c-32532_i16, %c-32532_i16 : i16
    %25 = vector.broadcast %cst : f16 to vector<3x3xf16>
    %26 = vector.outerproduct %20, %20, %25 {kind = #vector.kind<maxf>} : vector<3xf16>, vector<3xf16>
    memref.assume_alignment %alloc_7, 2 : memref<3x7xi64>
    %27 = scf.while (%arg2 = %cst_2) : (f32) -> f32 {
      %248 = vector.multi_reduction <maxf>, %20, %cst [0] : vector<3xf16> to f16
      %249 = math.log %cst_0 : f32
      %250 = vector.flat_transpose %20 {columns = 3 : i32, rows = 1 : i32} : vector<3xf16> -> vector<3xf16>
      memref.store %cst, %alloc[%c2, %c2] : memref<3x10xf16>
      %251 = arith.muli %c1322531054_i32, %c1322531054_i32 : i32
      %252 = math.tan %arg2 : f32
      %cast_38 = tensor.cast %12 : tensor<10x10x7xi1> to tensor<?x?x?xi1>
      vector.print %250 : vector<3xf16>
      scf.condition(%false) %cst_1 : f32
    } do {
    ^bb0(%arg2: f32):
      %248 = math.cttz %c-7432_i16 : i16
      %249 = index.sub %c12, %c2
      %250 = scf.index_switch %c14 -> tensor<5x3xi64> 
      case 1 {
        %260 = arith.mulf %cst, %cst : f16
        %261 = math.expm1 %cst_2 : f32
        %262 = vector.bitcast %20 : vector<3xf16> to vector<3xf16>
        %263 = arith.divsi %c-32532_i16, %c-32532_i16 : i16
        %264 = math.copysign %arg2, %arg2 : f32
        %265 = vector.broadcast %c-7432_i16 : i16 to vector<i16>
        vector.transfer_write %265, %alloc_12[%249, %c12] : vector<i16>, memref<3x10xi16>
        %alloc_40 = memref.alloc() : memref<3x7xi32>
        %266 = bufferization.to_memref %9 : memref<5x3xi64>
        %267 = math.ipowi %5, %5 : tensor<10x10x7xi32>
        %splat_41 = tensor.splat %c1821487250_i32 : tensor<5x3xi32>
        %268 = vector.broadcast %c13 : index to vector<7xindex>
        %269 = vector.broadcast %false : i1 to vector<7xi1>
        vector.scatter %alloc_17[%c1, %c9] [%268], %269, %269 : memref<3x10xi1>, vector<7xindex>, vector<7xi1>, vector<7xi1>
        %270 = arith.divui %c1819932308_i64, %c1819932308_i64 : i64
        %271 = arith.muli %c-2387_i16, %c-2387_i16 : i16
        %272 = arith.remui %c1819932308_i64, %c1819932308_i64 : i64
        %273 = math.tan %10 : tensor<3x7xf32>
        %274 = vector.multi_reduction <minf>, %262, %cst [0] : vector<3xf16> to f16
        scf.yield %9 : tensor<5x3xi64>
      }
      default {
        %260 = bufferization.to_memref %1 : memref<3x7xi1>
        %261 = vector.broadcast %c12 : index to vector<5xindex>
        %262 = vector.broadcast %false : i1 to vector<5xi1>
        %263 = vector.broadcast %c1322531054_i32 : i32 to vector<5xi32>
        vector.scatter %alloc_15[%c0, %c0] [%261], %262, %263 : memref<5x3xi32>, vector<5xindex>, vector<5xi1>, vector<5xi32>
        %264 = math.powf %arg2, %cst_2 : f32
        %265 = math.cttz %3 : tensor<3x10xi32>
        %266 = math.roundeven %arg2 : f32
        memref.store %cst_0, %alloc_18[%c0, %c2] : memref<3x10xf32>
        %267 = bufferization.to_memref %4 : memref<3x10xi64>
        %268 = math.tan %cst_0 : f32
        %269 = arith.remf %cst, %cst : f16
        %270 = arith.remui %false, %false : i1
        %271 = math.cttz %11 : tensor<10x10x7xi16>
        %272 = vector.multi_reduction <mul>, %20, %cst [0] : vector<3xf16> to f16
        %273 = arith.divui %c8444_i16, %c24758_i16 : i16
        %274 = arith.subi %c-32532_i16, %c-7432_i16 : i16
        %275 = vector.extract %20[0] : vector<3xf16>
        %276 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<mul>} %20, %20, %cst : vector<3xf16>, vector<3xf16> into f16
        scf.yield %9 : tensor<5x3xi64>
      }
      %inserted_38 = tensor.insert %c1819932308_i64 into %17[%c2, %c0, %c1] : tensor<10x10x7xi64>
      %251 = index.floordivs %c1, %c3
      %extracted_39 = tensor.extract %6[%c3, %c0] : tensor<5x3xi32>
      %252 = math.log %cst : f16
      %253 = arith.addf %cst_3, %arg2 : f32
      %254 = math.absf %cst : f16
      memref.store %c1819932308_i64, %alloc_13[%c6, %c6, %c5] : memref<10x10x7xi64>
      %255 = bufferization.to_memref %17 : memref<10x10x7xi64>
      vector.print %20 : vector<3xf16>
      %256 = math.log2 %arg2 : f32
      %257 = math.floor %14 : tensor<5x3xf16>
      %258 = vector.flat_transpose %20 {columns = 3 : i32, rows = 1 : i32} : vector<3xf16> -> vector<3xf16>
      %259 = arith.cmpf uno, %cst_0, %cst_1 : f32
      scf.yield %cst_0 : f32
    }
    %28 = math.log10 %14 : tensor<5x3xf16>
    %29 = vector.broadcast %cst_1 : f32 to vector<3x7xf32>
    %30 = arith.floordivsi %c8444_i16, %c24758_i16 : i16
    %31 = index.ceildivs %c10, %c0
    %32 = math.absf %cst_2 : f32
    %33 = memref.load %alloc_4[%c1, %c5] : memref<3x7xf16>
    %34 = arith.remf %cst_2, %cst_0 : f32
    %35 = math.copysign %cst_0, %cst_1 : f32
    %36 = arith.divui %c-32532_i16, %c-2387_i16 : i16
    %37 = math.log1p %14 : tensor<5x3xf16>
    %38 = tensor.empty() : tensor<5x10xi32>
    %39 = linalg.matmul ins(%6, %3 : tensor<5x3xi32>, tensor<3x10xi32>) outs(%38 : tensor<5x10xi32>) -> tensor<5x10xi32>
    %inserted = tensor.insert %c87979853_i32 into %6[%c1, %c1] : tensor<5x3xi32>
    %40 = arith.cmpf ugt, %cst_2, %cst_0 : f32
    %41 = math.log1p %cst_0 : f32
    memref.assume_alignment %alloc_8, 16 : memref<10x10x7xi64>
    %cast = tensor.cast %10 : tensor<3x7xf32> to tensor<?x?xf32>
    %42 = math.absf %cst_1 : f32
    %43 = arith.floordivsi %c-32532_i16, %c24758_i16 : i16
    %44 = math.tan %14 : tensor<5x3xf16>
    %45 = index.ceildivs %c6, %c15
    %46 = bufferization.to_memref %3 : memref<3x10xi32>
    %47 = arith.shrsi %c1819932308_i64, %c1819932308_i64 : i64
    %48 = arith.remui %c87979853_i32, %c87979853_i32 : i32
    %49 = math.cttz %c-2387_i16 : i16
    %50 = math.cttz %5 : tensor<10x10x7xi32>
    memref.tensor_store %4, %alloc_11 : memref<3x10xi64>
    %51 = vector.broadcast %cst_3 : f32 to vector<3x7xf32>
    %52 = vector.fma %51, %29, %51 : vector<3x7xf32>
    %53 = vector.broadcast %cst_2 : f32 to vector<7x7xf32>
    %54 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = ["parallel", "parallel", "reduction"], kind = #vector.kind<add>} %29, %51, %53 : vector<3x7xf32>, vector<3x7xf32> into vector<7x7xf32>
    %55 = affine.apply affine_map<(d0, d1, d2) -> (d1 mod 32 - (d0 + d1))>(%c0, %c4, %c2)
    %56 = arith.shli %c-7432_i16, %c8444_i16 : i16
    %57 = math.ceil %cst_0 : f32
    %58 = index.divs %31, %c9
    affine.for %arg2 = 0 to 108 {
    }
    %59 = vector.broadcast %cst_3 : f32 to vector<7xf32>
    %dest, %accumulated_value = vector.scan <add>, %51, %59 {inclusive = false, reduction_dim = 0 : i64} : vector<3x7xf32>, vector<7xf32>
    %60 = vector.extract %52[2] : vector<3x7xf32>
    %61 = math.absf %14 : tensor<5x3xf16>
    %alloc_20 = memref.alloc() : memref<10x10x7xf32>
    %62 = vector.broadcast %false : i1 to vector<3x7xi1>
    %63 = vector.broadcast %c1322531054_i32 : i32 to vector<3x7xi32>
    %64 = vector.gather %alloc_20[%c11, %c2, %c4] [%63], %62, %51 : memref<10x10x7xf32>, vector<3x7xi32>, vector<3x7xi1>, vector<3x7xf32> into vector<3x7xf32>
    %65 = arith.remsi %c-2387_i16, %c-7432_i16 : i16
    %expanded = tensor.expand_shape %3 [[0], [1, 2]] : tensor<3x10xi32> into tensor<3x10x1xi32>
    %66 = arith.cmpf oge, %cst_0, %cst_3 : f32
    %67 = index.floordivs %c14, %58
    %68 = memref.atomic_rmw addi %c1819932308_i64, %alloc_8[%c8, %c4, %c2] : (i64, memref<10x10x7xi64>) -> i64
    %alloc_21 = memref.alloc() : memref<5x3xi64>
    %from_elements = tensor.from_elements %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false : tensor<3x10xi1>
    %69 = index.ceildivu %c13, %c14
    %70 = arith.xori %c1821487250_i32, %c87979853_i32 : i32
    %71 = math.log1p %14 : tensor<5x3xf16>
    %72 = tensor.empty() : tensor<i64>
    %mapped = linalg.map ins(%22 : tensor<i64>) outs(%72 : tensor<i64>)
      (%in: i64) {
        %248 = index.ceildivu %c15, %45
        %249 = index.sizeof
        %250 = math.tan %cst_1 : f32
        %251 = math.expm1 %14 : tensor<5x3xf16>
        %252 = arith.subi %c87979853_i32, %c87979853_i32 : i32
        %alloc_38 = memref.alloc() : memref<10x3xi32>
        %253 = tensor.empty() : tensor<3x3xi32>
        %254 = linalg.matmul ins(%15, %alloc_38 : tensor<3x10xi32>, memref<10x3xi32>) outs(%253 : tensor<3x3xi32>) -> tensor<3x3xi32>
        %255 = arith.remui %c8444_i16, %c-32532_i16 : i16
        %256 = math.powf %cst_0, %cst_1 : f32
        %257 = affine.if affine_set<(d0, d1) : ((d1 - d0) * 32 >= 0, (d1 mod 8) * 64 == 0)>(%c11, %c9) -> i1 {
          %285 = arith.ceildivsi %c24758_i16, %c-32532_i16 : i16
          %286 = memref.atomic_rmw assign %c1819932308_i64, %alloc_5[%c4, %c2] : (i64, memref<5x3xi64>) -> i64
          %287 = math.log2 %cst : f16
          %alloca = memref.alloca() : memref<3x10xf32>
          %288 = arith.remf %cst, %cst : f16
          %289 = index.maxu %c3, %c14
          %290 = arith.muli %c-7432_i16, %c-7432_i16 : i16
          %291 = math.tan %cst : f16
          affine.yield %false : i1
        } else {
          %285 = arith.divsi %c8444_i16, %c-7432_i16 : i16
          %286 = vector.broadcast %c-25136_i16 : i16 to vector<3x7xi16>
          %287 = affine.load %alloc_18[%c14, %c10] : memref<3x10xf32>
          %288 = memref.atomic_rmw ori %in, %alloc_14[%c1, %c0] : (i64, memref<3x10xi64>) -> i64
          %289 = arith.ceildivsi %c-25136_i16, %c-32532_i16 : i16
          %from_elements_40 = tensor.from_elements %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32 : tensor<10x10x7xi32>
          %290 = math.log10 %cst_2 : f32
          %291 = bufferization.to_memref %18 : memref<7x10x10xi64>
          affine.yield %false : i1
        }
        %258 = math.log %cst_1 : f32
        %259 = vector.extract %64[2] : vector<3x7xf32>
        %260 = memref.realloc %alloc_19 : memref<10xi64> to memref<7xi64>
        %261 = math.log1p %10 : tensor<3x7xf32>
        %262 = arith.shrui %c-7432_i16, %c-25136_i16 : i16
        %alloc_39 = memref.alloc() : memref<10x10x7xf32>
        memref.copy %alloc_20, %alloc_39 : memref<10x10x7xf32> to memref<10x10x7xf32>
        %263 = arith.mulf %cst_2, %cst_0 : f32
        %264 = vector.extract_strided_slice %60 {offsets = [5], sizes = [2], strides = [1]} : vector<7xf32> to vector<2xf32>
        %265 = vector.create_mask %45, %55 : vector<5x3xi1>
        affine.store %cst_2, %alloc_10[%c13, %c6] : memref<3x7xf32>
        %266 = arith.subi %c-7432_i16, %c8444_i16 : i16
        %267 = math.sqrt %cst_0 : f32
        %268 = vector.broadcast %c11 : index to vector<5xindex>
        %269 = vector.broadcast %false : i1 to vector<5xi1>
        %270 = vector.broadcast %c24758_i16 : i16 to vector<5xi16>
        vector.scatter %alloc_9[%c2, %c7, %c4] [%268], %269, %270 : memref<10x10x7xi16>, vector<5xindex>, vector<5xi1>, vector<5xi16>
        %271 = math.log2 %cst_2 : f32
        %272 = arith.remui %c24758_i16, %c8444_i16 : i16
        %273 = tensor.empty() : tensor<10x3xi64>
        %274 = tensor.empty() : tensor<3x3xi64>
        %275 = linalg.matmul ins(%7, %273 : tensor<3x10xi64>, tensor<10x3xi64>) outs(%274 : tensor<3x3xi64>) -> tensor<3x3xi64>
        %276 = vector.broadcast %cst_1 : f32 to vector<10x10x7xf32>
        %277 = vector.fma %276, %276, %276 : vector<10x10x7xf32>
        %278 = arith.divui %c24758_i16, %c-25136_i16 : i16
        %279 = arith.maxui %c87979853_i32, %c1821487250_i32 : i32
        %280 = math.absf %14 : tensor<5x3xf16>
        %281 = memref.atomic_rmw minf %cst, %alloc[%c0, %c0] : (f16, memref<3x10xf16>) -> f16
        %282 = vector.insertelement %cst_0, %264[%c6 : index] : vector<2xf32>
        %283 = vector.broadcast %c87979853_i32 : i32 to vector<3xi32>
        %284 = vector.multi_reduction <mul>, %63, %283 [1] : vector<3x7xi32> to vector<3xi32>
        %c0_i64 = arith.constant 0 : i64
        linalg.yield %c0_i64 : i64
      }
    %73 = vector.broadcast %cst_0 : f32 to vector<3xf32>
    %74 = vector.multi_reduction <mul>, %29, %73 [1] : vector<3x7xf32> to vector<3xf32>
    %75 = arith.remf %cst_0, %cst_1 : f32
    %76 = bufferization.to_memref %0 : memref<10x10x7xi1>
    %alloc_22 = memref.alloc() : memref<3x7xf16>
    %c228166804_i32 = arith.constant 228166804 : i32
    %77 = arith.addf %cst_0, %cst_3 : f32
    %78 = arith.divsi %c-32532_i16, %c-32532_i16 : i16
    %79 = math.ctlz %c-7432_i16 : i16
    %generated = tensor.generate %c12, %c11 {
    ^bb0(%arg2: index, %arg3: index):
      %248 = arith.muli %c-25136_i16, %c-32532_i16 : i16
      %249 = math.log1p %cst_0 : f32
      affine.for %arg4 = 0 to 3 {
      }
      %alloc_38 = memref.alloc() : memref<5x3xi16>
      memref.copy %alloc_6, %alloc_38 : memref<5x3xi16> to memref<5x3xi16>
      tensor.yield %cst_2 : f32
    } : tensor<?x?xf32>
    %rank = tensor.rank %14 : tensor<5x3xf16>
    %80 = vector.extract_strided_slice %51 {offsets = [0], sizes = [3], strides = [1]} : vector<3x7xf32> to vector<3x7xf32>
    %81 = tensor.empty() : tensor<3x10xi32>
    %mapped_23 = linalg.map ins(%15 : tensor<3x10xi32>) outs(%81 : tensor<3x10xi32>)
      (%in: i32) {
        %248 = arith.mulf %cst, %cst : f16
        %249 = arith.maxui %c1819932308_i64, %c1819932308_i64 : i64
        memref.assume_alignment %46, 16 : memref<3x10xi32>
        %250 = vector.reduction <mul>, %60 : vector<7xf32> into f32
        %251 = math.cttz %c-7432_i16 : i16
        %252 = vector.splat %rank : vector<3x10xindex>
        %253 = arith.maxui %c24758_i16, %c-2387_i16 : i16
        %254 = arith.muli %c24758_i16, %c-32532_i16 : i16
        %255 = arith.minf %cst_2, %cst_0 : f32
        %256 = index.ceildivu %c4, %c10
        %257 = math.cttz %c8444_i16 : i16
        %258 = arith.muli %false, %false : i1
        %259 = arith.shli %c24758_i16, %c24758_i16 : i16
        %260 = index.mul %55, %c2
        bufferization.dealloc_tensor %14 : tensor<5x3xf16>
        %261 = vector.transpose %20, [0] : vector<3xf16> to vector<3xf16>
        %262 = math.fma %cst_2, %cst_1, %cst_3 : f32
        %263 = tensor.empty() : tensor<3x7xi16>
        %264 = arith.shrui %c-7432_i16, %c-25136_i16 : i16
        vector.print %63 : vector<3x7xi32>
        %265 = math.absf %cst_3 : f32
        vector.print %60 : vector<7xf32>
        %266 = arith.floordivsi %c1819932308_i64, %c1819932308_i64 : i64
        %267 = math.rsqrt %cst_3 : f32
        %268 = vector.broadcast %cst : f16 to vector<3x3xf16>
        %269 = vector.outerproduct %20, %20, %268 {kind = #vector.kind<minf>} : vector<3xf16>, vector<3xf16>
        %270 = math.log1p %cst_1 : f32
        %271 = vector.broadcast %c1819932308_i64 : i64 to vector<i64>
        vector.transfer_write %271, %alloc_19[%c10] : vector<i64>, memref<10xi64>
        %272 = vector.bitcast %62 : vector<3x7xi1> to vector<3x7xi1>
        %273 = vector.broadcast %c-25136_i16 : i16 to vector<3xi16>
        %274 = vector.broadcast %false : i1 to vector<3xi1>
        %275 = vector.maskedload %alloc_9[%c7, %c6, %c4], %274, %273 : memref<10x10x7xi16>, vector<3xi1>, vector<3xi16> into vector<3xi16>
        %276 = index.mul %256, %c5
        %277 = math.log %cst_1 : f32
        affine.store %false, %alloc_17[%c3, %c15] : memref<3x10xi1>
        %c1_i32 = arith.constant 1 : i32
        linalg.yield %c1_i32 : i32
      }
    %82 = memref.realloc %alloc_19 : memref<10xi64> to memref<7xi64>
    %83 = vector.broadcast %cst_3 : f32 to vector<3x3xf32>
    %84 = vector.outerproduct %73, %73, %83 {kind = #vector.kind<add>} : vector<3xf32>, vector<3xf32>
    %85 = arith.minsi %false, %false : i1
    %86 = affine.max affine_map<(d0, d1, d2, d3) -> (d2 * 64, d0)>(%55, %31, %c0, %c2)
    %87 = vector.matrix_multiply %60, %60 {lhs_columns = 7 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<7xf32>, vector<7xf32>) -> vector<1xf32>
    %88 = math.log1p %10 : tensor<3x7xf32>
    %89 = math.log10 %cst_0 : f32
    %90 = index.sizeof
    %91 = vector.transpose %51, [0, 1] : vector<3x7xf32> to vector<3x7xf32>
    %92 = vector.transpose %62, [1, 0] : vector<3x7xi1> to vector<7x3xi1>
    %93 = vector.broadcast %cst_3 : f32 to vector<3x7xf32>
    %94 = vector.fma %93, %64, %52 : vector<3x7xf32>
    %95 = affine.apply affine_map<(d0, d1, d2) -> (d1 mod 32 - (d0 + d1))>(%55, %c11, %c14)
    affine.for %arg2 = 0 to 52 {
    }
    %96 = memref.atomic_rmw maxu %c87979853_i32, %alloc_15[%c1, %c0] : (i32, memref<5x3xi32>) -> i32
    %97 = vector.contract {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0)>], iterator_types = ["parallel", "reduction"], kind = #vector.kind<mul>} %29, %60, %73 : vector<3x7xf32>, vector<7xf32> into vector<3xf32>
    %98 = arith.remui %c-25136_i16, %c-25136_i16 : i16
    %99 = vector.splat %55 : vector<3x10xindex>
    %alloc_24 = memref.alloc() : memref<3x10xi1>
    memref.copy %alloc_17, %alloc_24 : memref<3x10xi1> to memref<3x10xi1>
    %100 = vector.extract_strided_slice %29 {offsets = [1], sizes = [1], strides = [1]} : vector<3x7xf32> to vector<1x7xf32>
    %101 = math.round %10 : tensor<3x7xf32>
    %102 = math.log1p %14 : tensor<5x3xf16>
    %103 = math.ctlz %18 : tensor<7x10x10xi64>
    %104 = math.tan %10 : tensor<3x7xf32>
    %105 = vector.extract %93[2] : vector<3x7xf32>
    %106 = arith.divsi %c24758_i16, %c-32532_i16 : i16
    %cst_25 = arith.constant 1.52068339E+9 : f32
    %107 = arith.mulf %cst_2, %cst_2 : f32
    %108 = affine.max affine_map<(d0, d1, d2, d3) -> (d1 floordiv 64 - d2 + 2, (d1 + 128) ceildiv 32)>(%90, %c7, %90, %c11)
    %109 = math.sqrt %cst_0 : f32
    %110 = vector.broadcast %false : i1 to vector<5xi1>
    %111 = vector.maskedload %76[%c1, %c8, %c4], %110, %110 : memref<10x10x7xi1>, vector<5xi1>, vector<5xi1> into vector<5xi1>
    memref.assume_alignment %alloc, 4 : memref<3x10xf16>
    %112 = arith.remf %cst_2, %cst_0 : f32
    scf.index_switch %c4 
    case 1 {
      affine.store %c1819932308_i64, %alloc_8[%c5, %c3, %c4] : memref<10x10x7xi64>
      %248 = arith.divsi %c-7432_i16, %c-32532_i16 : i16
      bufferization.dealloc_tensor %0 : tensor<10x10x7xi1>
      %inserted_38 = tensor.insert %c1819932308_i64 into %2[%c2, %c6] : tensor<3x7xi64>
      %249 = vector.insert %false, %111 [2] : i1 into vector<5xi1>
      affine.store %c1819932308_i64, %alloc_8[%c7, %c2, %c3] : memref<10x10x7xi64>
      %250 = arith.subi %c1819932308_i64, %c1819932308_i64 : i64
      %251 = vector.broadcast %cst_3 : f32 to vector<3x7xf32>
      %252 = vector.fma %251, %29, %93 : vector<3x7xf32>
      %253 = vector.reduction <add>, %87 : vector<1xf32> into f32
      bufferization.dealloc_tensor %16 : tensor<10x10x7xi64>
      %254 = memref.load %alloc_10[%c2, %c5] : memref<3x7xf32>
      %255 = index.floordivs %c0, %31
      %inserted_39 = tensor.insert %c1819932308_i64 into %13[%c5, %c2, %c6] : tensor<10x10x7xi64>
      %256 = index.sizeof
      %257 = arith.ceildivsi %c1322531054_i32, %c87979853_i32 : i32
      memref.store %cst, %alloc[%c1, %c5] : memref<3x10xf16>
      scf.yield
    }
    case 2 {
      %248 = index.add %c12, %c13
      %249 = memref.realloc %alloc_19 : memref<10xi64> to memref<7xi64>
      %250 = arith.muli %c87979853_i32, %c87979853_i32 : i32
      %251 = index.maxu %90, %c8
      %252 = index.sub %248, %248
      %cst_38 = arith.constant 3.449760e+08 : f32
      %253 = arith.muli %c1819932308_i64, %c1819932308_i64 : i64
      %254 = math.log %cst_3 : f32
      %255 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<mul>} %20, %20, %cst : vector<3xf16>, vector<3xf16> into f16
      %256 = vector.insertelement %cst_1, %60[%45 : index] : vector<7xf32>
      %257 = arith.minf %cst_3, %cst_3 : f32
      %258 = vector.broadcast %c1821487250_i32 : i32 to vector<3x10xi32>
      %cst_39 = arith.constant 4.070400e+04 : f16
      %259 = arith.shrsi %c1819932308_i64, %c1819932308_i64 : i64
      %260 = arith.floordivsi %c1322531054_i32, %c87979853_i32 : i32
      %261 = vector.bitcast %110 : vector<5xi1> to vector<5xi1>
      scf.yield
    }
    case 3 {
      %248 = math.tan %cst : f16
      scf.index_switch %c7 
      case 1 {
        %260 = math.cos %cst : f16
        %261 = index.sub %c2, %c12
        %262 = bufferization.clone %alloc_18 : memref<3x10xf32> to memref<3x10xf32>
        %263 = index.sizeof
        %264 = arith.ceildivsi %c24758_i16, %c8444_i16 : i16
        %265 = vector.insert %false, %110 [3] : i1 into vector<5xi1>
        %266 = arith.addf %cst_0, %cst_2 : f32
        %267 = math.absf %10 : tensor<3x7xf32>
        affine.store %c1819932308_i64, %alloc_8[%c1, %c6, %c13] : memref<10x10x7xi64>
        memref.assume_alignment %alloc_20, 1 : memref<10x10x7xf32>
        %268 = arith.minsi %c-7432_i16, %c-32532_i16 : i16
        %269 = math.tan %cst : f16
        vector.print %110 : vector<5xi1>
        %270 = math.floor %10 : tensor<3x7xf32>
        %cast_41 = tensor.cast %2 : tensor<3x7xi64> to tensor<?x?xi64>
        %271 = index.divs %c8, %95
        scf.yield
      }
      case 2 {
        memref.store %cst_0, %alloc_18[%c2, %c0] : memref<3x10xf32>
        %260 = vector.matrix_multiply %60, %73 {lhs_columns = 1 : i32, lhs_rows = 7 : i32, rhs_columns = 3 : i32} : (vector<7xf32>, vector<3xf32>) -> vector<21xf32>
        %261 = arith.muli %c-25136_i16, %c-2387_i16 : i16
        %262 = math.ctlz %false : i1
        %263 = arith.shrui %c8444_i16, %c24758_i16 : i16
        %264 = vector.bitcast %63 : vector<3x7xi32> to vector<3x7xi32>
        %cast_41 = tensor.cast %4 : tensor<3x10xi64> to tensor<?x?xi64>
        %265 = math.floor %cst_2 : f32
        %266 = memref.atomic_rmw addi %c1819932308_i64, %alloc_16[%c2, %c0] : (i64, memref<3x7xi64>) -> i64
        %267 = index.floordivs %c10, %c12
        %alloc_42 = memref.alloc() : memref<3x7xf32>
        %268 = arith.subi %c8444_i16, %c24758_i16 : i16
        %269 = arith.minsi %c24758_i16, %c-7432_i16 : i16
        %270 = math.tan %cst_0 : f32
        %from_elements_43 = tensor.from_elements %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c87979853_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c1322531054_i32, %c1322531054_i32, %c87979853_i32, %c87979853_i32, %c87979853_i32, %c1322531054_i32, %c1322531054_i32, %c1821487250_i32, %c87979853_i32, %c1821487250_i32, %c1821487250_i32, %c87979853_i32, %c1322531054_i32 : tensor<3x10xi32>
        %271 = index.maxs %c3, %c15
        scf.yield
      }
      case 3 {
        %260 = arith.cmpf ogt, %cst_2, %cst_3 : f32
        %261 = vector.broadcast %c13 : index to vector<7xindex>
        %262 = vector.broadcast %false : i1 to vector<7xi1>
        %263 = vector.broadcast %c1819932308_i64 : i64 to vector<7xi64>
        vector.scatter %alloc_11[%c0, %c6] [%261], %262, %263 : memref<3x10xi64>, vector<7xindex>, vector<7xi1>, vector<7xi64>
        %264 = vector.broadcast %cst_3 : f32 to vector<3x10xf32>
        %265 = vector.fma %264, %264, %264 : vector<3x10xf32>
        %266 = arith.xori %c1819932308_i64, %c1819932308_i64 : i64
        %267 = arith.remui %c1819932308_i64, %c1819932308_i64 : i64
        %268 = bufferization.clone %alloc_5 : memref<5x3xi64> to memref<5x3xi64>
        %269 = vector.broadcast %false : i1 to vector<3x10xi1>
        %270 = memref.atomic_rmw addf %cst, %alloc[%c0, %c1] : (f16, memref<3x10xf16>) -> f16
        %271 = math.tanh %10 : tensor<3x7xf32>
        %dest_41, %accumulated_value_42 = vector.scan <maxf>, %80, %73 {inclusive = false, reduction_dim = 1 : i64} : vector<3x7xf32>, vector<3xf32>
        %272 = math.copysign %14, %14 : tensor<5x3xf16>
        %273 = vector.extract %111[2] : vector<5xi1>
        %cast_43 = tensor.cast %81 : tensor<3x10xi32> to tensor<?x?xi32>
        %274 = arith.subi %false, %false : i1
        %275 = math.fma %cst_2, %cst_1, %cst_1 : f32
        %276 = vector.multi_reduction <add>, %105, %105 [] : vector<7xf32> to vector<7xf32>
        scf.yield
      }
      case 4 {
        %260 = affine.max affine_map<(d0, d1, d2, d3) -> (d2 - (d2 + 32), d2 - (d2 + 32), (d2 mod 16) * 32, d2 mod 16)>(%c14, %69, %67, %c7)
        %261 = math.powf %10, %10 : tensor<3x7xf32>
        %262 = arith.maxui %c-7432_i16, %c24758_i16 : i16
        %263 = math.log2 %cst_0 : f32
        %264 = vector.broadcast %c-2387_i16 : i16 to vector<5x3xi16>
        %265 = index.ceildivs %c15, %31
        %266 = arith.minsi %c1821487250_i32, %c1821487250_i32 : i32
        %267 = vector.splat %c3 : vector<3x7xindex>
        %268 = index.ceildivu %c2, %c9
        %269 = arith.remf %cst, %cst : f16
        memref.store %c1821487250_i32, %alloc_15[%c4, %c1] : memref<5x3xi32>
        %270 = arith.muli %c24758_i16, %c24758_i16 : i16
        %271 = arith.floordivsi %c87979853_i32, %c1821487250_i32 : i32
        %272 = math.atan2 %cst_0, %cst_1 : f32
        %inserted_41 = tensor.insert %c1819932308_i64 into %7[%c2, %c1] : tensor<3x10xi64>
        memref.assume_alignment %alloc_20, 4 : memref<10x10x7xf32>
        scf.yield
      }
      default {
        %260 = math.absf %cst_3 : f32
        %261 = vector.matrix_multiply %105, %105 {lhs_columns = 7 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<7xf32>, vector<7xf32>) -> vector<1xf32>
        %262 = vector.broadcast %cst_1 : f32 to vector<1x1xf32>
        %263 = vector.outerproduct %87, %261, %262 {kind = #vector.kind<add>} : vector<1xf32>, vector<1xf32>
        %264 = vector.broadcast %cst_1 : f32 to vector<7x7xf32>
        %265 = vector.outerproduct %105, %60, %264 {kind = #vector.kind<minf>} : vector<7xf32>, vector<7xf32>
        %266 = affine.load %alloc_17[%c5, %c11] : memref<3x10xi1>
        %alloc_41 = memref.alloc() : memref<5x3xf32>
        %267 = arith.floordivsi %c87979853_i32, %c1322531054_i32 : i32
