module {
  func.func private @func1(%arg0: index, %arg1: tensor<2x2xi64>) {
    %c540530258_i32 = arith.constant 540530258 : i32
    %cst = arith.constant 5.568000e+03 : f16
    %cst_0 = arith.constant 1.57873408E+9 : f32
    %c-5916_i16 = arith.constant -5916 : i16
    %c1807483623_i64 = arith.constant 1807483623 : i64
    %c189500516_i32 = arith.constant 189500516 : i32
    %c588364374_i64 = arith.constant 588364374 : i64
    %c528704457_i32 = arith.constant 528704457 : i32
    %cst_1 = arith.constant 1.85581965E+9 : f32
    %cst_2 = arith.constant 5.472000e+04 : f16
    %c28612_i16 = arith.constant 28612 : i16
    %cst_3 = arith.constant 2.988800e+04 : f16
    %c1418927244_i64 = arith.constant 1418927244 : i64
    %c2047384402_i32 = arith.constant 2047384402 : i32
    %c454538438_i64 = arith.constant 454538438 : i64
    %c835286953_i32 = arith.constant 835286953 : i32
    %0 = tensor.empty() : tensor<3x2x2xi16>
    %1 = tensor.empty() : tensor<2xi32>
    %2 = tensor.empty() : tensor<3x2x2xi16>
    %3 = tensor.empty() : tensor<2x2xf32>
    %4 = tensor.empty() : tensor<3x2x2xf32>
    %5 = tensor.empty() : tensor<2xf16>
    %6 = tensor.empty() : tensor<3x2x2xi32>
    %7 = tensor.empty() : tensor<3x2x2xf16>
    %8 = tensor.empty() : tensor<2xf32>
    %9 = tensor.empty() : tensor<3x2x2xf16>
    %10 = tensor.empty() : tensor<3x2x2xf16>
    %11 = tensor.empty() : tensor<2x2xf16>
    %12 = tensor.empty() : tensor<3x2xi32>
    %13 = tensor.empty() : tensor<3x2x2xi1>
    %14 = tensor.empty() : tensor<2xi1>
    %15 = tensor.empty() : tensor<2x2xi16>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<3x2xf32>
    %alloc_4 = memref.alloc() : memref<3x2x2xi64>
    %alloc_5 = memref.alloc() : memref<3x2x2xf32>
    %alloc_6 = memref.alloc() : memref<2xf32>
    %alloc_7 = memref.alloc() : memref<2x2xi1>
    %alloc_8 = memref.alloc() : memref<2x2xi1>
    %alloc_9 = memref.alloc() : memref<2x2xi1>
    %alloc_10 = memref.alloc() : memref<2xf32>
    %alloc_11 = memref.alloc() : memref<3x2xi32>
    %alloc_12 = memref.alloc() : memref<3x2x2xf32>
    %alloc_13 = memref.alloc() : memref<3x2xf16>
    %alloc_14 = memref.alloc() : memref<3x2x2xi1>
    %alloc_15 = memref.alloc() : memref<2xi32>
    %alloc_16 = memref.alloc() : memref<3x2x2xf16>
    %alloc_17 = memref.alloc() : memref<2x2xi64>
    %alloc_18 = memref.alloc() : memref<2x2xi1>
    %16 = tensor.empty() : tensor<3x2x2xi1>
    %17 = linalg.copy ins(%13 : tensor<3x2x2xi1>) outs(%16 : tensor<3x2x2xi1>) -> tensor<3x2x2xi1>
    %18 = tensor.empty() : tensor<2x3x2xf32>
    %transposed = linalg.transpose ins(%4 : tensor<3x2x2xf32>) outs(%18 : tensor<2x3x2xf32>) permutation = [2, 0, 1] 
    %alloc_19 = memref.alloc() : memref<i1>
    linalg.reduce ins(%14 : tensor<2xi1>) outs(%alloc_19 : memref<i1>) dimensions = [0] 
      (%in: i1, %init: i1) {
        memref.store %c528704457_i32, %alloc_11[%c0, %c0] : memref<3x2xi32>
        %alloc_34 = memref.alloc() : memref<3x2x2xi64>
        %264 = index.sub %c7, %c0
        %265 = arith.divsi %c588364374_i64, %c588364374_i64 : i64
        %266 = vector.splat %c3 : vector<3x2xindex>
        %expanded = tensor.expand_shape %18 [[0], [1], [2, 3]] : tensor<2x3x2xf32> into tensor<2x3x2x1xf32>
        %true_35 = index.bool.constant true
        %267 = affine.if affine_set<(d0, d1, d2, d3) : (d3 >= 0, d3 - d0 floordiv 8 + 130 == 0, d3 == 0)>(%c0, %c7, %c1, %c11) -> memref<2x2xf16> {
          %268 = vector.broadcast %cst_1 : f32 to vector<2xf32>
          %269 = vector.broadcast %true_35 : i1 to vector<2xi1>
          %270 = vector.broadcast %c835286953_i32 : i32 to vector<2xi32>
          %271 = vector.gather %8[%c15] [%270], %269, %268 : tensor<2xf32>, vector<2xi32>, vector<2xi1>, vector<2xf32> into vector<2xf32>
          %272 = math.sqrt %8 : tensor<2xf32>
          %alloc_37 = memref.alloc() : memref<2xi1>
          %273 = vector.broadcast %true_35 : i1 to vector<2x2xi1>
          %274 = vector.broadcast %c835286953_i32 : i32 to vector<2x2xi32>
          %275 = vector.gather %alloc_37[%264] [%274], %273, %273 : memref<2xi1>, vector<2x2xi32>, vector<2x2xi1>, vector<2x2xi1> into vector<2x2xi1>
          %276 = affine.load %alloc_4[%c13, %c10, %c5] : memref<3x2x2xi64>
          %277 = index.maxu %c7, %c2
          %278 = memref.realloc %alloc_10 : memref<2xf32> to memref<2xf32>
          %false_38 = index.bool.constant false
          %279 = math.tanh %18 : tensor<2x3x2xf32>
          %alloc_39 = memref.alloc() : memref<2x2xf16>
          affine.yield %alloc_39 : memref<2x2xf16>
        } else {
          %268 = arith.minsi %in, %init : i1
          %269 = math.absi %15 : tensor<2x2xi16>
          %270 = math.round %5 : tensor<2xf16>
          %271 = bufferization.to_tensor %alloc_18 : memref<2x2xi1>
          %272 = arith.divui %c189500516_i32, %c528704457_i32 : i32
          %273 = vector.broadcast %c1807483623_i64 : i64 to vector<1xi64>
          %274 = vector.matrix_multiply %273, %273 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
          %275 = index.casts %c28612_i16 : i16 to index
          %276 = vector.multi_reduction <maxui>, %273, %c588364374_i64 [0] : vector<1xi64> to i64
          %alloc_37 = memref.alloc() : memref<2x2xf16>
          affine.yield %alloc_37 : memref<2x2xf16>
        }
        %true_36 = arith.constant true
        linalg.yield %true_36 : i1
      }
    %19 = scf.parallel (%arg2, %arg3) = (%c12, %c1) to (%c15, %c15) step (%c8, %c14) init (%12) -> tensor<3x2xi32> {
      %true_34 = index.bool.constant true
      %264 = vector.broadcast %c1418927244_i64 : i64 to vector<1xi64>
      %265 = vector.multi_reduction <or>, %264, %c454538438_i64 [0] : vector<1xi64> to i64
      %266 = vector.transpose %264, [0] : vector<1xi64> to vector<1xi64>
      %267 = vector.insertelement %c588364374_i64, %264[%c11 : index] : vector<1xi64>
      %268 = arith.maxui %c1418927244_i64, %c1418927244_i64 : i64
      %269 = affine.if affine_set<(d0, d1, d2) : (d2 * 8 == 0)>(%c15, %c0, %c9) -> memref<2xf32> {
        %281 = vector.broadcast %c1418927244_i64 : i64 to vector<2x2xi64>
        %282 = math.log10 %10 : tensor<3x2x2xf16>
        %283 = vector.broadcast %c0 : index to vector<1xindex>
        %284 = vector.broadcast %true_34 : i1 to vector<1xi1>
        vector.scatter %alloc_9[%c0, %c1] [%283], %284, %284 : memref<2x2xi1>, vector<1xindex>, vector<1xi1>, vector<1xi1>
        %285 = math.absf %11 : tensor<2x2xf16>
        %alloc_36 = memref.alloc() : memref<2xi1>
        memref.tensor_store %14, %alloc_36 : memref<2xi1>
        %286 = index.ceildivu %c2, %c2
        %287 = vector.broadcast %265 : i64 to vector<2xi64>
        %288 = vector.broadcast %true_34 : i1 to vector<2xi1>
        %289 = vector.maskedload %alloc_4[%c0, %c1, %c1], %288, %287 : memref<3x2x2xi64>, vector<2xi1>, vector<2xi64> into vector<2xi64>
        %290 = arith.divui %c1418927244_i64, %c588364374_i64 : i64
        affine.yield %alloc_6 : memref<2xf32>
      } else {
        %281 = vector.shuffle %264, %264 [0, 1] : vector<1xi64>, vector<1xi64>
        %282 = index.mul %c12, %c8
        %extracted_36 = tensor.extract %4[%c2, %c0, %c1] : tensor<3x2x2xf32>
        %283 = vector.extract_strided_slice %264 {offsets = [0], sizes = [1], strides = [1]} : vector<1xi64> to vector<1xi64>
        %284 = math.ipowi %0, %2 : tensor<3x2x2xi16>
        %285 = math.atan %3 : tensor<2x2xf32>
        memref.store %true_34, %alloc_14[%c1, %c1, %c1] : memref<3x2x2xi1>
        %286 = vector.shuffle %283, %264 [0, 1] : vector<1xi64>, vector<1xi64>
        affine.yield %alloc_10 : memref<2xf32>
      }
      %270 = bufferization.to_tensor %alloc_13 : memref<3x2xf16>
      %271 = vector.splat %c0 : vector<2x2xindex>
      %272 = math.ipowi %true_34, %true_34 : i1
      %273 = math.ctpop %c2047384402_i32 : i32
      %cst_35 = arith.constant 1.000000e+00 : f16
      %274 = vector.transfer_read %9[%c8, %c5, %c8], %cst_35 : tensor<3x2x2xf16>, vector<2x3xf16>
      %275 = memref.atomic_rmw minf %cst_2, %alloc_16[%c1, %c1, %c1] : (f16, memref<3x2x2xf16>) -> f16
      %276 = vector.insert %265, %264 [0] : i64 into vector<1xi64>
      %277 = arith.minf %cst_0, %cst_0 : f32
      %278 = index.floordivs %c4, %c9
      %279 = index.ceildivs %c6, %c7
      %280 = tensor.empty() : tensor<3x2xi32>
      scf.reduce(%280)  : tensor<3x2xi32> {
      ^bb0(%arg4: tensor<3x2xi32>, %arg5: tensor<3x2xi32>):
        %281 = index.sizeof
        %282 = index.sub %c5, %arg2
        %283 = math.atan %4 : tensor<3x2x2xf32>
        %284 = vector.reduction <xor>, %264 : vector<1xi64> into i64
        %alloca = memref.alloca() : memref<3x2xi32>
        memref.store %c454538438_i64, %alloc_4[%c0, %c0, %c0] : memref<3x2x2xi64>
        %285 = vector.load %alloc_8[%c0, %c1] : memref<2x2xi1>, vector<3x2x2xi1>
        %286 = memref.load %alloc_10[%c0] : memref<2xf32>
        %287 = tensor.empty() : tensor<3x2xi32>
        scf.reduce.return %287 : tensor<3x2xi32>
      }
      scf.yield
    }
    %20 = affine.vector_load %alloc_15[%c15] : memref<2xi32>, vector<1xi32>
    affine.vector_store %20, %alloc_15[%c15] : memref<2xi32>, vector<1xi32>
    %21 = tensor.empty() : tensor<2xf16>
    %22 = tensor.empty() : tensor<f16>
    %23 = linalg.dot ins(%5, %21 : tensor<2xf16>, tensor<2xf16>) outs(%22 : tensor<f16>) -> tensor<f16>
    %24 = math.roundeven %5 : tensor<2xf16>
    %25 = vector.insertelement %c189500516_i32, %20[%c12 : index] : vector<1xi32>
    %26 = index.ceildivs %c13, %c3
    %27 = math.cttz %c2047384402_i32 : i32
    %28 = index.divs %c8, %c1
    %29 = arith.maxsi %c835286953_i32, %c528704457_i32 : i32
    %30 = index.divs %c1, %c5
    %31 = vector.broadcast %c528704457_i32 : i32 to vector<1x1xi32>
    %32 = vector.outerproduct %20, %20, %31 {kind = #vector.kind<minui>} : vector<1xi32>, vector<1xi32>
    %33 = tensor.empty() : tensor<2xi16>
    %34 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>, affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%0, %2, %33 : tensor<3x2x2xi16>, tensor<3x2x2xi16>, tensor<2xi16>) outs(%2 : tensor<3x2x2xi16>) {
    ^bb0(%in: i16, %in_34: i16, %in_35: i16, %out: i16):
      memref.store %c528704457_i32, %alloc_11[%c0, %c1] : memref<3x2xi32>
      %264 = vector.multi_reduction <xor>, %20, %c540530258_i32 [0] : vector<1xi32> to i32
      %265 = math.log %5 : tensor<2xf16>
      %cst_36 = arith.constant 1.000000e+00 : f32
      %cst_37 = arith.constant 0.000000e+00 : f32
      %266 = vector.transfer_read %transposed[%28, %c9, %c14], %cst_37 : tensor<2x3x2xf32>, vector<f32>
      %267 = arith.cmpi sgt, %c588364374_i64, %c588364374_i64 : i64
      %268 = vector.broadcast %in_35 : i16 to vector<3x1xi16>
      %269 = vector.transfer_write %268, %2[%c15, %c6, %c0] {permutation_map = affine_map<(d0, d1, d2) -> (d0, d1)>} : vector<3x1xi16>, tensor<3x2x2xi16>
      %270 = arith.andi %c528704457_i32, %264 : i32
      %271 = math.round %cst_36 : f32
      %272 = memref.load %alloc_7[%c1, %c0] : memref<2x2xi1>
      %273 = math.ctlz %6 : tensor<3x2x2xi32>
      %274 = math.round %10 : tensor<3x2x2xf16>
      %275 = index.divs %c1, %c15
      %276 = math.ctlz %0 : tensor<3x2x2xi16>
      %277 = arith.minsi %in, %out : i16
      %278 = arith.maxsi %c1807483623_i64, %c454538438_i64 : i64
      %279 = vector.broadcast %c189500516_i32 : i32 to vector<1x1xi32>
      %280 = vector.outerproduct %20, %20, %279 {kind = #vector.kind<minui>} : vector<1xi32>, vector<1xi32>
      %281 = index.divu %c6, %c6
      %inserted_38 = tensor.insert %c-5916_i16 into %15[%c0, %c1] : tensor<2x2xi16>
      %282 = affine.load %alloc_10[%c12] : memref<2xf32>
      %283 = vector.broadcast %cst_0 : f32 to vector<2xf32>
      %true_39 = arith.constant true
      %284 = vector.broadcast %true_39 : i1 to vector<2xi1>
      %285 = vector.maskedload %alloc_6[%c0], %284, %283 : memref<2xf32>, vector<2xi1>, vector<2xf32> into vector<2xf32>
      %286 = affine.for %arg2 = 0 to 44 iter_args(%arg3 = %c6) -> (index) {
        affine.yield %c8 : index
      }
      memref.assume_alignment %alloc_19, 2 : memref<i1>
      %287 = vector.insert %c2047384402_i32, %20 [0] : i32 into vector<1xi32>
      %288 = math.powf %cst_0, %cst_36 : f32
      %289 = vector.broadcast %true_39 : i1 to vector<2x2xi1>
      %290 = vector.outerproduct %284, %284, %289 {kind = #vector.kind<xor>} : vector<2xi1>, vector<2xi1>
      %291 = vector.insert %c189500516_i32, %20 [0] : i32 into vector<1xi32>
      %292 = vector.broadcast %c7 : index to vector<3xindex>
      %293 = vector.broadcast %true_39 : i1 to vector<3xi1>
      vector.scatter %alloc_8[%c1, %c1] [%292], %293, %293 : memref<2x2xi1>, vector<3xindex>, vector<3xi1>, vector<3xi1>
      %294 = vector.reduction <maxui>, %284 : vector<2xi1> into i1
      %295 = index.divu %c10, %c4
      %296 = affine.max affine_map<(d0) -> (d0 * 3, d0 * -3)>(%c7)
      %297 = math.exp2 %282 : f32
      %298 = vector.shuffle %20, %20 [0] : vector<1xi32>, vector<1xi32>
      linalg.yield %in : i16
    } -> tensor<3x2x2xi16>
    %35 = vector.multi_reduction <maxui>, %20, %20 [] : vector<1xi32> to vector<1xi32>
    %36 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} outs(%9 : tensor<3x2x2xf16>) {
    ^bb0(%out: f16):
      %264 = arith.minsi %c28612_i16, %c28612_i16 : i16
      %265 = arith.maxui %c28612_i16, %c28612_i16 : i16
      %266 = math.round %7 : tensor<3x2x2xf16>
      %generated_34 = tensor.generate %28 {
      ^bb0(%arg2: index):
        vector.print %20 : vector<1xi32>
        %291 = bufferization.to_memref %5 : memref<2xf16>
        %292 = arith.minui %c-5916_i16, %c28612_i16 : i16
        vector.print %20 : vector<1xi32>
        tensor.yield %c28612_i16 : i16
      } : tensor<?xi16>
      %267 = affine.for %arg2 = 0 to 19 iter_args(%arg3 = %cst_1) -> (f32) {
        affine.yield %arg3 : f32
      }
      vector.print %20 : vector<1xi32>
      memref.assume_alignment %alloc_14, 2 : memref<3x2x2xi1>
      %268 = index.sizeof
      %269 = arith.addi %c528704457_i32, %c528704457_i32 : i32
      %270 = memref.load %alloc_19[] : memref<i1>
      %271 = arith.divsi %c540530258_i32, %c2047384402_i32 : i32
      %272 = math.ipowi %0, %2 : tensor<3x2x2xi16>
      scf.execute_region {
        %291 = arith.floordivsi %c28612_i16, %c-5916_i16 : i16
        %292 = math.rsqrt %11 : tensor<2x2xf16>
        %293 = math.ceil %8 : tensor<2xf32>
        %294 = math.log %10 : tensor<3x2x2xf16>
        %295 = arith.mulf %cst_1, %cst_0 : f32
        %296 = math.floor %8 : tensor<2xf32>
        %297 = vector.extract_strided_slice %20 {offsets = [0], sizes = [1], strides = [1]} : vector<1xi32> to vector<1xi32>
        %298 = vector.broadcast %268 : index to vector<1xindex>
        %true_40 = arith.constant true
        %299 = vector.broadcast %true_40 : i1 to vector<1xi1>
        %300 = vector.broadcast %cst : f16 to vector<1xf16>
        vector.scatter %alloc_13[%c1, %c0] [%298], %299, %300 : memref<3x2xf16>, vector<1xindex>, vector<1xi1>, vector<1xf16>
        %301 = tensor.empty(%c7) : tensor<?x2xf32>
        %302 = vector.transpose %20, [0] : vector<1xi32> to vector<1xi32>
        %303 = vector.load %alloc_13[%c0, %c0] : memref<3x2xf16>, vector<3x2x2xf16>
        %304 = math.exp %7 : tensor<3x2x2xf16>
        %305 = math.atan %22 : tensor<f16>
        %306 = math.expm1 %3 : tensor<2x2xf32>
        %307 = vector.broadcast %cst : f16 to vector<3x2xf16>
        %dest_41, %accumulated_value_42 = vector.scan <add>, %303, %307 {inclusive = true, reduction_dim = 2 : i64} : vector<3x2x2xf16>, vector<3x2xf16>
        %308 = vector.broadcast %c454538438_i64 : i64 to vector<2x2xi64>
        scf.yield
      }
      %273 = math.log2 %8 : tensor<2xf32>
      %cast_35 = tensor.cast %23 : tensor<f16> to tensor<f16>
      %274 = math.round %10 : tensor<3x2x2xf16>
      %275 = math.floor %cst_2 : f16
      affine.for %arg2 = 0 to 47 {
      }
      %276 = index.divu %c3, %c4
      %277 = arith.addf %cst_1, %cst_0 : f32
      %278 = vector.transpose %20, [0] : vector<1xi32> to vector<1xi32>
      %279 = index.maxu %c4, %c8
      %280 = index.ceildivs %c4, %30
      affine.store %cst_1, %alloc_5[%c11, %c5, %c7] : memref<3x2x2xf32>
      %281 = affine.if affine_set<(d0) : (d0 ceildiv 4 - 56 >= 0, (d0 ceildiv 4) floordiv 2 + 4 >= 0, ((d0 ceildiv 4) floordiv 2 + 4) * 128 == 0)>(%c10) -> i32 {
        %291 = index.divu %276, %c10
        %292 = vector.matrix_multiply %20, %20 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi32>, vector<1xi32>) -> vector<1xi32>
        %293 = arith.muli %c189500516_i32, %c189500516_i32 : i32
        %294 = vector.bitcast %292 : vector<1xi32> to vector<1xi32>
        %295 = index.ceildivu %c6, %c5
        %296 = index.divs %26, %c9
        %inserted_40 = tensor.insert %cst_2 into %5[%c1] : tensor<2xf16>
        %297 = math.fma %9, %9, %9 : tensor<3x2x2xf16>
        affine.yield %c835286953_i32 : i32
      } else {
        %291 = arith.negf %cst_1 : f32
        %292 = arith.divui %c454538438_i64, %c1807483623_i64 : i64
        %293 = math.log10 %out : f16
        %294 = bufferization.to_tensor %alloc_14 : memref<3x2x2xi1>
        %295 = math.tanh %cst_3 : f16
        %cst_40 = arith.constant 0x4D20B454 : f32
        %296 = vector.broadcast %c28612_i16 : i16 to vector<2x2xi16>
        %297 = vector.broadcast %c28612_i16 : i16 to vector<2xi16>
        %dest_41, %accumulated_value_42 = vector.scan <mul>, %296, %297 {inclusive = false, reduction_dim = 1 : i64} : vector<2x2xi16>, vector<2xi16>
        %298 = affine.load %alloc_6[%c2] : memref<2xf32>
        affine.yield %c835286953_i32 : i32
      }
      %282 = vector.broadcast %cst_1 : f32 to vector<2xf32>
      %true_36 = arith.constant true
      %283 = vector.broadcast %true_36 : i1 to vector<2xi1>
      %284 = vector.broadcast %c835286953_i32 : i32 to vector<2xi32>
      %285 = vector.gather %alloc[%280, %c8] [%284], %283, %282 : memref<3x2xf32>, vector<2xi32>, vector<2xi1>, vector<2xf32> into vector<2xf32>
      %286 = arith.ceildivsi %c1418927244_i64, %c454538438_i64 : i64
      %287 = arith.xori %c454538438_i64, %c1418927244_i64 : i64
      %288 = arith.floordivsi %c454538438_i64, %c454538438_i64 : i64
      %289 = arith.maxui %c588364374_i64, %c588364374_i64 : i64
      %cast_37 = tensor.cast %9 : tensor<3x2x2xf16> to tensor<?x?x?xf16>
      %cst_38 = arith.constant 1.000000e+00 : f32
      %cst_39 = arith.constant 0.000000e+00 : f32
      %290 = vector.transfer_read %8[%c12], %cst_39 : tensor<2xf32>, vector<f32>
      linalg.yield %cst_2 : f16
    } -> tensor<3x2x2xf16>
    %37 = affine.for %arg2 = 0 to 6 iter_args(%arg3 = %c11) -> (index) {
      affine.yield %arg3 : index
    }
    %38 = math.floor %3 : tensor<2x2xf32>
    %39 = math.tanh %cst_1 : f32
    %40 = vector.broadcast %cst_0 : f32 to vector<3x2xf32>
    %41 = vector.fma %40, %40, %40 : vector<3x2xf32>
    %42 = arith.floordivsi %c1418927244_i64, %c588364374_i64 : i64
    %43 = arith.divf %cst_1, %cst_1 : f32
    %44 = vector.multi_reduction <minf>, %41, %40 [] : vector<3x2xf32> to vector<3x2xf32>
    %45 = math.exp2 %5 : tensor<2xf16>
    %46 = arith.addf %cst, %cst : f16
    %47 = arith.minsi %c1418927244_i64, %c1418927244_i64 : i64
    %48 = math.roundeven %transposed : tensor<2x3x2xf32>
    %49 = memref.realloc %alloc_10 : memref<2xf32> to memref<2xf32>
    %50 = index.ceildivu %c1, %c4
    %51 = affine.apply affine_map<(d0) -> ((-(d0 mod 128)) ceildiv 64)>(%c2)
    %52 = tensor.empty() : tensor<3x2x2xi1>
    %53 = vector.multi_reduction <or>, %20, %c835286953_i32 [0] : vector<1xi32> to i32
    %54 = memref.realloc %alloc_6 : memref<2xf32> to memref<1xf32>
    %false = arith.constant false
    memref.store %false, %alloc_7[%c0, %c0] : memref<2x2xi1>
    %55 = memref.atomic_rmw minf %cst_0, %alloc_12[%c0, %c1, %c1] : (f32, memref<3x2x2xf32>) -> f32
    %56 = math.ceil %cst : f16
    %57 = memref.load %alloc_6[%c0] : memref<2xf32>
    %58 = arith.maxf %cst, %cst : f16
    %59 = vector.bitcast %41 : vector<3x2xf32> to vector<3x2xf32>
    %60 = arith.shli %c-5916_i16, %c-5916_i16 : i16
    %61 = vector.extract %41[1] : vector<3x2xf32>
    %62 = arith.remf %cst_2, %cst : f16
    %generated = tensor.generate %30 {
    ^bb0(%arg2: index, %arg3: index, %arg4: index):
      %c1_i32 = arith.constant 1 : i32
      %264 = vector.transfer_read %alloc_15[%c4], %c1_i32 : memref<2xi32>, vector<i32>
      %265 = affine.if affine_set<(d0) : (-(d0 - 8) == 0, (d0 - (d0 - 8) - (d0 - 8)) floordiv 4 + 6 == 0, d0 == 0)>(%c15) -> memref<3x2xf16> {
        %268 = vector.extract_strided_slice %40 {offsets = [0], sizes = [2], strides = [1]} : vector<3x2xf32> to vector<2x2xf32>
        %269 = vector.broadcast %c835286953_i32 : i32 to vector<1x1xi32>
        %270 = vector.outerproduct %20, %20, %269 {kind = #vector.kind<minsi>} : vector<1xi32>, vector<1xi32>
        %271 = arith.maxf %cst_1, %cst_1 : f32
        %272 = index.sizeof
        %273 = arith.divf %cst, %cst : f16
        %274 = vector.splat %c1_i32 : vector<3x2x2xi32>
        %275 = bufferization.to_memref %17 : memref<3x2x2xi1>
        %276 = arith.divui %c1418927244_i64, %c1418927244_i64 : i64
        affine.yield %alloc_13 : memref<3x2xf16>
      } else {
        %268 = math.tanh %7 : tensor<3x2x2xf16>
        %269 = index.ceildivu %c9, %c2
        %270 = index.ceildivs %c8, %c3
        %271 = index.ceildivu %50, %c8
        %c827120656_i32 = arith.constant 827120656 : i32
        %alloc_34 = memref.alloc() : memref<2xf16>
        memref.tensor_store %5, %alloc_34 : memref<2xf16>
        %272 = arith.ceildivsi %c-5916_i16, %c-5916_i16 : i16
        %273 = math.floor %cst_2 : f16
        affine.yield %alloc_13 : memref<3x2xf16>
      }
      %266 = affine.max affine_map<(d0, d1) -> (d1 mod 4 + d1 * 2, (d1 floordiv 64 - d1 - d0) floordiv 128, (d1 floordiv 64) ceildiv 2, (d1 floordiv 64 - d1 - d0) floordiv 128 - d1 mod 4)>(%c9, %c2)
      %267 = scf.while (%arg5 = %alloc_4) : (memref<3x2x2xi64>) -> memref<3x2x2xi64> {
        %268 = math.log %8 : tensor<2xf32>
        %269 = vector.multi_reduction <mul>, %40, %61 [0] : vector<3x2xf32> to vector<2xf32>
        %270 = memref.atomic_rmw addf %cst_0, %alloc_6[%c1] : (f32, memref<2xf32>) -> f32
        %271 = vector.broadcast %cst_0 : f32 to vector<2x2xf32>
        %272 = vector.fma %271, %271, %271 : vector<2x2xf32>
        %273 = arith.remui %c1418927244_i64, %c588364374_i64 : i64
        %274 = arith.addi %c1807483623_i64, %c588364374_i64 : i64
        %275 = arith.remf %cst_1, %cst_1 : f32
        %rank_34 = tensor.rank %23 : tensor<f16>
        scf.condition(%false) %arg5 : memref<3x2x2xi64>
      } do {
      ^bb0(%arg5: memref<3x2x2xi64>):
        %268 = arith.divui %c1418927244_i64, %c588364374_i64 : i64
        %cst_34 = arith.constant 1.000000e+00 : f32
        %cst_35 = arith.constant 0.000000e+00 : f32
        %269 = vector.transfer_read %alloc_12[%c3, %c6, %arg4], %cst_35 {permutation_map = affine_map<(d0, d1, d2) -> (0)>} : memref<3x2x2xf32>, vector<2xf32>
        %270 = memref.realloc %alloc_15 : memref<2xi32> to memref<2xi32>
        %271 = math.ceil %4 : tensor<3x2x2xf32>
        %272 = arith.subi %c1807483623_i64, %c1418927244_i64 : i64
        %273 = math.log %5 : tensor<2xf16>
        %274 = vector.insertelement %cst_1, %61[%266 : index] : vector<2xf32>
        vector.print %41 : vector<3x2xf32>
        vector.print %59 : vector<3x2xf32>
        %275 = arith.andi %c1_i32, %c1_i32 : i32
        memref.store %c528704457_i32, %alloc_11[%c1, %c1] : memref<3x2xi32>
        %276 = arith.xori %c-5916_i16, %c-5916_i16 : i16
        %277 = arith.negf %cst_1 : f32
        %278 = vector.broadcast %53 : i32 to vector<3x2x2xi32>
        %279 = vector.broadcast %c540530258_i32 : i32 to vector<3xi32>
        %280 = vector.broadcast %false : i1 to vector<3xi1>
        %281 = vector.maskedload %alloc_15[%c0], %280, %279 : memref<2xi32>, vector<3xi1>, vector<3xi32> into vector<3xi32>
        %282 = arith.remui %c835286953_i32, %c2047384402_i32 : i32
        scf.yield %alloc_4 : memref<3x2x2xi64>
      }
      tensor.yield %false : i1
    } : tensor<?x2x2xi1>
    %63 = math.absf %transposed : tensor<2x3x2xf32>
    %64 = arith.remf %cst_0, %cst_0 : f32
    %65 = vector.broadcast %cst_1 : f32 to vector<2xf32>
    %66 = affine.apply affine_map<(d0, d1, d2) -> (16)>(%c7, %c15, %c0)
    %67 = arith.minui %c588364374_i64, %c1807483623_i64 : i64
    %68 = vector.load %alloc_16[%c2, %c0, %c0] : memref<3x2x2xf16>, vector<3x2x2xf16>
    memref.assume_alignment %alloc_11, 16 : memref<3x2xi32>
    %69 = math.floor %7 : tensor<3x2x2xf16>
    %70 = math.atan %cst_0 : f32
    %71 = math.log %5 : tensor<2xf16>
    %72 = math.floor %transposed : tensor<2x3x2xf32>
    %alloc_20 = memref.alloc() : memref<3x2x2xi64>
    memref.copy %alloc_4, %alloc_20 : memref<3x2x2xi64> to memref<3x2x2xi64>
    %73 = index.divs %c0, %28
    %74 = index.divu %51, %50
    %75 = vector.transpose %40, [0, 1] : vector<3x2xf32> to vector<3x2xf32>
    %76 = vector.multi_reduction <add>, %40, %40 [] : vector<3x2xf32> to vector<3x2xf32>
    %77 = arith.maxf %cst_2, %cst : f16
    %78 = arith.remui %c454538438_i64, %c1418927244_i64 : i64
    %79 = affine.apply affine_map<(d0, d1) -> (d0 * -2048)>(%c11, %c9)
    %80 = math.atan2 %8, %8 : tensor<2xf32>
    %81 = affine.load %alloc_7[%c3, %c1] : memref<2x2xi1>
    %82 = index.floordivs %79, %c11
    %83 = vector.broadcast %cst_1 : f32 to vector<2xf32>
    vector.transfer_write %83, %alloc_5[%c1, %c8, %51] {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : vector<2xf32>, memref<3x2x2xf32>
    %84 = tensor.empty() : tensor<3x2x2xi1>
    %mapped = linalg.map ins(%alloc_14, %13 : memref<3x2x2xi1>, tensor<3x2x2xi1>) outs(%84 : tensor<3x2x2xi1>)
      (%in: i1, %in_34: i1) {
        %264 = arith.andi %c189500516_i32, %c528704457_i32 : i32
        %265 = arith.cmpi eq, %c-5916_i16, %c-5916_i16 : i16
        %266 = arith.remf %cst_3, %cst_3 : f16
        %267 = vector.multi_reduction <add>, %83, %cst_0 [0] : vector<2xf32> to f32
        %268 = vector.transpose %59, [0, 1] : vector<3x2xf32> to vector<3x2xf32>
        %269 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1, d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%15 : tensor<2x2xi16>) outs(%0 : tensor<3x2x2xi16>) {
        ^bb0(%in_40: i16, %out: i16):
          %287 = tensor.empty() : tensor<2xi16>
          %288 = arith.xori %c28612_i16, %c28612_i16 : i16
          %289 = math.ceil %18 : tensor<2x3x2xf32>
          %290 = arith.addi %c588364374_i64, %c588364374_i64 : i64
          %291 = arith.maxf %cst_2, %cst : f16
          %292 = math.ctpop %in : i1
          %293 = tensor.empty(%c5) : tensor<?xi16>
          %294 = math.tanh %4 : tensor<3x2x2xf32>
          %295 = math.tanh %18 : tensor<2x3x2xf32>
          %296 = vector.shuffle %59, %41 [1, 3, 4, 5] : vector<3x2xf32>, vector<3x2xf32>
          %c1_i32 = arith.constant 1 : i32
          %297 = vector.transfer_read %alloc_11[%c6, %74], %c1_i32 : memref<3x2xi32>, vector<3xi32>
          %298 = math.absf %8 : tensor<2xf32>
          %299 = arith.shrsi %in_40, %in_40 : i16
          %300 = vector.insert %65, %59 [1] : vector<2xf32> into vector<3x2xf32>
          %301 = arith.shli %c528704457_i32, %c835286953_i32 : i32
          %302 = vector.insertelement %cst_0, %83[%c2 : index] : vector<2xf32>
          %303 = vector.broadcast %cst_1 : f32 to vector<3x2xf32>
          %304 = vector.fma %303, %303, %40 : vector<3x2xf32>
          %305 = arith.remui %in, %false : i1
          %306 = arith.minf %cst, %cst : f16
          %307 = math.ceil %10 : tensor<3x2x2xf16>
          %308 = arith.shrui %c588364374_i64, %c1418927244_i64 : i64
          %309 = vector.broadcast %false : i1 to vector<2xi1>
          %310 = vector.maskedload %alloc_8[%c0, %c1], %309, %309 : memref<2x2xi1>, vector<2xi1>, vector<2xi1> into vector<2xi1>
          %311 = arith.xori %in, %false : i1
          %312 = bufferization.to_tensor %alloc_8 : memref<2x2xi1>
          %313 = math.tanh %cst_3 : f16
          %314 = arith.minsi %c454538438_i64, %c454538438_i64 : i64
          %collapsed_41 = tensor.collapse_shape %17 [[0, 1], [2]] : tensor<3x2x2xi1> into tensor<6x2xi1>
          %315 = memref.load %alloc_10[%c1] : memref<2xf32>
          %316 = math.powf %9, %9 : tensor<3x2x2xf16>
          memref.store %cst_0, %alloc_5[%c1, %c0, %c0] : memref<3x2x2xf32>
          %317 = affine.load %alloc_16[%c14, %c3, %c10] : memref<3x2x2xf16>
          %cast_42 = tensor.cast %14 : tensor<2xi1> to tensor<?xi1>
          linalg.yield %c-5916_i16 : i16
        } -> tensor<3x2x2xi16>
        %270 = vector.extract %83[0] : vector<2xf32>
        affine.store %cst_3, %alloc_13[%c5, %c12] : memref<3x2xf16>
        %271 = math.ceil %4 : tensor<3x2x2xf32>
        %272 = math.roundeven %4 : tensor<3x2x2xf32>
        affine.for %arg2 = 0 to 8 {
        }
        %c991169334_i64 = arith.constant 991169334 : i64
        %cast_35 = tensor.cast %10 : tensor<3x2x2xf16> to tensor<?x?x?xf16>
        %273 = vector.broadcast %false : i1 to vector<2xi1>
        %274 = vector.maskedload %alloc_7[%c0, %c1], %273, %273 : memref<2x2xi1>, vector<2xi1>, vector<2xi1> into vector<2xi1>
        vector.print %273 : vector<2xi1>
        %275 = arith.subi %53, %53 : i32
        affine.for %arg2 = 0 to 100 {
        }
        %alloca = memref.alloca() : memref<2x2xf32>
        %276 = index.sub %c2, %c2
        affine.store %cst_3, %alloc_13[%c4, %c13] : memref<3x2xf16>
        %277 = arith.remf %cst_1, %267 : f32
        %278 = vector.matrix_multiply %274, %274 {lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<2xi1>, vector<2xi1>) -> vector<1xi1>
        %279 = memref.load %alloc_9[%c0, %c0] : memref<2x2xi1>
        %280 = math.ctpop %0 : tensor<3x2x2xi16>
        %true_36 = index.bool.constant true
        %281 = math.tan %21 : tensor<2xf16>
        %282 = scf.execute_region -> index {
          %287 = memref.load %alloc_10[%c0] : memref<2xf32>
          %288 = vector.broadcast %c8 : index to vector<1xindex>
          %289 = vector.broadcast %c588364374_i64 : i64 to vector<1xi64>
          vector.scatter %alloc_17[%c0, %c1] [%288], %278, %289 : memref<2x2xi64>, vector<1xindex>, vector<1xi1>, vector<1xi64>
          %290 = index.sub %74, %c4
          %291 = arith.xori %53, %c189500516_i32 : i32
          %292 = arith.shli %c540530258_i32, %c189500516_i32 : i32
          %293 = index.sizeof
          %294 = vector.load %alloc_4[%c1, %c1, %c0] : memref<3x2x2xi64>, vector<3x2xi64>
          %295 = math.log %7 : tensor<3x2x2xf16>
          %296 = vector.maskedload %alloc_5[%c2, %c1, %c0], %273, %65 : memref<3x2x2xf32>, vector<2xi1>, vector<2xf32> into vector<2xf32>
          %297 = index.maxu %c3, %c0
          %298 = math.ctlz %1 : tensor<2xi32>
          %299 = math.ctpop %6 : tensor<3x2x2xi32>
          memref.assume_alignment %alloc_15, 16 : memref<2xi32>
          %300 = arith.cmpi ule, %c835286953_i32, %c2047384402_i32 : i32
          %301 = math.ipowi %c-5916_i16, %c-5916_i16 : i16
          %302 = math.log %7 : tensor<3x2x2xf16>
          scf.yield %82 : index
        }
        %alloc_37 = memref.alloc() : memref<3x2xi32>
        memref.copy %alloc_11, %alloc_37 : memref<3x2xi32> to memref<3x2xi32>
        %cast_38 = tensor.cast %21 : tensor<2xf16> to tensor<?xf16>
        %283 = vector.broadcast %51 : index to vector<2xindex>
        %284 = vector.broadcast %cst_2 : f16 to vector<2xf16>
        vector.scatter %alloc_13[%c1, %c1] [%283], %274, %284 : memref<3x2xf16>, vector<2xindex>, vector<2xi1>, vector<2xf16>
        %285 = memref.load %alloc_17[%c1, %c1] : memref<2x2xi64>
        %286 = arith.divf %cst, %cst_3 : f16
        %true_39 = arith.constant true
        linalg.yield %true_39 : i1
      }
    vector.print %20 : vector<1xi32>
    %splat = tensor.splat %c528704457_i32 : tensor<2x2xi32>
    %85 = math.roundeven %10 : tensor<3x2x2xf16>
    %86 = math.ctpop %53 : i32
    memref.store %cst, %alloc_13[%c2, %c0] : memref<3x2xf16>
    %87 = arith.maxf %cst_2, %cst_2 : f16
    %extracted = tensor.extract %9[%c0, %c0, %c0] : tensor<3x2x2xf16>
    %inserted = tensor.insert %cst into %9[%c0, %c1, %c1] : tensor<3x2x2xf16>
    %88 = index.sizeof
    %89 = math.ipowi %13, %84 : tensor<3x2x2xi1>
    %90 = arith.minsi %c454538438_i64, %c588364374_i64 : i64
    vector.print %40 : vector<3x2xf32>
    %91 = math.ipowi %false, %81 : i1
    %92 = arith.maxf %cst_0, %cst_0 : f32
    %93 = arith.maxf %cst_2, %cst_3 : f16
    %94 = arith.floordivsi %c189500516_i32, %53 : i32
    %95 = vector.broadcast %81 : i1 to vector<2xi1>
    %96 = vector.maskedload %alloc_6[%c0], %95, %83 : memref<2xf32>, vector<2xi1>, vector<2xf32> into vector<2xf32>
    %97 = math.floor %4 : tensor<3x2x2xf32>
    %98 = math.fma %5, %5, %5 : tensor<2xf16>
    %99 = math.ctpop %84 : tensor<3x2x2xi1>
    %100 = math.ipowi %15, %15 : tensor<2x2xi16>
    %101 = vector.shuffle %61, %65 [2] : vector<2xf32>, vector<2xf32>
    %102 = affine.apply affine_map<(d0, d1, d2) -> (16)>(%c11, %c10, %c14)
    %103 = index.add %26, %82
    %104 = memref.atomic_rmw mins %c588364374_i64, %alloc_17[%c1, %c0] : (i64, memref<2x2xi64>) -> i64
    %105 = math.ctlz %13 : tensor<3x2x2xi1>
    %106 = index.divu %c13, %c4
    %107 = vector.broadcast %cst_0 : f32 to vector<3x2xf32>
    %108 = vector.fma %107, %41, %59 : vector<3x2xf32>
    %109 = tensor.empty() : tensor<2xi1>
    %cast = tensor.cast %3 : tensor<2x2xf32> to tensor<?x?xf32>
    %110 = arith.minf %cst_0, %cst_1 : f32
    %111 = math.ipowi %c588364374_i64, %c588364374_i64 : i64
    %112 = index.sizeof
    %113 = affine.apply affine_map<(d0, d1, d2) -> (d2)>(%26, %c15, %c12)
    %114 = math.exp %21 : tensor<2xf16>
    %115 = arith.minf %cst_3, %cst_2 : f16
    %116 = vector.maskedload %alloc_8[%c0, %c0], %95, %95 : memref<2x2xi1>, vector<2xi1>, vector<2xi1> into vector<2xi1>
    %117 = math.ctpop %c454538438_i64 : i64
    %118 = math.ctlz %1 : tensor<2xi32>
    %119 = math.roundeven %extracted : f16
    %120 = arith.remui %c528704457_i32, %c189500516_i32 : i32
    %121 = math.absi %12 : tensor<3x2xi32>
    %122 = arith.remui %53, %c2047384402_i32 : i32
    %123 = arith.muli %81, %false : i1
    %124 = vector.bitcast %20 : vector<1xi32> to vector<1xi32>
    %125 = math.round %7 : tensor<3x2x2xf16>
    %126 = arith.minsi %c1807483623_i64, %c588364374_i64 : i64
    %127 = scf.execute_region -> index {
      %264 = memref.load %alloc_4[%c0, %c1, %c1] : memref<3x2x2xi64>
      %265 = scf.execute_region -> memref<3x2xf32> {
        %281 = index.floordivs %c15, %c11
        %282 = memref.atomic_rmw maxs %c454538438_i64, %alloc_17[%c1, %c0] : (i64, memref<2x2xi64>) -> i64
        %inserted_34 = tensor.insert %c189500516_i32 into %12[%c2, %c0] : tensor<3x2xi32>
        %283 = vector.shuffle %95, %116 [0, 2] : vector<2xi1>, vector<2xi1>
        %284 = math.fma %8, %8, %8 : tensor<2xf32>
        %285 = arith.remf %cst_2, %cst_3 : f16
        %286 = arith.divsi %53, %c835286953_i32 : i32
        %287 = math.exp %9 : tensor<3x2x2xf16>
        %288 = math.fpowi %8, %1 : tensor<2xf32>, tensor<2xi32>
        %false_35 = arith.constant false
        %289 = vector.insert %cst_1, %96 [0] : f32 into vector<2xf32>
        %290 = arith.divui %c528704457_i32, %53 : i32
        %291 = bufferization.to_tensor %alloc_11 : memref<3x2xi32>
        %292 = arith.remf %cst_2, %cst_3 : f16
        %293 = vector.splat %c3 : vector<3x2x2xindex>
        %294 = math.roundeven %4 : tensor<3x2x2xf32>
        scf.yield %alloc : memref<3x2xf32>
      }
      %266 = math.ceil %transposed : tensor<2x3x2xf32>
      %267 = index.maxu %c5, %30
      %268 = vector.broadcast %cst : f16 to vector<2xf16>
      %269 = vector.maskedload %alloc_13[%c2, %c0], %95, %268 : memref<3x2xf16>, vector<2xi1>, vector<2xf16> into vector<2xf16>
      %270 = math.log1p %10 : tensor<3x2x2xf16>
      %271 = index.ceildivu %c2, %26
      %272 = arith.minf %cst_3, %cst_3 : f16
      %273 = arith.mulf %cst_1, %cst_1 : f32
      %274 = vector.shuffle %59, %41 [0, 1, 2, 3, 4, 5] : vector<3x2xf32>, vector<3x2xf32>
      %275 = index.sizeof
      %276 = arith.maxf %cst_1, %cst_0 : f32
      %277 = memref.load %alloc_18[%c1, %c1] : memref<2x2xi1>
      %278 = memref.realloc %alloc_10 : memref<2xf32> to memref<1xf32>
      %279 = affine.load %alloc_15[%c11] : memref<2xi32>
      %280 = index.maxu %c1, %271
      scf.yield %c4 : index
    }
    %128 = index.floordivs %c2, %112
    %129 = memref.atomic_rmw assign %cst_0, %alloc[%c0, %c0] : (f32, memref<3x2xf32>) -> f32
    %splat_21 = tensor.splat %53 : tensor<2xi32>
    %130 = math.exp %23 : tensor<f16>
    %131 = affine.for %arg2 = 0 to 12 iter_args(%arg3 = %12) -> (tensor<3x2xi32>) {
      affine.yield %arg3 : tensor<3x2xi32>
    }
    %132 = math.round %11 : tensor<2x2xf16>
    %133 = index.divu %127, %28
    %134 = arith.andi %false, %false : i1
    %135 = vector.transpose %65, [0] : vector<2xf32> to vector<2xf32>
    %136 = tensor.empty() : tensor<3x2xf32>
    %mapped_22 = linalg.map ins(%alloc : memref<3x2xf32>) outs(%136 : tensor<3x2xf32>)
      (%in: f32) {
        %264 = index.maxs %79, %c13
        %265 = math.floor %transposed : tensor<2x3x2xf32>
        %266 = vector.insertelement %cst_1, %61[%30 : index] : vector<2xf32>
        %267 = index.sub %113, %c2
        %268 = index.ceildivu %c8, %73
        %alloc_34 = memref.alloc() : memref<2x3x2xi1>
        %269 = tensor.empty() : tensor<2x3xi1>
        %270 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1, d0, d2)>, affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_34, %269 : memref<2x3x2xi1>, tensor<2x3xi1>) outs(%52 : tensor<3x2x2xi1>) {
        ^bb0(%in_43: i1, %in_44: i1, %out: i1):
          %292 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<xor>} %20, %20, %c835286953_i32 : vector<1xi32>, vector<1xi32> into i32
          %293 = memref.realloc %alloc_6 : memref<2xf32> to memref<3xf32>
          %294 = affine.max affine_map<(d0, d1, d2) -> (d0 - d2 ceildiv 32 + 128)>(%30, %28, %267)
          %295 = index.divu %c13, %c12
          %collapsed_45 = tensor.collapse_shape %10 [[0, 1], [2]] : tensor<3x2x2xf16> into tensor<6x2xf16>
          %296 = arith.maxui %c1418927244_i64, %c454538438_i64 : i64
          %297 = vector.shuffle %108, %41 [3] : vector<3x2xf32>, vector<3x2xf32>
          %298 = math.fma %3, %3, %3 : tensor<2x2xf32>
          %true_46 = arith.constant true
          %alloca = memref.alloca() : memref<3x2x2xf16>
          %299 = vector.broadcast %extracted : f16 to vector<3x2xf16>
          %300 = index.divs %c11, %73
          affine.store %out, %alloc_14[%c6, %c8, %c1] : memref<3x2x2xi1>
          %301 = math.roundeven %10 : tensor<3x2x2xf16>
          affine.store %extracted, %alloc_13[%c13, %c4] : memref<3x2xf16>
          %302 = math.cos %8 : tensor<2xf32>
          %303 = arith.ceildivsi %c454538438_i64, %c454538438_i64 : i64
          %304 = math.log10 %7 : tensor<3x2x2xf16>
          %c30246_i16 = arith.constant 30246 : i16
          %305 = arith.negf %cst_3 : f16
          %306 = memref.atomic_rmw minf %in, %alloc[%c1, %c0] : (f32, memref<3x2xf32>) -> f32
          memref.assume_alignment %alloc_10, 1 : memref<2xf32>
          %307 = math.tanh %5 : tensor<2xf16>
          %308 = vector.broadcast %in : f32 to vector<2x2xf32>
          %309 = vector.outerproduct %61, %96, %308 {kind = #vector.kind<minf>} : vector<2xf32>, vector<2xf32>
          %310 = vector.extract_strided_slice %107 {offsets = [0], sizes = [1], strides = [1]} : vector<3x2xf32> to vector<1x2xf32>
          %311 = affine.apply affine_map<(d0, d1, d2, d3) -> (d0)>(%74, %112, %106, %267)
          %312 = index.divs %26, %c0
          %313 = memref.realloc %alloc_10 : memref<2xf32> to memref<1xf32>
          %314 = memref.realloc %alloc_10 : memref<2xf32> to memref<1xf32>
          %315 = math.absf %4 : tensor<3x2x2xf32>
          %true_47 = index.bool.constant true
          %316 = arith.shrui %c2047384402_i32, %c189500516_i32 : i32
          linalg.yield %false : i1
        } -> tensor<3x2x2xi1>
        %271 = affine.max affine_map<(d0) -> ((d0 ceildiv 128 - d0 * 3 - 64) * 128, d0 ceildiv 128)>(%c15)
        %272 = arith.divui %81, %81 : i1
        %extracted_35 = tensor.extract %8[%c1] : tensor<2xf32>
        %273 = arith.divui %c835286953_i32, %c528704457_i32 : i32
        %274 = vector.broadcast %81 : i1 to vector<3xi1>
        %275 = vector.maskedload %alloc_7[%c0, %c1], %274, %274 : memref<2x2xi1>, vector<3xi1>, vector<3xi1> into vector<3xi1>
        %276 = arith.divf %cst_2, %extracted : f16
        %277 = arith.cmpi ne, %c835286953_i32, %53 : i32
        %278 = vector.bitcast %61 : vector<2xf32> to vector<2xf32>
        %279 = vector.broadcast %53 : i32 to vector<2xi32>
        %280 = arith.andi %c528704457_i32, %c189500516_i32 : i32
        %281 = affine.max affine_map<(d0, d1, d2, d3) -> (d2 + 2, d2 - 2)>(%28, %271, %c8, %82)
        %collapsed_36 = tensor.collapse_shape %transposed [[0, 1], [2]] : tensor<2x3x2xf32> into tensor<6x2xf32>
        %splat_37 = tensor.splat %c540530258_i32 : tensor<3x2x2xi32>
        %282 = math.atan %cst_1 : f32
        %283 = math.log %8 : tensor<2xf32>
        %284 = arith.cmpi ult, %c189500516_i32, %c835286953_i32 : i32
        %dest_38, %accumulated_value_39 = vector.scan <maxf>, %41, %83 {inclusive = false, reduction_dim = 0 : i64} : vector<3x2xf32>, vector<2xf32>
        %285 = vector.broadcast %false : i1 to vector<3x2x2xi1>
        %286 = math.round %7 : tensor<3x2x2xf16>
        %287 = arith.maxsi %c2047384402_i32, %c835286953_i32 : i32
        %288 = vector.create_mask %264 : vector<2xi1>
        %289 = math.fpowi %11, %splat : tensor<2x2xf16>, tensor<2x2xi32>
        scf.execute_region {
          %292 = arith.divui %81, %81 : i1
          %293 = math.ceil %136 : tensor<3x2xf32>
          %294 = arith.remf %cst, %extracted : f16
          vector.print %65 : vector<2xf32>
          %295 = vector.broadcast %cst_0 : f32 to vector<3x2xf32>
          %296 = vector.fma %295, %295, %295 : vector<3x2xf32>
          %cst_43 = arith.constant 1.000000e+00 : f32
          %297 = vector.transfer_read %alloc_5[%c0, %26, %128], %cst_43 : memref<3x2x2xf32>, vector<2x1xf32>
          %298 = tensor.empty() : tensor<2x2xf16>
          memref.assume_alignment %alloc_11, 2 : memref<3x2xi32>
          %299 = arith.ori %81, %false : i1
          %300 = vector.splat %26 : vector<3x2xindex>
          %301 = arith.subi %53, %c835286953_i32 : i32
          %302 = index.ceildivs %88, %88
          %303 = arith.remf %cst_1, %cst_1 : f32
          %304 = index.sizeof
          %305 = bufferization.clone %alloc_11 : memref<3x2xi32> to memref<3x2xi32>
          %306 = vector.transpose %288, [0] : vector<2xi1> to vector<2xi1>
          scf.yield
        }
        %290 = math.ipowi %c2047384402_i32, %c189500516_i32 : i32
        %dest_40, %accumulated_value_41 = vector.scan <add>, %108, %83 {inclusive = false, reduction_dim = 0 : i64} : vector<3x2xf32>, vector<2xf32>
        %291 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%1 : tensor<2xi32>) outs(%6 : tensor<3x2x2xi32>) {
        ^bb0(%in_43: i32, %out: i32):
          %c0_i32 = arith.constant 0 : i32
          %c0_i32_44 = arith.constant 0 : i32
          %292 = vector.transfer_read %splat[%74, %c13], %c0_i32_44 : tensor<2x2xi32>, vector<i32>
          %293 = arith.shrui %c528704457_i32, %c2047384402_i32 : i32
          %294 = math.exp %21 : tensor<2xf16>
          %295 = arith.remf %in, %in : f32
          %cast_45 = tensor.cast %15 : tensor<2x2xi16> to tensor<?x?xi16>
          %296 = arith.shli %81, %81 : i1
          %297 = memref.realloc %alloc_10 : memref<2xf32> to memref<2xf32>
          %298 = vector.bitcast %95 : vector<2xi1> to vector<2xi1>
          %299 = arith.divui %c588364374_i64, %c454538438_i64 : i64
          %300 = math.roundeven %cst : f16
          %301 = arith.muli %c2047384402_i32, %c540530258_i32 : i32
          %302 = vector.insertelement %in_43, %124[%127 : index] : vector<1xi32>
          %303 = vector.reduction <maxui>, %298 : vector<2xi1> into i1
          %304 = math.sqrt %extracted : f16
          %305 = memref.load %alloc_14[%c2, %c0, %c1] : memref<3x2x2xi1>
          %306 = tensor.empty() : tensor<2x2xi32>
          %307 = index.mul %c5, %c14
          %308 = math.sqrt %9 : tensor<3x2x2xf16>
          %309 = arith.ceildivsi %c528704457_i32, %in_43 : i32
          %310 = vector.broadcast %cst_1 : f32 to vector<3xf32>
          %311 = vector.maskedload %alloc_5[%c1, %c1, %c1], %275, %310 : memref<3x2x2xf32>, vector<3xi1>, vector<3xf32> into vector<3xf32>
          %312 = math.ctpop %15 : tensor<2x2xi16>
          %313 = math.ipowi %306, %306 : tensor<2x2xi32>
          %314 = math.ipowi %306, %splat : tensor<2x2xi32>
          %315 = math.atan %23 : tensor<f16>
          %316 = vector.broadcast %out : i32 to vector<3x2x2xi32>
          %expanded = tensor.expand_shape %15 [[0], [1, 2]] : tensor<2x2xi16> into tensor<2x2x1xi16>
          %317 = index.maxu %103, %102
          %318 = index.add %127, %c9
          %319 = math.round %8 : tensor<2xf32>
          %320 = index.sizeof
          %321 = tensor.empty() : tensor<2xi32>
          %322 = math.absi %splat_37 : tensor<3x2x2xi32>
          linalg.yield %c835286953_i32 : i32
        } -> tensor<3x2x2xi32>
        %cst_42 = arith.constant 1.000000e+00 : f32
        linalg.yield %cst_42 : f32
      }
    %137 = math.log10 %4 : tensor<3x2x2xf32>
    memref.assume_alignment %alloc_6, 8 : memref<2xf32>
    memref.store %false, %alloc_19[] : memref<i1>
    %138 = math.tanh %18 : tensor<2x3x2xf32>
    %139 = arith.shli %c540530258_i32, %c528704457_i32 : i32
    affine.store %false, %alloc_9[%c5, %c15] : memref<2x2xi1>
    %140 = math.exp %cst : f16
    %141 = vector.shuffle %40, %108 [0, 1, 2, 4] : vector<3x2xf32>, vector<3x2xf32>
    %142 = vector.broadcast %81 : i1 to vector<3x2x2xi1>
    %143 = math.sqrt %11 : tensor<2x2xf16>
    %144 = math.log %4 : tensor<3x2x2xf32>
    %145 = math.log %7 : tensor<3x2x2xf16>
    %146 = index.divu %128, %c2
    %147 = arith.remf %cst_2, %cst : f16
    %148 = arith.shrui %81, %81 : i1
    %149 = index.divs %c11, %c10
    %150 = vector.matrix_multiply %20, %20 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi32>, vector<1xi32>) -> vector<1xi32>
    %151 = math.fma %cst_2, %cst_2, %cst : f16
    %152 = arith.ceildivsi %c454538438_i64, %c454538438_i64 : i64
    %153 = math.ctpop %14 : tensor<2xi1>
    memref.tensor_store %12, %alloc_11 : memref<3x2xi32>
    %154 = math.floor %extracted : f16
    %155 = tensor.empty() : tensor<3x2x2xf16>
    %156 = arith.minsi %81, %false : i1
    %157 = vector.broadcast %cst_3 : f16 to vector<3x2x2xf16>
    %158 = arith.floordivsi %c835286953_i32, %c528704457_i32 : i32
    %159 = math.ctpop %splat : tensor<2x2xi32>
    %160 = vector.broadcast %cst_2 : f16 to vector<3x2xf16>
    %161 = index.ceildivu %c13, %c2
    %162 = arith.remf %extracted, %cst_3 : f16
    %163 = arith.maxsi %c588364374_i64, %c1807483623_i64 : i64
    memref.assume_alignment %alloc_5, 16 : memref<3x2x2xf32>
    %164 = index.mul %74, %66
    %165 = vector.create_mask %82, %102 : vector<2x2xi1>
    affine.for %arg2 = 0 to 23 {
    }
    %166 = arith.floordivsi %c189500516_i32, %c540530258_i32 : i32
    %167 = vector.broadcast %extracted : f16 to vector<1xf16>
    %168 = vector.broadcast %false : i1 to vector<1xi1>
    %169 = vector.maskedload %alloc_13[%c2, %c0], %168, %167 : memref<3x2xf16>, vector<1xi1>, vector<1xf16> into vector<1xf16>
    %170 = index.floordivs %c2, %c4
    %171 = arith.floordivsi %c189500516_i32, %c835286953_i32 : i32
    %172 = bufferization.clone %alloc_13 : memref<3x2xf16> to memref<3x2xf16>
    %173 = arith.divui %c28612_i16, %c-5916_i16 : i16
    %174 = vector.insert %cst_0, %61 [1] : f32 into vector<2xf32>
    %175 = math.powf %cst_3, %cst : f16
    %176 = memref.load %alloc_5[%c2, %c1, %c1] : memref<3x2x2xf32>
    %cast_23 = tensor.cast %2 : tensor<3x2x2xi16> to tensor<?x?x?xi16>
    %177 = tensor.empty() : tensor<3xf32>
    %178 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1)>, affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%177, %8, %3 : tensor<3xf32>, tensor<2xf32>, tensor<2x2xf32>) outs(%transposed : tensor<2x3x2xf32>) {
    ^bb0(%in: f32, %in_34: f32, %in_35: f32, %out: f32):
      %264 = vector.multi_reduction <add>, %160, %160 [] : vector<3x2xf16> to vector<3x2xf16>
      %265 = vector.splat %74 : vector<3x2x2xindex>
      %266 = vector.insertelement %false, %95[%164 : index] : vector<2xi1>
      affine.for %arg2 = 0 to 82 {
      }
      scf.execute_region {
