module {
  func.func nested @func1(%arg0: i64, %arg1: index) {
    %false = arith.constant false
    %cst = arith.constant 2.923200e+04 : f16
    %c22329_i16 = arith.constant 22329 : i16
    %c1377814532_i32 = arith.constant 1377814532 : i32
    %cst_0 = arith.constant 2.105600e+04 : f16
    %c1193460924_i64 = arith.constant 1193460924 : i64
    %c1818536603_i64 = arith.constant 1818536603 : i64
    %cst_1 = arith.constant 0x4DD71348 : f32
    %cst_2 = arith.constant 1.16919949E+9 : f32
    %cst_3 = arith.constant 1.283200e+04 : f16
    %c1431144665_i64 = arith.constant 1431144665 : i64
    %cst_4 = arith.constant 3.510400e+04 : f16
    %cst_5 = arith.constant 3.622400e+04 : f16
    %cst_6 = arith.constant 0x4C66794A : f32
    %false_7 = arith.constant false
    %cst_8 = arith.constant 1.407200e+04 : f16
    %0 = tensor.empty() : tensor<4xf32>
    %1 = tensor.empty() : tensor<4xf16>
    %2 = tensor.empty() : tensor<13x7xi32>
    %3 = tensor.empty() : tensor<4xi32>
    %4 = tensor.empty() : tensor<13x7xi64>
    %5 = tensor.empty() : tensor<5xf16>
    %6 = tensor.empty() : tensor<4xi1>
    %7 = tensor.empty() : tensor<4xf32>
    %8 = tensor.empty() : tensor<5xi16>
    %9 = tensor.empty() : tensor<7x4xi64>
    %10 = tensor.empty() : tensor<4xi16>
    %11 = tensor.empty() : tensor<4xi16>
    %12 = tensor.empty() : tensor<13x7xi1>
    %13 = tensor.empty() : tensor<13x7xi64>
    %14 = tensor.empty() : tensor<4xi64>
    %15 = tensor.empty() : tensor<13x7xf16>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<13x7xi16>
    %alloc_9 = memref.alloc() : memref<5xi1>
    %alloc_10 = memref.alloc() : memref<7x4xi16>
    %alloc_11 = memref.alloc() : memref<5xi32>
    %alloc_12 = memref.alloc() : memref<4xi16>
    %alloc_13 = memref.alloc() : memref<4xi64>
    %alloc_14 = memref.alloc() : memref<4xf16>
    %alloc_15 = memref.alloc() : memref<7x4xf32>
    %alloc_16 = memref.alloc() : memref<13x7xf32>
    %alloc_17 = memref.alloc() : memref<5xf32>
    %alloc_18 = memref.alloc() : memref<5xi16>
    %alloc_19 = memref.alloc() : memref<7x4xi1>
    %alloc_20 = memref.alloc() : memref<5xi32>
    %alloc_21 = memref.alloc() : memref<7x4xi64>
    %alloc_22 = memref.alloc() : memref<4xf16>
    %alloc_23 = memref.alloc() : memref<7x4xf32>
    %16 = tensor.empty() : tensor<13x7xi32>
    %17 = linalg.copy ins(%2 : tensor<13x7xi32>) outs(%16 : tensor<13x7xi32>) -> tensor<13x7xi32>
    %18 = tensor.empty() : tensor<4x7xi16>
    %transposed = linalg.transpose ins(%alloc_10 : memref<7x4xi16>) outs(%18 : tensor<4x7xi16>) permutation = [1, 0] 
    %19 = tensor.empty() : tensor<13xf16>
    %reduced = linalg.reduce ins(%15 : tensor<13x7xf16>) outs(%19 : tensor<13xf16>) dimensions = [1] 
      (%in: f16, %init: f16) {
        %261 = vector.splat %cst_1 : vector<13x7xf32>
        affine.for %arg2 = 0 to 24 {
        }
        %262 = arith.cmpf false, %cst_8, %cst : f16
        %263 = index.castu %c1431144665_i64 : i64 to index
        %264 = vector.broadcast %c1377814532_i32 : i32 to vector<13xi32>
        %265 = vector.transfer_write %264, %2[%c5, %c9] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<13xi32>, tensor<13x7xi32>
        bufferization.dealloc_tensor %10 : tensor<4xi16>
        %266 = bufferization.to_tensor %alloc_9 : memref<5xi1>
        %267 = math.round %0 : tensor<4xf32>
        %cst_57 = arith.constant 1.000000e+00 : f16
        linalg.yield %cst_57 : f16
      }
    scf.parallel (%arg2, %arg3) = (%c3, %c9) to (%c8, %c1) step (%c10, %c7) {
      %261 = arith.ori %c1818536603_i64, %c1193460924_i64 : i64
      %262 = arith.divf %cst, %cst_0 : f16
      %263 = scf.while (%arg4 = %cst) : (f16) -> f16 {
        %279 = arith.cmpf false, %cst_6, %cst_1 : f32
        %280 = arith.shrui %c1431144665_i64, %c1431144665_i64 : i64
        %281 = vector.create_mask %c4, %c11 : vector<7x4xi1>
        %282 = vector.extract_strided_slice %281 {offsets = [2], sizes = [1], strides = [1]} : vector<7x4xi1> to vector<1x4xi1>
        %283 = vector.broadcast %false_7 : i1 to vector<4xi1>
        %284 = vector.multi_reduction <minui>, %281, %283 [0] : vector<7x4xi1> to vector<4xi1>
        %splat_57 = tensor.splat %cst_1 : tensor<7x4xf32>
        %alloc_58 = memref.alloc() : memref<4xi32>
        memref.tensor_store %3, %alloc_58 : memref<4xi32>
        %285 = math.round %cst_3 : f16
        scf.condition(%false) %cst : f16
      } do {
      ^bb0(%arg4: f16):
        %279 = arith.cmpi ugt, %c1818536603_i64, %c1818536603_i64 : i64
        %280 = math.rsqrt %cst_1 : f32
        %281 = math.fma %cst, %cst_3, %cst_4 : f16
        %extracted_57 = tensor.extract %reduced[%c6] : tensor<13xf16>
        %282 = arith.maxui %c1431144665_i64, %c1193460924_i64 : i64
        %283 = vector.broadcast %c22329_i16 : i16 to vector<4xi16>
        %284 = vector.matrix_multiply %283, %283 {lhs_columns = 4 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<4xi16>, vector<4xi16>) -> vector<1xi16>
        %285 = arith.cmpf ogt, %cst_4, %extracted_57 : f16
        %286 = arith.maxui %false, %false : i1
        %287 = arith.shli %false_7, %false_7 : i1
        %288 = vector.transpose %284, [0] : vector<1xi16> to vector<1xi16>
        %289 = index.maxu %c4, %arg2
        %290 = index.ceildivu %c1, %c5
        %291 = affine.apply affine_map<(d0, d1, d2, d3) -> (d3 + 128)>(%c11, %290, %290, %c7)
        %extracted_58 = tensor.extract %0[%c3] : tensor<4xf32>
        %292 = vector.broadcast %c7 : index to vector<7xindex>
        %293 = vector.broadcast %false : i1 to vector<7xi1>
        %294 = vector.broadcast %c1377814532_i32 : i32 to vector<7xi32>
        vector.scatter %alloc_11[%c3] [%292], %293, %294 : memref<5xi32>, vector<7xindex>, vector<7xi1>, vector<7xi32>
        %295 = vector.broadcast %cst_3 : f16 to vector<4xf16>
        %296 = vector.broadcast %false_7 : i1 to vector<4xi1>
        %297 = vector.broadcast %c1377814532_i32 : i32 to vector<4xi32>
        %298 = vector.gather %5[%c14] [%297], %296, %295 : tensor<5xf16>, vector<4xi32>, vector<4xi1>, vector<4xf16> into vector<4xf16>
        scf.yield %cst : f16
      }
      %264 = arith.subi %false_7, %false_7 : i1
      %265 = vector.broadcast %c22329_i16 : i16 to vector<1xi16>
      %266 = vector.extract_strided_slice %265 {offsets = [0], sizes = [1], strides = [1]} : vector<1xi16> to vector<1xi16>
      %267 = math.ctlz %9 : tensor<7x4xi64>
      %268 = arith.negf %cst_1 : f32
      %269 = math.ctlz %transposed : tensor<4x7xi16>
      %270 = affine.apply affine_map<(d0) -> (d0 floordiv 8 - (d0 - 4) * 2 - 4)>(%c1)
      %271 = bufferization.clone %alloc_12 : memref<4xi16> to memref<4xi16>
      %272 = memref.realloc %alloc_22 : memref<4xf16> to memref<7xf16>
      %273 = vector.insert %c22329_i16, %266 [0] : i16 into vector<1xi16>
      %274 = arith.shrsi %false, %false_7 : i1
      %275 = vector.broadcast %c22329_i16 : i16 to vector<1x1xi16>
      %276 = vector.outerproduct %265, %265, %275 {kind = #vector.kind<maxui>} : vector<1xi16>, vector<1xi16>
      %277 = arith.addi %c1431144665_i64, %c1193460924_i64 : i64
      %278 = affine.for %arg4 = 0 to 5 iter_args(%arg5 = %alloc_11) -> (memref<5xi32>) {
        affine.yield %arg5 : memref<5xi32>
      }
      scf.yield
    }
    %20 = affine.vector_load %alloc_23[%c3, %c4] : memref<7x4xf32>, vector<5xf32>
    affine.vector_store %20, %alloc_23[%c11, %c6] : memref<7x4xf32>, vector<5xf32>
    %21 = tensor.empty() : tensor<4xi64>
    %22 = tensor.empty() : tensor<i64>
    %23 = linalg.dot ins(%14, %21 : tensor<4xi64>, tensor<4xi64>) outs(%22 : tensor<i64>) -> tensor<i64>
    %24 = math.floor %15 : tensor<13x7xf16>
    %false_24 = index.bool.constant false
    memref.store %c1431144665_i64, %alloc_13[%c2] : memref<4xi64>
    %25 = math.round %cst_8 : f16
    %26 = arith.minf %cst_1, %cst_6 : f32
    %27 = math.ctlz %c22329_i16 : i16
    %28 = math.fma %cst_6, %cst_1, %cst_1 : f32
    %29 = math.exp %5 : tensor<5xf16>
    %30 = vector.matrix_multiply %20, %20 {lhs_columns = 5 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<5xf32>, vector<5xf32>) -> vector<1xf32>
    %rank = tensor.rank %14 : tensor<4xi64>
    %31 = vector.broadcast %cst_2 : f32 to vector<1x1xf32>
    %32 = vector.outerproduct %30, %30, %31 {kind = #vector.kind<mul>} : vector<1xf32>, vector<1xf32>
    %33 = arith.minsi %false_7, %false_24 : i1
    %34 = arith.muli %c22329_i16, %c22329_i16 : i16
    %35 = arith.maxui %c1818536603_i64, %c1193460924_i64 : i64
    %36 = vector.broadcast %cst_5 : f16 to vector<7x13xf16>
    %37 = vector.broadcast %cst_5 : f16 to vector<13xf16>
    %dest, %accumulated_value = vector.scan <mul>, %36, %37 {inclusive = false, reduction_dim = 0 : i64} : vector<7x13xf16>, vector<13xf16>
    %38 = arith.ceildivsi %false_24, %false : i1
    %39 = math.ctpop %13 : tensor<13x7xi64>
    %cst_25 = arith.constant 0x4E2DD081 : f32
    %40 = math.round %15 : tensor<13x7xf16>
    scf.index_switch %c5 
    case 1 {
      %261 = index.maxu %c0, %rank
      %262 = arith.xori %c1818536603_i64, %c1193460924_i64 : i64
      %263 = vector.broadcast %false : i1 to vector<5xi1>
      %264 = vector.maskedload %alloc_17[%c2], %263, %20 : memref<5xf32>, vector<5xi1>, vector<5xf32> into vector<5xf32>
      %265 = math.exp %1 : tensor<4xf16>
      %266 = vector.broadcast %c10 : index to vector<4xindex>
      %267 = vector.broadcast %false : i1 to vector<4xi1>
      %268 = vector.broadcast %c22329_i16 : i16 to vector<4xi16>
      vector.scatter %alloc_12[%c2] [%266], %267, %268 : memref<4xi16>, vector<4xindex>, vector<4xi1>, vector<4xi16>
      memref.assume_alignment %alloc_17, 16 : memref<5xf32>
      %c1_i32 = arith.constant 1 : i32
      %269 = vector.transfer_read %17[%c0, %c0], %c1_i32 : tensor<13x7xi32>, vector<i32>
      %270 = math.log1p %cst_3 : f16
      %extracted_57 = tensor.extract %transposed[%c0, %c0] : tensor<4x7xi16>
      %271 = math.log10 %7 : tensor<4xf32>
      %272 = arith.divui %extracted_57, %extracted_57 : i16
      %273 = vector.flat_transpose %263 {columns = 5 : i32, rows = 1 : i32} : vector<5xi1> -> vector<5xi1>
      %274 = arith.ori %extracted_57, %extracted_57 : i16
      %275 = index.casts %c2 : index to i32
      %276 = math.log2 %reduced : tensor<13xf16>
      %277 = vector.broadcast %cst_6 : f32 to vector<4x4x7xf32>
      %278 = vector.broadcast %cst_1 : f32 to vector<4x7xf32>
      %dest_58, %accumulated_value_59 = vector.scan <mul>, %277, %278 {inclusive = false, reduction_dim = 1 : i64} : vector<4x4x7xf32>, vector<4x7xf32>
      scf.yield
    }
    case 2 {
      %261 = math.ceil %cst_2 : f32
      %262 = arith.minsi %c22329_i16, %c22329_i16 : i16
      %263 = index.casts %c1377814532_i32 : i32 to index
      memref.store %cst_6, %alloc_15[%c5, %c0] : memref<7x4xf32>
      %264 = index.maxu %c11, %c8
      %265 = arith.negf %cst_8 : f16
      %266 = math.log1p %cst_2 : f32
      %267 = index.maxs %c1, %c6
      %268 = scf.if %false -> (memref<7x4xi64>) {
        %274 = math.expm1 %19 : tensor<13xf16>
        %alloc_58 = memref.alloc() : memref<4xf32>
        memref.tensor_store %0, %alloc_58 : memref<4xf32>
        %275 = math.round %cst_6 : f32
        %extracted_59 = tensor.extract %12[%c5, %c3] : tensor<13x7xi1>
        affine.store %cst_3, %alloc_22[%c5] : memref<4xf16>
        %c908715861_i64 = arith.constant 908715861 : i64
        %276 = vector.insertelement %cst_6, %20[%c7 : index] : vector<5xf32>
        %rank_60 = tensor.rank %4 : tensor<13x7xi64>
        scf.yield %alloc_21 : memref<7x4xi64>
      } else {
        %274 = tensor.empty() : tensor<13x4xi64>
        %275 = linalg.matmul ins(%4, %9 : tensor<13x7xi64>, tensor<7x4xi64>) outs(%274 : tensor<13x4xi64>) -> tensor<13x4xi64>
        %276 = index.maxs %c3, %c13
        %277 = arith.mulf %cst_2, %cst_1 : f32
        %278 = arith.negf %cst_3 : f16
        %279 = vector.splat %c6 : vector<7x4xindex>
        %280 = math.cttz %3 : tensor<4xi32>
        %281 = arith.divui %c1431144665_i64, %c1193460924_i64 : i64
        %282 = arith.addf %cst, %cst_3 : f16
        scf.yield %alloc_21 : memref<7x4xi64>
      }
      %alloca_57 = memref.alloca() : memref<4xi64>
      %269 = index.casts %c6 : index to i32
      %270 = arith.divsi %c1377814532_i32, %c1377814532_i32 : i32
      %271 = affine.min affine_map<(d0) -> (d0 - 32, ((d0 - 32) floordiv 128) ceildiv 8, -((d0 - 32) floordiv 128 + 1), ((d0 - 32) floordiv 128) ceildiv 8)>(%263)
      %272 = arith.remf %cst_5, %cst_8 : f16
      %273 = index.floordivs %c15, %c9
      memref.assume_alignment %alloc_21, 1 : memref<7x4xi64>
      scf.yield
    }
    case 3 {
      %rank_57 = tensor.rank %1 : tensor<4xf16>
      %261 = arith.ceildivsi %c1193460924_i64, %c1818536603_i64 : i64
      %262 = arith.maxui %false, %false_7 : i1
      %263 = arith.remf %cst_4, %cst_5 : f16
      scf.execute_region {
        %273 = math.round %cst_3 : f16
        %274 = arith.addi %c1431144665_i64, %c1431144665_i64 : i64
        %275 = math.log10 %1 : tensor<4xf16>
        %276 = arith.cmpf ogt, %cst_2, %cst_2 : f32
        %277 = math.round %cst_3 : f16
        bufferization.dealloc_tensor %0 : tensor<4xf32>
        %278 = vector.broadcast %cst_4 : f16 to vector<13x7xf16>
        %279 = vector.broadcast %cst_8 : f16 to vector<7xf16>
        %dest_62, %accumulated_value_63 = vector.scan <minf>, %278, %279 {inclusive = true, reduction_dim = 0 : i64} : vector<13x7xf16>, vector<7xf16>
        %extracted_64 = tensor.extract %11[%c1] : tensor<4xi16>
        %280 = affine.apply affine_map<(d0, d1, d2, d3) -> (d3)>(%c10, %c12, %c7, %c14)
        %281 = vector.broadcast %cst_1 : f32 to vector<13x7xf32>
        %282 = arith.maxf %cst_5, %cst_4 : f16
        %283 = vector.reduction <maxf>, %30 : vector<1xf32> into f32
        %284 = tensor.empty(%c6) : tensor<13x?xf32>
        %285 = index.maxu %c0, %c11
        %286 = vector.extract_strided_slice %278 {offsets = [1], sizes = [11], strides = [1]} : vector<13x7xf16> to vector<11x7xf16>
        scf.yield
      }
      %264 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<mul>} %20, %20, %cst_2 : vector<5xf32>, vector<5xf32> into f32
      %265 = arith.minsi %c1818536603_i64, %c1431144665_i64 : i64
      %collapsed_58 = tensor.collapse_shape %transposed [[0, 1]] : tensor<4x7xi16> into tensor<28xi16>
      %inserted_59 = tensor.insert %false_24 into %12[%c4, %c4] : tensor<13x7xi1>
      %266 = index.ceildivu %c5, %c3
      %267 = arith.andi %false_7, %false_7 : i1
      %268 = arith.maxui %c1377814532_i32, %c1377814532_i32 : i32
      %269 = vector.extract %20[4] : vector<5xf32>
      %c0_i16 = arith.constant 0 : i16
      %270 = vector.transfer_read %8[%c11], %c0_i16 : tensor<5xi16>, vector<i16>
      %271 = vector.broadcast %cst_1 : f32 to vector<7x4xf32>
      %272 = vector.broadcast %cst_2 : f32 to vector<7xf32>
      %dest_60, %accumulated_value_61 = vector.scan <minf>, %271, %272 {inclusive = true, reduction_dim = 1 : i64} : vector<7x4xf32>, vector<7xf32>
      affine.store %cst, %alloc_14[%c11] : memref<4xf16>
      scf.yield
    }
    default {
      %261 = vector.broadcast %cst_4 : f16 to vector<5xf16>
      %262 = vector.broadcast %cst_1 : f32 to vector<5x5xf32>
      %263 = vector.outerproduct %20, %20, %262 {kind = #vector.kind<mul>} : vector<5xf32>, vector<5xf32>
      %extracted_57 = tensor.extract %6[%c2] : tensor<4xi1>
      %264 = arith.andi %c22329_i16, %c22329_i16 : i16
      %265 = vector.splat %c4 : vector<4xindex>
      scf.if %false {
        %cast_59 = tensor.cast %reduced : tensor<13xf16> to tensor<?xf16>
        %275 = math.ceil %cst_4 : f16
        %276 = vector.broadcast %cst_1 : f32 to vector<5x5xf32>
        %277 = vector.outerproduct %20, %20, %276 {kind = #vector.kind<add>} : vector<5xf32>, vector<5xf32>
        %278 = math.log1p %7 : tensor<4xf32>
        %cast_60 = tensor.cast %17 : tensor<13x7xi32> to tensor<?x?xi32>
        %279 = math.roundeven %1 : tensor<4xf16>
        %cast_61 = tensor.cast %15 : tensor<13x7xf16> to tensor<?x?xf16>
        %280 = math.round %19 : tensor<13xf16>
      } else {
        %275 = vector.broadcast %cst_6 : f32 to vector<13x7xf32>
        %276 = arith.cmpi sle, %c1431144665_i64, %c1431144665_i64 : i64
        %277 = math.cttz %13 : tensor<13x7xi64>
        %false_59 = index.bool.constant false
        %278 = vector.multi_reduction <minf>, %30, %cst_6 [0] : vector<1xf32> to f32
        %279 = arith.cmpf one, %cst_1, %cst_2 : f32
        %280 = affine.apply affine_map<(d0, d1, d2) -> (d0 + 18)>(%c15, %c4, %c0)
        %281 = math.absf %7 : tensor<4xf32>
      }
      %266 = index.floordivs %c2, %c15
      %267 = index.maxs %c8, %c1
      %268 = arith.xori %c22329_i16, %c22329_i16 : i16
      %269 = math.exp2 %cst : f16
      %270 = math.log10 %cst_2 : f32
      %rank_58 = tensor.rank %11 : tensor<4xi16>
      %271 = bufferization.to_memref %17 : memref<13x7xi32>
      %272 = arith.divf %cst_4, %cst_5 : f16
      %273 = vector.shuffle %30, %20 [0, 1, 3, 4] : vector<1xf32>, vector<5xf32>
      %274 = vector.bitcast %30 : vector<1xf32> to vector<1xf32>
    }
    %41 = math.log1p %5 : tensor<5xf16>
    %42 = scf.index_switch %c13 -> vector<13x7xi16> 
    case 1 {
      %261 = math.ctlz %12 : tensor<13x7xi1>
      %262 = index.mul %c8, %c7
      %263 = math.fma %reduced, %reduced, %19 : tensor<13xf16>
      %264 = math.tanh %cst_6 : f32
      %265 = arith.ori %c1193460924_i64, %c1431144665_i64 : i64
      %266 = scf.index_switch %c0 -> i64 
      case 1 {
        %277 = vector.broadcast %false_24 : i1 to vector<13xi1>
        %278 = vector.maskedload %alloc_9[%c0], %277, %277 : memref<5xi1>, vector<13xi1>, vector<13xi1> into vector<13xi1>
        %cast_58 = tensor.cast %reduced : tensor<13xf16> to tensor<?xf16>
        %279 = index.floordivs %c1, %c7
        memref.store %cst_2, %alloc_16[%c3, %c0] : memref<13x7xf32>
        %280 = vector.insertelement %cst_1, %30[%c14 : index] : vector<1xf32>
        memref.store %c22329_i16, %alloc_18[%c1] : memref<5xi16>
        %281 = arith.divui %c1377814532_i32, %c1377814532_i32 : i32
        %282 = index.casts %rank : index to i32
        %283 = index.casts %false : i1 to index
        %284 = math.absf %reduced : tensor<13xf16>
        %285 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxf>} %30, %30, %cst_2 : vector<1xf32>, vector<1xf32> into f32
        %286 = arith.maxui %c1377814532_i32, %c1377814532_i32 : i32
        %287 = arith.cmpf ult, %cst_0, %cst_4 : f16
        %288 = arith.maxf %cst_6, %cst_1 : f32
        %289 = vector.insertelement %cst_6, %20[%c15 : index] : vector<5xf32>
        %290 = arith.divui %c22329_i16, %c22329_i16 : i16
        scf.yield %c1193460924_i64 : i64
      }
      default {
        %extracted_58 = tensor.extract %15[%c9, %c0] : tensor<13x7xf16>
        %277 = arith.maxsi %c1818536603_i64, %c1193460924_i64 : i64
        %278 = math.sqrt %cst_8 : f16
        %279 = arith.maxsi %c22329_i16, %c22329_i16 : i16
        %280 = math.absf %7 : tensor<4xf32>
        %cst_59 = arith.constant 4.057600e+04 : f16
        %281 = arith.divui %c22329_i16, %c22329_i16 : i16
        %from_elements_60 = tensor.from_elements %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16, %c22329_i16 : tensor<13x7xi16>
        %282 = arith.cmpi eq, %c22329_i16, %c22329_i16 : i16
        %283 = arith.mulf %cst_3, %cst : f16
        %284 = arith.shrui %c22329_i16, %c22329_i16 : i16
        %285 = math.round %cst : f16
        %extracted_61 = tensor.extract %14[%c3] : tensor<4xi64>
        %286 = arith.addf %cst_6, %cst_6 : f32
        %287 = math.ctlz %9 : tensor<7x4xi64>
        %288 = math.ctpop %14 : tensor<4xi64>
        scf.yield %c1431144665_i64 : i64
      }
      %267 = math.log1p %1 : tensor<4xf16>
      %268 = arith.maxsi %false_24, %false_7 : i1
      bufferization.dealloc_tensor %8 : tensor<5xi16>
      %269 = vector.broadcast %cst_2 : f32 to vector<1x1xf32>
      %270 = vector.outerproduct %30, %30, %269 {kind = #vector.kind<maxf>} : vector<1xf32>, vector<1xf32>
      %alloc_57 = memref.alloc() : memref<4xi16>
      %271 = index.casts %rank : index to i32
      %272 = arith.remf %cst, %cst_3 : f16
      %273 = bufferization.to_memref %7 : memref<4xf32>
      %274 = affine.for %arg2 = 0 to 108 iter_args(%arg3 = %false_24) -> (i1) {
        affine.yield %false_7 : i1
      }
      %275 = tensor.empty() : tensor<5xi16>
      %276 = vector.broadcast %c22329_i16 : i16 to vector<13x7xi16>
      scf.yield %276 : vector<13x7xi16>
    }
    case 2 {
      %extracted_57 = tensor.extract %10[%c0] : tensor<4xi16>
      %261 = index.maxu %c7, %c15
      %262 = index.floordivs %c4, %c7
      %263 = arith.maxui %false, %false : i1
      %264 = index.maxu %c8, %c0
      %265 = affine.if affine_set<(d0, d1) : ((((d1 + d0) floordiv 4) ceildiv 8) floordiv 16 == 0, (d1 + d0) * -64 >= 0, (d1 + d0) * 4 == 0)>(%c15, %c9) -> i64 {
        %277 = math.cttz %false : i1
        %rank_60 = tensor.rank %23 : tensor<i64>
        %278 = arith.addf %cst, %cst_8 : f16
        %true = index.bool.constant true
        %279 = arith.shrui %false_24, %false_24 : i1
        %280 = vector.matrix_multiply %30, %30 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xf32>, vector<1xf32>) -> vector<1xf32>
        %rank_61 = tensor.rank %0 : tensor<4xf32>
        %281 = math.tanh %5 : tensor<5xf16>
        affine.yield %c1818536603_i64 : i64
      } else {
        %extracted_60 = tensor.extract %transposed[%c3, %c5] : tensor<4x7xi16>
        %c0_i64 = arith.constant 0 : i64
        %c0_i64_61 = arith.constant 0 : i64
        %277 = vector.transfer_read %9[%c6, %rank], %c0_i64_61 {permutation_map = affine_map<(d0, d1) -> (d0)>} : tensor<7x4xi64>, vector<5xi64>
        %278 = arith.cmpf olt, %cst_4, %cst_4 : f16
        %279 = bufferization.to_memref %3 : memref<4xi32>
        %280 = arith.floordivsi %extracted_60, %c22329_i16 : i16
        %281 = arith.maxui %c1377814532_i32, %c1377814532_i32 : i32
        %282 = arith.remf %cst_0, %cst_5 : f16
        %rank_62 = tensor.rank %5 : tensor<5xf16>
        affine.yield %c1193460924_i64 : i64
      }
      %266 = math.log1p %15 : tensor<13x7xf16>
      %267 = arith.maxui %false, %false_24 : i1
      %268 = arith.maxui %extracted_57, %c22329_i16 : i16
      %269 = arith.divf %cst_3, %cst_4 : f16
      %270 = arith.addf %cst_3, %cst_0 : f16
      %271 = vector.flat_transpose %20 {columns = 5 : i32, rows = 1 : i32} : vector<5xf32> -> vector<5xf32>
      %collapsed_58 = tensor.collapse_shape %9 [[0, 1]] : tensor<7x4xi64> into tensor<28xi64>
      %alloc_59 = memref.alloc() : memref<4x4xi64>
      %272 = tensor.empty() : tensor<7x4xi64>
      %273 = linalg.matmul ins(%9, %alloc_59 : tensor<7x4xi64>, memref<4x4xi64>) outs(%272 : tensor<7x4xi64>) -> tensor<7x4xi64>
      %274 = math.ctpop %c22329_i16 : i16
      %275 = arith.minui %false_24, %false_24 : i1
      %276 = vector.broadcast %c22329_i16 : i16 to vector<13x7xi16>
      scf.yield %276 : vector<13x7xi16>
    }
    case 3 {
      %261 = arith.divsi %c1818536603_i64, %c1431144665_i64 : i64
      memref.store %cst_6, %alloc_17[%c0] : memref<5xf32>
      %262 = math.fma %cst_0, %cst, %cst : f16
      %263 = arith.remsi %c1818536603_i64, %c1431144665_i64 : i64
      %264 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<add>} %20, %20, %cst_2 : vector<5xf32>, vector<5xf32> into f32
      %265 = vector.broadcast %false_24 : i1 to vector<5x7xi1>
      %266 = vector.broadcast %false_7 : i1 to vector<5xi1>
      %dest_57, %accumulated_value_58 = vector.scan <mul>, %265, %266 {inclusive = false, reduction_dim = 1 : i64} : vector<5x7xi1>, vector<5xi1>
      %267 = arith.shrui %false_7, %false_7 : i1
      %268 = arith.muli %c22329_i16, %c22329_i16 : i16
      %269 = math.absf %0 : tensor<4xf32>
      %270 = arith.shrsi %c1431144665_i64, %c1818536603_i64 : i64
      %271 = arith.remsi %false, %false_24 : i1
      %c1_i16 = arith.constant 1 : i16
      %c0_i16 = arith.constant 0 : i16
      %272 = vector.transfer_read %11[%c15], %c0_i16 : tensor<4xi16>, vector<i16>
      %273 = arith.remsi %c1193460924_i64, %c1431144665_i64 : i64
      %274 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<mul>} %30, %30, %cst_6 : vector<1xf32>, vector<1xf32> into f32
      %275 = arith.maxf %cst_4, %cst_8 : f16
      scf.index_switch %c14 
      case 1 {
        %cst_59 = arith.constant 6.214400e+04 : f16
        %277 = math.log1p %cst_5 : f16
        %inserted_60 = tensor.insert %cst_6 into %0[%c2] : tensor<4xf32>
        %278 = tensor.empty() : tensor<7x4xf16>
        %279 = vector.broadcast %cst_3 : f16 to vector<13x7xf16>
        %280 = vector.broadcast %false_24 : i1 to vector<13x7xi1>
        %281 = vector.broadcast %c1377814532_i32 : i32 to vector<13x7xi32>
        %282 = vector.gather %278[%rank, %c11] [%281], %280, %279 : tensor<7x4xf16>, vector<13x7xi32>, vector<13x7xi1>, vector<13x7xf16> into vector<13x7xf16>
        %alloca_61 = memref.alloca() : memref<5xi1>
        %283 = vector.extract_strided_slice %280 {offsets = [9], sizes = [4], strides = [1]} : vector<13x7xi1> to vector<4x7xi1>
        memref.tensor_store %14, %alloc_13 : memref<4xi64>
        memref.store %false, %alloc_19[%c4, %c2] : memref<7x4xi1>
        %284 = vector.broadcast %cst_2 : f32 to vector<13x7xf32>
        %285 = vector.fma %284, %284, %284 : vector<13x7xf32>
        %286 = vector.broadcast %cst_8 : f16 to vector<7xf16>
        %dest_62, %accumulated_value_63 = vector.scan <minf>, %282, %286 {inclusive = true, reduction_dim = 0 : i64} : vector<13x7xf16>, vector<7xf16>
        %287 = vector.splat %c1193460924_i64 : vector<7x4xi64>
        %288 = vector.flat_transpose %20 {columns = 5 : i32, rows = 1 : i32} : vector<5xf32> -> vector<5xf32>
        %289 = arith.remsi %false_24, %false : i1
        bufferization.dealloc_tensor %13 : tensor<13x7xi64>
        %290 = arith.minui %c1377814532_i32, %c1377814532_i32 : i32
        %291 = arith.cmpf ugt, %cst_5, %cst_8 : f16
        scf.yield
      }
      default {
        %277 = vector.shuffle %30, %30 [1] : vector<1xf32>, vector<1xf32>
        %278 = vector.transpose %20, [0] : vector<5xf32> to vector<5xf32>
        %279 = arith.divui %false_7, %false_7 : i1
        %280 = index.maxu %c15, %c8
        %281 = index.ceildivu %c13, %c1
        %282 = memref.atomic_rmw maxu %c1_i16, %alloc_10[%c4, %c3] : (i16, memref<7x4xi16>) -> i16
        %283 = arith.negf %cst_0 : f16
        %284 = index.casts %c1431144665_i64 : i64 to index
        %285 = arith.shrsi %c22329_i16, %c1_i16 : i16
        %286 = arith.addi %false_24, %false_24 : i1
        %287 = vector.shuffle %30, %20 [0, 3, 4, 5] : vector<1xf32>, vector<5xf32>
        %288 = math.rsqrt %cst_1 : f32
        %289 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %30, %30, %cst_1 : vector<1xf32>, vector<1xf32> into f32
        %290 = math.log %cst : f16
        %291 = math.rsqrt %1 : tensor<4xf16>
        %292 = math.exp %1 : tensor<4xf16>
      }
      %276 = vector.broadcast %c1_i16 : i16 to vector<13x7xi16>
      scf.yield %276 : vector<13x7xi16>
    }
    default {
      %261 = affine.min affine_map<(d0, d1) -> (d0 + 32)>(%c12, %c13)
      %262 = scf.while (%arg2 = %alloc) : (memref<13x7xi16>) -> memref<13x7xi16> {
        %277 = arith.ceildivsi %c1377814532_i32, %c1377814532_i32 : i32
        %278 = arith.addf %cst_4, %cst_5 : f16
        %279 = arith.addi %c1431144665_i64, %c1818536603_i64 : i64
        %280 = bufferization.to_memref %12 : memref<13x7xi1>
        %281 = arith.maxui %c22329_i16, %c22329_i16 : i16
        %extracted_58 = tensor.extract %15[%c9, %c4] : tensor<13x7xf16>
        %282 = math.round %reduced : tensor<13xf16>
        %283 = vector.splat %c2 : vector<13x7xindex>
        scf.condition(%false) %arg2 : memref<13x7xi16>
      } do {
      ^bb0(%arg2: memref<13x7xi16>):
        %277 = index.mul %c8, %c9
        %278 = index.maxu %c4, %c14
        memref.tensor_store %14, %alloc_13 : memref<4xi64>
        %279 = vector.broadcast %false_7 : i1 to vector<7x4xi1>
        %280 = bufferization.to_memref %3 : memref<4xi32>
        %281 = math.absf %19 : tensor<13xf16>
        %282 = arith.remf %cst_6, %cst_2 : f32
        memref.store %c22329_i16, %alloc_12[%c2] : memref<4xi16>
        bufferization.dealloc_tensor %3 : tensor<4xi32>
        %283 = vector.load %alloc_9[%c4] : memref<5xi1>, vector<5xi1>
        %284 = arith.remf %cst_2, %cst_6 : f32
        %285 = arith.minui %c1818536603_i64, %c1818536603_i64 : i64
        %286 = vector.insertelement %cst_2, %30[%c14 : index] : vector<1xf32>
        %287 = vector.broadcast %false_7 : i1 to vector<4xi1>
        %dest_58, %accumulated_value_59 = vector.scan <and>, %279, %287 {inclusive = true, reduction_dim = 0 : i64} : vector<7x4xi1>, vector<4xi1>
        %288 = tensor.empty() : tensor<13x4xi64>
        %289 = linalg.matmul ins(%4, %9 : tensor<13x7xi64>, tensor<7x4xi64>) outs(%288 : tensor<13x4xi64>) -> tensor<13x4xi64>
        %false_60 = index.bool.constant false
        scf.yield %arg2 : memref<13x7xi16>
      }
      %263 = vector.extract %30[0] : vector<1xf32>
      %inserted_57 = tensor.insert %c1377814532_i32 into %3[%c0] : tensor<4xi32>
      %264 = math.cttz %false_24 : i1
      %265 = bufferization.to_memref %8 : memref<5xi16>
      %266 = arith.addf %cst, %cst_3 : f16
      %267 = scf.execute_region -> index {
        %from_elements_58 = tensor.from_elements %cst_2, %cst_1, %cst_6, %cst_1, %cst_2 : tensor<5xf32>
        affine.store %c22329_i16, %alloc_18[%c15] : memref<5xi16>
        %277 = math.cttz %false_24 : i1
        %278 = vector.transpose %20, [0] : vector<5xf32> to vector<5xf32>
        %279 = math.tanh %15 : tensor<13x7xf16>
        %280 = math.roundeven %cst_8 : f16
        %281 = arith.maxsi %c22329_i16, %c22329_i16 : i16
        %282 = math.ctpop %11 : tensor<4xi16>
        %283 = vector.broadcast %c22329_i16 : i16 to vector<13x7x5xi16>
        %284 = vector.broadcast %c22329_i16 : i16 to vector<13x7xi16>
        %dest_59, %accumulated_value_60 = vector.scan <or>, %283, %284 {inclusive = false, reduction_dim = 2 : i64} : vector<13x7x5xi16>, vector<13x7xi16>
        %285 = index.maxu %c2, %c6
        %286 = vector.broadcast %cst_3 : f16 to vector<4xf16>
        %287 = vector.insert %cst_1, %20 [4] : f32 into vector<5xf32>
        %288 = index.maxs %c6, %c14
        %289 = vector.broadcast %cst_1 : f32 to vector<f32>
        %290 = vector.transfer_write %289, %0[%288] : vector<f32>, tensor<4xf32>
        %291 = bufferization.to_memref %2 : memref<13x7xi32>
        %extracted_61 = tensor.extract %3[%c1] : tensor<4xi32>
        scf.yield %c0 : index
      }
      %268 = index.ceildivu %c3, %c13
      %269 = tensor.empty() : tensor<13x4xi64>
      %270 = linalg.matmul ins(%4, %9 : tensor<13x7xi64>, tensor<7x4xi64>) outs(%269 : tensor<13x4xi64>) -> tensor<13x4xi64>
      %271 = arith.cmpf oeq, %cst_1, %cst_6 : f32
      %272 = vector.flat_transpose %30 {columns = 1 : i32, rows = 1 : i32} : vector<1xf32> -> vector<1xf32>
      %273 = arith.maxui %c22329_i16, %c22329_i16 : i16
      %274 = math.ipowi %12, %12 : tensor<13x7xi1>
      %275 = bufferization.to_memref %0 : memref<4xf32>
      vector.print %20 : vector<5xf32>
      %276 = vector.broadcast %c22329_i16 : i16 to vector<13x7xi16>
      scf.yield %276 : vector<13x7xi16>
    }
    memref.tensor_store %10, %alloc_12 : memref<4xi16>
    %43 = scf.index_switch %c13 -> index 
    case 1 {
      %261 = vector.flat_transpose %30 {columns = 1 : i32, rows = 1 : i32} : vector<1xf32> -> vector<1xf32>
      %c1_i64 = arith.constant 1 : i64
      %262 = vector.transfer_read %14[%c14], %c1_i64 : tensor<4xi64>, vector<i64>
      %263 = index.mul %c8, %c10
      %264 = math.round %5 : tensor<5xf16>
      %265 = vector.broadcast %c1377814532_i32 : i32 to vector<i32>
      %266 = vector.transfer_write %265, %3[%c2] : vector<i32>, tensor<4xi32>
      %from_elements_57 = tensor.from_elements %c1377814532_i32, %c1377814532_i32, %c1377814532_i32, %c1377814532_i32 : tensor<4xi32>
      %267 = arith.addi %false, %false_7 : i1
      %268 = vector.broadcast %c22329_i16 : i16 to vector<i16>
      %269 = vector.transfer_write %268, %8[%c9] : vector<i16>, tensor<5xi16>
      %cst_58 = arith.constant 0x4CEC6711 : f32
      %alloc_59 = memref.alloc() : memref<7x4xf16>
      %270 = tensor.empty() : tensor<13x4xf16>
      %271 = linalg.matmul ins(%15, %alloc_59 : tensor<13x7xf16>, memref<7x4xf16>) outs(%270 : tensor<13x4xf16>) -> tensor<13x4xf16>
      %alloca_60 = memref.alloca() : memref<5xi1>
      %272 = math.ctpop %11 : tensor<4xi16>
      %extracted_61 = tensor.extract %6[%c0] : tensor<4xi1>
      %273 = vector.flat_transpose %20 {columns = 5 : i32, rows = 1 : i32} : vector<5xf32> -> vector<5xf32>
      %from_elements_62 = tensor.from_elements %cst_4, %cst_4, %cst, %cst_4 : tensor<4xf16>
      %274 = vector.broadcast %cst_1 : f32 to vector<4xf32>
      %275 = vector.broadcast %extracted_61 : i1 to vector<4xi1>
      %276 = vector.broadcast %c1377814532_i32 : i32 to vector<4xi32>
      %277 = vector.gather %alloc_17[%c6] [%276], %275, %274 : memref<5xf32>, vector<4xi32>, vector<4xi1>, vector<4xf32> into vector<4xf32>
      scf.yield %c4 : index
    }
    case 2 {
      %261 = index.divs %c7, %c14
      %262 = arith.minsi %c1431144665_i64, %c1193460924_i64 : i64
      %263 = tensor.empty() : tensor<13x13x13xf32>
      %264 = tensor.empty() : tensor<13xf32>
      %265 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%264, %264 : tensor<13xf32>, tensor<13xf32>) outs(%263 : tensor<13x13x13xf32>) {
      ^bb0(%in: f32, %in_61: f32, %out: f32):
        %rank_62 = tensor.rank %3 : tensor<4xi32>
        %281 = math.rsqrt %15 : tensor<13x7xf16>
        %282 = vector.broadcast %false_24 : i1 to vector<4xi1>
        %alloca_63 = memref.alloca() : memref<4xf16>
        %283 = index.mul %c8, %c7
        %284 = arith.minui %c1431144665_i64, %c1818536603_i64 : i64
        %285 = vector.splat %cst_0 : vector<7x4xf16>
        %286 = index.ceildivu %c3, %261
        %287 = arith.minsi %false_7, %false_7 : i1
        %288 = math.round %cst_4 : f16
        %289 = arith.shli %c1193460924_i64, %c1193460924_i64 : i64
        %290 = arith.minsi %c1377814532_i32, %c1377814532_i32 : i32
        %291 = math.exp %15 : tensor<13x7xf16>
        %292 = math.log %cst_1 : f32
        %293 = vector.splat %c1377814532_i32 : vector<4xi32>
        %294 = index.castu %false_7 : i1 to index
        %295 = affine.max affine_map<(d0, d1, d2, d3) -> (d1, -d3, d3 + 2)>(%c13, %c0, %286, %c15)
        %296 = arith.divsi %c1193460924_i64, %c1818536603_i64 : i64
        %297 = math.sqrt %15 : tensor<13x7xf16>
        %298 = arith.shrui %c1818536603_i64, %c1818536603_i64 : i64
        %299 = arith.shrui %false_24, %false_7 : i1
        %300 = vector.broadcast %c1431144665_i64 : i64 to vector<i64>
        %301 = vector.transfer_write %300, %4[%c3, %c12] : vector<i64>, tensor<13x7xi64>
        %302 = arith.minsi %false, %false : i1
        memref.store %c22329_i16, %alloc_10[%c6, %c2] : memref<7x4xi16>
        %303 = math.ceil %cst_8 : f16
        %304 = vector.broadcast %c22329_i16 : i16 to vector<13xi16>
        %305 = vector.broadcast %false_7 : i1 to vector<13xi1>
        %306 = vector.maskedload %alloc_10[%c2, %c3], %305, %304 : memref<7x4xi16>, vector<13xi1>, vector<13xi16> into vector<13xi16>
        %307 = math.fma %reduced, %19, %19 : tensor<13xf16>
        %308 = arith.remf %out, %cst_6 : f32
        %cast_64 = tensor.cast %0 : tensor<4xf32> to tensor<?xf32>
        %309 = index.mul %c15, %c8
        %310 = math.absi %c22329_i16 : i16
        %311 = math.exp2 %7 : tensor<4xf32>
        linalg.yield %in : f32
      } -> tensor<13x13x13xf32>
      %266 = tensor.empty() : tensor<13x13x13xf32>
      %alloc_57 = memref.alloc() : memref<13x13xf32>
      %alloc_58 = memref.alloc() : memref<13xf32>
      %267 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1)>, affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_57, %alloc_58, %alloc_57 : memref<13x13xf32>, memref<13xf32>, memref<13x13xf32>) outs(%266 : tensor<13x13x13xf32>) {
      ^bb0(%in: f32, %in_61: f32, %in_62: f32, %out: f32):
        %281 = vector.insert %out, %30 [0] : f32 into vector<1xf32>
        %282 = tensor.empty() : tensor<4xf16>
        %283 = math.roundeven %cst : f16
        %284 = arith.addf %cst_8, %cst_0 : f16
        %285 = math.round %5 : tensor<5xf16>
        %286 = index.floordivs %rank, %c6
        affine.store %c1193460924_i64, %alloc_13[%c13] : memref<4xi64>
        %cst_63 = arith.constant 1.000000e+00 : f16
        %cst_64 = arith.constant 0.000000e+00 : f16
        %287 = vector.transfer_read %19[%c0], %cst_64 : tensor<13xf16>, vector<f16>
        %288 = arith.remf %cst_3, %cst_3 : f16
        %289 = arith.minsi %c1193460924_i64, %c1431144665_i64 : i64
        %290 = vector.create_mask %c1, %rank : vector<7x4xi1>
        %291 = vector.splat %261 : vector<7x4xindex>
        %292 = vector.shuffle %30, %20 [1, 2, 3, 4, 5] : vector<1xf32>, vector<5xf32>
        %293 = arith.remf %cst_4, %cst_8 : f16
        %294 = vector.insert %cst_2, %20 [0] : f32 into vector<5xf32>
        %295 = arith.remf %cst_63, %cst_4 : f16
        %296 = index.divu %c15, %c6
        %297 = math.fma %19, %19, %reduced : tensor<13xf16>
        %rank_65 = tensor.rank %9 : tensor<7x4xi64>
        %298 = math.cos %cst_6 : f32
        %299 = arith.maxsi %c1431144665_i64, %c1818536603_i64 : i64
        %300 = arith.ori %c1193460924_i64, %c1193460924_i64 : i64
        %301 = math.log1p %0 : tensor<4xf32>
        %302 = math.ctpop %4 : tensor<13x7xi64>
        %303 = arith.divsi %c1193460924_i64, %c1818536603_i64 : i64
        %304 = vector.broadcast %false_7 : i1 to vector<4xi1>
        %dest_66, %accumulated_value_67 = vector.scan <xor>, %290, %304 {inclusive = true, reduction_dim = 0 : i64} : vector<7x4xi1>, vector<4xi1>
        %from_elements_68 = tensor.from_elements %c1193460924_i64, %c1818536603_i64, %c1431144665_i64, %c1431144665_i64, %c1818536603_i64 : tensor<5xi64>
        %305 = vector.broadcast %false_7 : i1 to vector<4xi1>
        %306 = arith.addf %cst_2, %cst_6 : f32
        memref.tensor_store %10, %alloc_12 : memref<4xi16>
        %307 = index.casts %c1193460924_i64 : i64 to index
        %false_69 = index.bool.constant false
        linalg.yield %in : f32
      } -> tensor<13x13x13xf32>
      %268 = math.log10 %7 : tensor<4xf32>
      %269 = math.copysign %7, %0 : tensor<4xf32>
      %270 = arith.subi %c1818536603_i64, %c1431144665_i64 : i64
      %271 = math.atan %7 : tensor<4xf32>
      %272 = scf.index_switch %c2 -> f32 
      case 1 {
        %281 = index.sizeof
        %282 = arith.remf %cst, %cst_3 : f16
        %283 = arith.cmpf false, %cst_5, %cst_4 : f16
        %284 = arith.shrui %c1377814532_i32, %c1377814532_i32 : i32
        %alloc_61 = memref.alloc() : memref<7x5xi32>
        %285 = tensor.empty() : tensor<13x5xi32>
        %286 = linalg.matmul ins(%2, %alloc_61 : tensor<13x7xi32>, memref<7x5xi32>) outs(%285 : tensor<13x5xi32>) -> tensor<13x5xi32>
        %287 = math.fpowi %0, %3 : tensor<4xf32>, tensor<4xi32>
        %288 = arith.maxui %c1193460924_i64, %c1193460924_i64 : i64
        %289 = math.log %7 : tensor<4xf32>
        %290 = arith.remsi %c22329_i16, %c22329_i16 : i16
        %291 = vector.broadcast %cst_1 : f32 to vector<f32>
        vector.transfer_write %291, %alloc_15[%c13, %c9] : vector<f32>, memref<7x4xf32>
        %292 = math.absf %15 : tensor<13x7xf16>
        %293 = math.round %cst_0 : f16
        %294 = math.rsqrt %19 : tensor<13xf16>
        %295 = arith.divui %c22329_i16, %c22329_i16 : i16
        %296 = vector.broadcast %cst_0 : f16 to vector<7x4xf16>
        %297 = vector.splat %c1431144665_i64 : vector<5xi64>
        scf.yield %cst_1 : f32
      }
      case 2 {
        %281 = arith.maxui %false_24, %false_7 : i1
        %false_61 = index.bool.constant false
        %282 = arith.maxui %c1818536603_i64, %c1818536603_i64 : i64
        vector.print %20 : vector<5xf32>
        %283 = bufferization.to_memref %3 : memref<4xi32>
        %284 = math.floor %7 : tensor<4xf32>
        %285 = math.log2 %15 : tensor<13x7xf16>
        %alloc_62 = memref.alloc() : memref<13x7xi1>
        memref.tensor_store %12, %alloc_62 : memref<13x7xi1>
        %286 = arith.minui %c1377814532_i32, %c1377814532_i32 : i32
        %collapsed_63 = tensor.collapse_shape %12 [[0, 1]] : tensor<13x7xi1> into tensor<91xi1>
        %287 = index.maxu %c7, %rank
        %288 = math.absf %1 : tensor<4xf16>
        %289 = index.divs %c12, %c15
        %expanded = tensor.expand_shape %13 [[0], [1, 2]] : tensor<13x7xi64> into tensor<13x7x1xi64>
        %290 = vector.create_mask %287, %c5 : vector<13x7xi1>
        %291 = tensor.empty(%c8) : tensor<?xf32>
        scf.yield %cst_6 : f32
      }
      case 3 {
        %281 = arith.minui %false_7, %false_7 : i1
        %282 = arith.xori %false_24, %false : i1
        %283 = math.tanh %5 : tensor<5xf16>
        %284 = arith.divui %c22329_i16, %c22329_i16 : i16
        %285 = vector.broadcast %c2 : index to vector<4xindex>
        %286 = vector.broadcast %false_24 : i1 to vector<4xi1>
        %287 = vector.broadcast %c1818536603_i64 : i64 to vector<4xi64>
        vector.scatter %alloc_13[%c1] [%285], %286, %287 : memref<4xi64>, vector<4xindex>, vector<4xi1>, vector<4xi64>
        affine.store %c22329_i16, %alloc_10[%c12, %c15] : memref<7x4xi16>
        %288 = affine.apply affine_map<(d0, d1, d2, d3) -> (d3 + d2 * 8)>(%c14, %c4, %c2, %c4)
        %289 = arith.divsi %false_7, %false_24 : i1
        %290 = vector.broadcast %c1818536603_i64 : i64 to vector<4xi64>
        %291 = vector.broadcast %false : i1 to vector<4xi1>
        %292 = vector.broadcast %c1377814532_i32 : i32 to vector<4xi32>
        %293 = vector.gather %14[%c9] [%292], %291, %290 : tensor<4xi64>, vector<4xi32>, vector<4xi1>, vector<4xi64> into vector<4xi64>
        %294 = index.ceildivu %c3, %c10
        %295 = index.floordivs %294, %c8
        %296 = arith.minui %c1377814532_i32, %c1377814532_i32 : i32
        affine.store %cst_4, %alloc_14[%c4] : memref<4xf16>
        %297 = arith.maxui %c1431144665_i64, %c1818536603_i64 : i64
        affine.store %c22329_i16, %alloc_12[%c10] : memref<4xi16>
        %298 = bufferization.to_tensor %alloc : memref<13x7xi16>
        scf.yield %cst_6 : f32
      }
      case 4 {
        %281 = vector.create_mask %c4, %c13 : vector<7x4xi1>
        %collapsed_61 = tensor.collapse_shape %4 [[0, 1]] : tensor<13x7xi64> into tensor<91xi64>
        %282 = arith.negf %cst_4 : f16
        %283 = math.absi %14 : tensor<4xi64>
        %284 = math.atan %1 : tensor<4xf16>
        %285 = math.floor %cst_0 : f16
        %286 = arith.cmpf ugt, %cst_3, %cst_4 : f16
        %287 = arith.minsi %c22329_i16, %c22329_i16 : i16
        %288 = math.ctpop %14 : tensor<4xi64>
        %289 = vector.matrix_multiply %30, %30 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xf32>, vector<1xf32>) -> vector<1xf32>
        %290 = vector.shuffle %20, %289 [1, 2, 3, 5] : vector<5xf32>, vector<1xf32>
        %291 = bufferization.clone %alloc_16 : memref<13x7xf32> to memref<13x7xf32>
        %292 = math.fma %cst_2, %cst_1, %cst_2 : f32
        %293 = arith.maxui %c1431144665_i64, %c1193460924_i64 : i64
        %294 = vector.broadcast %c1377814532_i32 : i32 to vector<i32>
        %295 = vector.transfer_write %294, %3[%c10] : vector<i32>, tensor<4xi32>
        %296 = math.atan %5 : tensor<5xf16>
        scf.yield %cst_6 : f32
      }
      default {
        %281 = vector.broadcast %cst_4 : f16 to vector<13x7xf16>
        %282 = vector.broadcast %false_24 : i1 to vector<13x7xi1>
        %283 = vector.broadcast %c1377814532_i32 : i32 to vector<13x7xi32>
        %284 = vector.gather %1[%c10] [%283], %282, %281 : tensor<4xf16>, vector<13x7xi32>, vector<13x7xi1>, vector<13x7xf16> into vector<13x7xf16>
        %285 = math.fma %cst_8, %cst_0, %cst_0 : f16
        %286 = vector.insertelement %cst_2, %30[%c7 : index] : vector<1xf32>
        %287 = arith.ceildivsi %false_24, %false_24 : i1
        %288 = arith.minsi %c1818536603_i64, %c1431144665_i64 : i64
        %289 = arith.maxf %cst_2, %cst_1 : f32
        %c1326614191_i32 = arith.constant 1326614191 : i32
        %290 = arith.addf %cst_2, %cst_2 : f32
        %291 = arith.remf %cst_2, %cst_6 : f32
        %292 = math.ceil %reduced : tensor<13xf16>
        %293 = arith.addf %cst_0, %cst_0 : f16
        %294 = arith.minui %false, %false : i1
        %295 = arith.xori %c22329_i16, %c22329_i16 : i16
        %296 = index.ceildivs %c15, %c7
        %297 = arith.cmpi sge, %c1431144665_i64, %c1193460924_i64 : i64
        %298 = vector.insertelement %cst_2, %20[%c11 : index] : vector<5xf32>
        scf.yield %cst_6 : f32
      }
      %273 = math.expm1 %cst_6 : f32
      %274 = math.cttz %false : i1
      %275 = math.tanh %cst_2 : f32
      %276 = vector.broadcast %false : i1 to vector<5x5xi1>
      %277 = vector.broadcast %false : i1 to vector<5xi1>
      %dest_59, %accumulated_value_60 = vector.scan <minui>, %276, %277 {inclusive = false, reduction_dim = 1 : i64} : vector<5x5xi1>, vector<5xi1>
      %278 = arith.negf %cst_0 : f16
      %279 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %20, %20, %cst_6 : vector<5xf32>, vector<5xf32> into f32
      %280 = arith.floordivsi %c1431144665_i64, %c1193460924_i64 : i64
      scf.yield %c4 : index
    }
    case 3 {
      %261 = arith.addi %c1818536603_i64, %c1431144665_i64 : i64
      %262 = arith.maxui %c1818536603_i64, %c1193460924_i64 : i64
      %263 = arith.cmpf une, %cst_5, %cst_3 : f16
      %264 = arith.minui %false_7, %false : i1
      %265 = math.absf %cst_6 : f32
      %alloc_57 = memref.alloc() : memref<7x5xi16>
      %266 = tensor.empty() : tensor<4x5xi16>
      %267 = linalg.matmul ins(%transposed, %alloc_57 : tensor<4x7xi16>, memref<7x5xi16>) outs(%266 : tensor<4x5xi16>) -> tensor<4x5xi16>
      %268 = arith.minsi %c1431144665_i64, %c1193460924_i64 : i64
      %269 = affine.if affine_set<(d0, d1, d2, d3) : (d0 + 2 == 0, 64 == 0, d2 floordiv 128 >= 0)>(%c0, %c7, %c1, %c5) -> i16 {
        %274 = tensor.empty() : tensor<5xf16>
        %275 = arith.minsi %c1431144665_i64, %c1818536603_i64 : i64
        %collapsed_59 = tensor.collapse_shape %15 [[0, 1]] : tensor<13x7xf16> into tensor<91xf16>
        %276 = math.rsqrt %5 : tensor<5xf16>
        %277 = math.fma %cst_0, %cst_3, %cst_5 : f16
        %278 = math.log1p %7 : tensor<4xf32>
        %279 = vector.matrix_multiply %20, %30 {lhs_columns = 1 : i32, lhs_rows = 5 : i32, rhs_columns = 1 : i32} : (vector<5xf32>, vector<1xf32>) -> vector<5xf32>
        %280 = vector.extract_strided_slice %30 {offsets = [0], sizes = [1], strides = [1]} : vector<1xf32> to vector<1xf32>
        affine.yield %c22329_i16 : i16
      } else {
        %274 = vector.broadcast %false_7 : i1 to vector<4x13xi1>
        %275 = vector.broadcast %false_7 : i1 to vector<4xi1>
        %dest_59, %accumulated_value_60 = vector.scan <minui>, %274, %275 {inclusive = true, reduction_dim = 1 : i64} : vector<4x13xi1>, vector<4xi1>
        %276 = arith.xori %c1377814532_i32, %c1377814532_i32 : i32
        %277 = math.floor %1 : tensor<4xf16>
        %278 = arith.remsi %false, %false_24 : i1
        %279 = index.maxs %c12, %c14
        %280 = arith.maxui %c1431144665_i64, %c1431144665_i64 : i64
