module {
  func.func @func1(%arg0: i16, %arg1: index, %arg2: vector<5xf16>) -> memref<5xi1> {
    %cst = arith.constant 1.59910515E+9 : f32
    %c1291372147_i32 = arith.constant 1291372147 : i32
    %cst_0 = arith.constant 0x4C260DF5 : f32
    %c614625657_i32 = arith.constant 614625657 : i32
    %false = arith.constant false
    %false_1 = arith.constant false
    %cst_2 = arith.constant 1.1763063E+9 : f32
    %c8837_i16 = arith.constant 8837 : i16
    %c1750124934_i64 = arith.constant 1750124934 : i64
    %c1777150014_i32 = arith.constant 1777150014 : i32
    %c304038688_i64 = arith.constant 304038688 : i64
    %cst_3 = arith.constant 1.851200e+04 : f16
    %cst_4 = arith.constant 2.163200e+04 : f16
    %false_5 = arith.constant false
    %cst_6 = arith.constant 0x4E21C5F7 : f32
    %c342629357_i32 = arith.constant 342629357 : i32
    %0 = tensor.empty() : tensor<2x12x15xi1>
    %1 = tensor.empty() : tensor<2xi1>
    %2 = tensor.empty() : tensor<5xi64>
    %3 = tensor.empty() : tensor<15xi16>
    %4 = tensor.empty() : tensor<15xi32>
    %5 = tensor.empty() : tensor<5xi64>
    %6 = tensor.empty() : tensor<5xi16>
    %7 = tensor.empty() : tensor<15xi1>
    %8 = tensor.empty() : tensor<2x12x15xi64>
    %9 = tensor.empty() : tensor<2xi32>
    %10 = tensor.empty() : tensor<5xi64>
    %11 = tensor.empty() : tensor<15xi64>
    %12 = tensor.empty() : tensor<15xi16>
    %13 = tensor.empty() : tensor<5xi16>
    %14 = tensor.empty() : tensor<15xi64>
    %15 = tensor.empty() : tensor<15xi64>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<2xf32>
    %alloc_7 = memref.alloc() : memref<5xi16>
    %alloc_8 = memref.alloc() : memref<2xf16>
    %alloc_9 = memref.alloc() : memref<2xi16>
    %alloc_10 = memref.alloc() : memref<2x12x15xi64>
    %alloc_11 = memref.alloc() : memref<2xf32>
    %alloc_12 = memref.alloc() : memref<2x12x15xf32>
    %alloc_13 = memref.alloc() : memref<5xf32>
    %alloc_14 = memref.alloc() : memref<15xf32>
    %alloc_15 = memref.alloc() : memref<2x12x15xi16>
    %alloc_16 = memref.alloc() : memref<15xi16>
    %alloc_17 = memref.alloc() : memref<2xi16>
    %alloc_18 = memref.alloc() : memref<5xf16>
    %alloc_19 = memref.alloc() : memref<5xi64>
    %alloc_20 = memref.alloc() : memref<2xf32>
    %alloc_21 = memref.alloc() : memref<2x12x15xf16>
    %16 = tensor.empty() : tensor<15xi64>
    %17 = linalg.copy ins(%15 : tensor<15xi64>) outs(%16 : tensor<15xi64>) -> tensor<15xi64>
    %18 = tensor.empty() : tensor<15xi1>
    %transposed = linalg.transpose ins(%7 : tensor<15xi1>) outs(%18 : tensor<15xi1>) permutation = [0] 
    %19 = tensor.empty() : tensor<i64>
    %reduced = linalg.reduce ins(%5 : tensor<5xi64>) outs(%19 : tensor<i64>) dimensions = [0] 
      (%in: i64, %init: i64) {
        %261 = index.maxs %c8, %c0
        %262 = math.rsqrt %cst_6 : f32
        %263 = arith.divui %init, %c1750124934_i64 : i64
        %alloca_46 = memref.alloca() : memref<2xi64>
        %264 = arith.minf %cst_2, %cst_6 : f32
        %265 = bufferization.to_memref %4 : memref<15xi32>
        %266 = math.absi %7 : tensor<15xi1>
        %267 = tensor.empty() : tensor<2xi32>
        %c0_i64 = arith.constant 0 : i64
        linalg.yield %c0_i64 : i64
      }
    scf.parallel (%arg3) = (%c8) to (%c5) step (%c5) {
      %261 = math.fma %cst_0, %cst_2, %cst_6 : f32
      %262 = vector.broadcast %cst_0 : f32 to vector<f32>
      %263 = vector.insertelement %cst_2, %262[] : vector<f32>
      %264 = vector.broadcast %c1 : index to vector<12xindex>
      %265 = vector.broadcast %false : i1 to vector<12xi1>
      %266 = vector.broadcast %cst_2 : f32 to vector<12xf32>
      vector.scatter %alloc_13[%c1] [%264], %265, %266 : memref<5xf32>, vector<12xindex>, vector<12xi1>, vector<12xf32>
      %267 = math.log1p %cst_0 : f32
      vector.print %262 : vector<f32>
      memref.assume_alignment %alloc_11, 2 : memref<2xf32>
      %268 = arith.divf %cst_6, %cst : f32
      %269 = vector.splat %c3 : vector<5xindex>
      %270 = affine.for %arg4 = 0 to 3 iter_args(%arg5 = %c1) -> (index) {
        affine.yield %c15 : index
      }
      %splat_46 = tensor.splat %cst_0 : tensor<5xf32>
      %271 = arith.negf %cst_0 : f32
      %272 = bufferization.clone %alloc_10 : memref<2x12x15xi64> to memref<2x12x15xi64>
      %273 = vector.broadcast %c304038688_i64 : i64 to vector<1xi64>
      %274 = vector.extract %273[0] : vector<1xi64>
      %275 = arith.andi %c614625657_i32, %c342629357_i32 : i32
      %276 = vector.flat_transpose %273 {columns = 1 : i32, rows = 1 : i32} : vector<1xi64> -> vector<1xi64>
      %277 = affine.apply affine_map<(d0) -> (d0 + d0 floordiv 128 - d0 floordiv 128)>(%c8)
      scf.yield
    }
    %20 = affine.vector_load %alloc_21[%c5, %c0, %c1] : memref<2x12x15xf16>, vector<12xf16>
    affine.vector_store %20, %alloc_8[%c15] : memref<2xf16>, vector<12xf16>
    %alloc_22 = memref.alloc() : memref<15xi64>
    %21 = tensor.empty() : tensor<i64>
    %22 = linalg.dot ins(%14, %alloc_22 : tensor<15xi64>, memref<15xi64>) outs(%21 : tensor<i64>) -> tensor<i64>
    %23 = vector.splat %c3 : vector<15xindex>
    %24 = vector.shuffle %20, %20 [3, 5, 7, 8, 9, 12, 14, 15, 16, 17, 20, 22] : vector<12xf16>, vector<12xf16>
    %25 = bufferization.clone %alloc : memref<2xf32> to memref<2xf32>
    memref.assume_alignment %alloc_17, 2 : memref<2xi16>
    %26 = math.cos %cst_3 : f16
    %27 = arith.divf %cst_3, %cst_4 : f16
    %28 = index.divs %c14, %c10
    %29 = bufferization.to_memref %21 : memref<i64>
    %30 = memref.realloc %alloc_8 : memref<2xf16> to memref<5xf16>
    %31 = tensor.empty() : tensor<2xi16>
    %32 = vector.broadcast %c8837_i16 : i16 to vector<2xi16>
    %33 = vector.broadcast %false : i1 to vector<2xi1>
    %34 = vector.broadcast %c1777150014_i32 : i32 to vector<2xi32>
    %35 = vector.gather %31[%c9] [%34], %33, %32 : tensor<2xi16>, vector<2xi32>, vector<2xi1>, vector<2xi16> into vector<2xi16>
    %36 = math.round %cst_2 : f32
    %37 = math.atan2 %cst_0, %cst : f32
    %38 = arith.ori %c304038688_i64, %c304038688_i64 : i64
    %39 = math.fpowi %cst_6, %c1777150014_i32 : f32, i32
    %40 = math.powf %cst_2, %cst_0 : f32
    %41 = arith.minf %cst_0, %cst : f32
    %42 = vector.create_mask %c8 : vector<5xi1>
    %43 = arith.minui %false_1, %false_5 : i1
    %44 = math.ceil %cst_3 : f16
    %45 = arith.xori %c614625657_i32, %c1291372147_i32 : i32
    %46 = index.sizeof
    %collapsed = tensor.collapse_shape %8 [[0, 1], [2]] : tensor<2x12x15xi64> into tensor<24x15xi64>
    %47 = vector.load %alloc_20[%c0] : memref<2xf32>, vector<15xf32>
    %48 = math.atan %cst_6 : f32
    %49 = math.round %cst : f32
    %50 = arith.addf %cst_2, %cst_2 : f32
    %51 = arith.negf %cst : f32
    %cast = tensor.cast %2 : tensor<5xi64> to tensor<?xi64>
    vector.print %42 : vector<5xi1>
    affine.store %cst_2, %alloc[%c14] : memref<2xf32>
    %52 = arith.shrui %c1777150014_i32, %c1777150014_i32 : i32
    %53 = arith.shrui %c614625657_i32, %c1777150014_i32 : i32
    %54 = arith.muli %c342629357_i32, %c1777150014_i32 : i32
    %55 = math.atan %cst : f32
    %cst_23 = arith.constant 4.137600e+04 : f16
    %56 = math.ceil %cst : f32
    %57 = vector.insert %cst_0, %47 [3] : f32 into vector<15xf32>
    %58 = math.ipowi %14, %14 : tensor<15xi64>
    %59 = tensor.empty() : tensor<5xf32>
    %60 = vector.broadcast %cst_6 : f32 to vector<2xf32>
    %61 = vector.gather %59[%c10] [%34], %33, %60 : tensor<5xf32>, vector<2xi32>, vector<2xi1>, vector<2xf32> into vector<2xf32>
    %62 = affine.for %arg3 = 0 to 4 iter_args(%arg4 = %12) -> (tensor<15xi16>) {
      affine.yield %12 : tensor<15xi16>
    }
    %63 = index.mul %46, %c4
    memref.alloca_scope  {
      %261 = memref.load %alloc_18[%c4] : memref<5xf16>
      %false_46 = index.bool.constant false
      %262 = scf.while (%arg3 = %42) : (vector<5xi1>) -> vector<5xi1> {
        %289 = index.sub %28, %63
        %splat_51 = tensor.splat %c1777150014_i32 : tensor<5xi32>
        memref.store %cst_6, %alloc_13[%c2] : memref<5xf32>
        %290 = index.sub %c10, %28
        %splat_52 = tensor.splat %c614625657_i32 : tensor<5xi32>
        %291 = index.ceildivs %c1, %c7
        %292 = affine.load %alloc_12[%c4, %c5, %c14] : memref<2x12x15xf32>
        %293 = arith.minf %cst_6, %cst_6 : f32
        scf.condition(%false_46) %42 : vector<5xi1>
      } do {
      ^bb0(%arg3: vector<5xi1>):
        %289 = arith.muli %false, %false_1 : i1
        %290 = index.divs %c8, %c15
        %291 = vector.load %alloc_9[%c1] : memref<2xi16>, vector<2xi16>
        %292 = memref.load %alloc_22[%c8] : memref<15xi64>
        %293 = bufferization.to_memref %transposed : memref<15xi1>
        %294 = arith.maxsi %c1750124934_i64, %c1750124934_i64 : i64
        %295 = math.round %59 : tensor<5xf32>
        %296 = math.sqrt %cst_3 : f16
        %297 = math.atan2 %cst_6, %cst_2 : f32
        %298 = math.expm1 %cst_3 : f16
        %299 = math.ipowi %reduced, %19 : tensor<i64>
        %300 = arith.ori %c304038688_i64, %c1750124934_i64 : i64
        %301 = vector.splat %c304038688_i64 : vector<5xi64>
        %splat_51 = tensor.splat %false_5 : tensor<5xi1>
        %302 = arith.divf %cst, %cst : f32
        %alloc_52 = memref.alloc() : memref<2x12x15xi1>
        scf.yield %42 : vector<5xi1>
      }
      %263 = index.casts %c1777150014_i32 : i32 to index
      %from_elements_47 = tensor.from_elements %c304038688_i64, %c1750124934_i64 : tensor<2xi64>
      %264 = vector.splat %c11 : vector<15xindex>
      scf.index_switch %c5 
      case 1 {
        %289 = bufferization.to_memref %6 : memref<5xi16>
        memref.store %cst_2, %25[%c1] : memref<2xf32>
        %290 = vector.load %alloc[%c1] : memref<2xf32>, vector<15xf32>
        %291 = arith.negf %cst_4 : f16
        %292 = vector.insert %c1291372147_i32, %34 [0] : i32 into vector<2xi32>
        %293 = math.copysign %cst_3, %cst_4 : f16
        %294 = arith.ori %c8837_i16, %c8837_i16 : i16
        %295 = math.log %cst_4 : f16
        %296 = vector.insertelement %cst_2, %61[%c1 : index] : vector<2xf32>
        %297 = arith.negf %cst : f32
        %alloca_51 = memref.alloca() : memref<2x12x15xi32>
        %298 = arith.maxsi %c342629357_i32, %c614625657_i32 : i32
        %299 = arith.remsi %false_1, %false_46 : i1
        %300 = memref.realloc %alloc_22 : memref<15xi64> to memref<12xi64>
        %301 = memref.realloc %alloc_16 : memref<15xi16> to memref<15xi16>
        %302 = index.ceildivu %46, %263
        scf.yield
      }
      default {
        %289 = math.log %cst_2 : f32
        %290 = math.round %59 : tensor<5xf32>
        %291 = tensor.empty(%c7) : tensor<2x?x15xi16>
        %292 = vector.shuffle %32, %32 [2] : vector<2xi16>, vector<2xi16>
        %splat_51 = tensor.splat %false_1 : tensor<2xi1>
        %splat_52 = tensor.splat %c1291372147_i32 : tensor<5xi32>
        %293 = index.mul %c2, %28
        %294 = vector.broadcast %c8837_i16 : i16 to vector<i16>
        %295 = vector.transfer_write %294, %13[%c0] : vector<i16>, tensor<5xi16>
        %splat_53 = tensor.splat %cst_2 : tensor<2xf32>
        %296 = vector.insert %cst, %47 [11] : f32 into vector<15xf32>
        memref.store %c8837_i16, %alloc_16[%c7] : memref<15xi16>
        %297 = tensor.empty() : tensor<15xi16>
        %cast_54 = tensor.cast %11 : tensor<15xi64> to tensor<?xi64>
        %298 = arith.muli %c1777150014_i32, %c1777150014_i32 : i32
        %299 = math.absf %cst_2 : f32
        %300 = math.exp2 %cst_0 : f32
      }
      %265 = arith.minui %false_46, %false_46 : i1
      %266 = vector.matrix_multiply %32, %32 {lhs_columns = 2 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<2xi16>, vector<2xi16>) -> vector<1xi16>
      %267 = math.powf %cst_0, %cst_6 : f32
      %268 = arith.muli %c342629357_i32, %c1291372147_i32 : i32
      %269 = memref.load %alloc_11[%c1] : memref<2xf32>
      %270 = math.round %59 : tensor<5xf32>
      %271 = arith.maxsi %c1750124934_i64, %c304038688_i64 : i64
      %272 = memref.realloc %25 : memref<2xf32> to memref<12xf32>
      %cast_48 = tensor.cast %3 : tensor<15xi16> to tensor<?xi16>
      %273 = math.atan2 %cst_4, %cst_4 : f16
      %274 = math.powf %cst_3, %cst_4 : f16
      %275 = index.maxs %c2, %c0
      %276 = tensor.empty(%c15) : tensor<?xf32>
      %277 = index.maxs %275, %c15
      %collapsed_49 = tensor.collapse_shape %0 [[0, 1], [2]] : tensor<2x12x15xi1> into tensor<24x15xi1>
      %278 = index.divu %c10, %c6
      %cast_50 = tensor.cast %reduced : tensor<i64> to tensor<i64>
      %279 = vector.broadcast %c11 : index to vector<15xindex>
      %280 = vector.broadcast %false_5 : i1 to vector<15xi1>
      %281 = vector.broadcast %cst_4 : f16 to vector<15xf16>
      vector.scatter %alloc_18[%c3] [%279], %280, %281 : memref<5xf16>, vector<15xindex>, vector<15xi1>, vector<15xf16>
      %282 = math.atan %cst_2 : f32
      %283 = bufferization.clone %alloc_9 : memref<2xi16> to memref<2xi16>
      %284 = index.casts %c8 : index to i32
      %285 = math.round %cst_3 : f16
      %286 = tensor.empty(%c12) : tensor<?xi32>
      %287 = bufferization.clone %alloc_11 : memref<2xf32> to memref<2xf32>
      %288 = memref.atomic_rmw mins %c8837_i16, %alloc_9[%c1] : (i16, memref<2xi16>) -> i16
    }
    %64 = arith.cmpf ugt, %cst_2, %cst_0 : f32
    %65 = memref.alloca_scope  -> (i32) {
      %261 = index.sizeof
      %splat_46 = tensor.splat %c342629357_i32 : tensor<15xi32>
      %262 = vector.extract %35[0] : vector<2xi16>
      %263 = math.atan %cst_3 : f16
      %264 = arith.ceildivsi %c1750124934_i64, %c304038688_i64 : i64
      memref.assume_alignment %alloc, 4 : memref<2xf32>
      bufferization.dealloc_tensor %8 : tensor<2x12x15xi64>
      %265 = math.atan %cst_3 : f16
      %alloc_47 = memref.alloc() : memref<5xf16>
      %266 = math.fma %cst_0, %cst, %cst_6 : f32
      affine.for %arg3 = 0 to 6 {
      }
      %267 = arith.muli %c1750124934_i64, %c304038688_i64 : i64
      %268 = arith.minf %cst_6, %cst_0 : f32
      %269 = arith.minsi %false_5, %false_5 : i1
      %270 = scf.index_switch %c15 -> index 
      case 1 {
        %288 = arith.minui %false_1, %false_5 : i1
        %289 = arith.divsi %c1750124934_i64, %c304038688_i64 : i64
        %290 = memref.atomic_rmw mulf %cst_2, %alloc[%c1] : (f32, memref<2xf32>) -> f32
        %291 = index.ceildivs %28, %c11
        %292 = index.ceildivs %c6, %28
        %293 = math.copysign %59, %59 : tensor<5xf32>
        %294 = math.exp %59 : tensor<5xf32>
        %295 = math.fma %cst_3, %cst_4, %cst_3 : f16
        memref.store %c1750124934_i64, %29[] : memref<i64>
        %296 = math.ipowi %5, %2 : tensor<5xi64>
        %297 = arith.divf %cst_4, %cst_3 : f16
        %298 = vector.transpose %32, [0] : vector<2xi16> to vector<2xi16>
        %299 = arith.divui %c1291372147_i32, %c1777150014_i32 : i32
        %300 = index.sizeof
        %301 = arith.shli %c342629357_i32, %c1291372147_i32 : i32
        %302 = arith.shrui %false_1, %false_5 : i1
        scf.yield %63 : index
      }
      case 2 {
        %288 = arith.cmpi ule, %c342629357_i32, %c1777150014_i32 : i32
        %289 = math.tanh %cst_4 : f16
        %290 = math.fma %59, %59, %59 : tensor<5xf32>
        %291 = math.cos %cst_3 : f16
        %292 = index.add %63, %c9
        %293 = math.rsqrt %cst_0 : f32
        %cst_49 = arith.constant 1.77533939E+9 : f32
        %294 = arith.remsi %false, %false : i1
        %295 = math.rsqrt %cst : f32
        %296 = math.log1p %cst_4 : f16
        %297 = arith.muli %false_5, %false_1 : i1
        %298 = affine.apply affine_map<(d0) -> (d0 ceildiv 32)>(%c4)
        %cast_50 = tensor.cast %22 : tensor<i64> to tensor<i64>
        %299 = arith.cmpi sle, %c1291372147_i32, %c1291372147_i32 : i32
        %300 = math.atan %cst_2 : f32
        %301 = index.divs %46, %c10
        scf.yield %c14 : index
      }
      default {
        %288 = vector.transpose %35, [0] : vector<2xi16> to vector<2xi16>
        %289 = bufferization.to_tensor %alloc_22 : memref<15xi64>
        %290 = index.ceildivs %c12, %c3
        %291 = math.atan %cst_4 : f16
        %292 = arith.cmpi sge, %false, %false_1 : i1
        %293 = index.divu %c9, %c15
        %294 = vector.shuffle %60, %47 [0, 1, 2, 4, 10, 11, 12, 13, 14] : vector<2xf32>, vector<15xf32>
        %295 = arith.minf %cst_2, %cst_2 : f32
        %296 = math.floor %cst_4 : f16
        %297 = math.expm1 %cst_4 : f16
        %298 = affine.load %25[%c7] : memref<2xf32>
        %299 = tensor.empty() : tensor<15xi32>
        %300 = arith.remsi %c1750124934_i64, %c1750124934_i64 : i64
        %301 = vector.transpose %61, [0] : vector<2xf32> to vector<2xf32>
        %302 = math.rsqrt %cst : f32
        %303 = vector.flat_transpose %42 {columns = 5 : i32, rows = 1 : i32} : vector<5xi1> -> vector<5xi1>
        scf.yield %c1 : index
      }
      %271 = memref.realloc %alloc_16 : memref<15xi16> to memref<2xi16>
      %cast_48 = tensor.cast %0 : tensor<2x12x15xi1> to tensor<?x?x?xi1>
      %272 = tensor.empty() : tensor<15xf16>
      %273 = vector.broadcast %cst_4 : f16 to vector<15xf16>
      %274 = vector.broadcast %false : i1 to vector<15xi1>
      %275 = vector.broadcast %c342629357_i32 : i32 to vector<15xi32>
      %276 = vector.gather %272[%c5] [%275], %274, %273 : tensor<15xf16>, vector<15xi32>, vector<15xi1>, vector<15xf16> into vector<15xf16>
      %277 = vector.flat_transpose %35 {columns = 1 : i32, rows = 2 : i32} : vector<2xi16> -> vector<2xi16>
      %278 = math.expm1 %cst_4 : f16
      %279 = arith.shrsi %false_5, %false : i1
      affine.for %arg3 = 0 to 24 {
      }
      %280 = arith.negf %cst_3 : f16
      memref.alloca_scope  {
        %288 = index.ceildivs %c6, %c8
        %289 = arith.andi %c614625657_i32, %c1777150014_i32 : i32
        %290 = index.ceildivs %261, %c14
        %291 = vector.insertelement %cst_3, %276[%c12 : index] : vector<15xf16>
        %292 = vector.load %alloc_12[%c0, %c3, %c5] : memref<2x12x15xf32>, vector<2xf32>
        %c1_i64 = arith.constant 1 : i64
        %c0_i64 = arith.constant 0 : i64
        %293 = vector.transfer_read %8[%c3, %c6, %c10], %c0_i64 {permutation_map = affine_map<(d0, d1, d2) -> (0)>} : tensor<2x12x15xi64>, vector<15xi64>
        %294 = index.casts %false_5 : i1 to index
        %295 = vector.insert %cst_4, %273 [11] : f16 into vector<15xf16>
        %296 = math.round %cst_0 : f32
        %297 = arith.divf %cst_2, %cst_0 : f32
        %298 = affine.load %alloc_21[%c12, %c2, %c3] : memref<2x12x15xf16>
        %299 = arith.ori %c1777150014_i32, %c1291372147_i32 : i32
        %300 = math.expm1 %cst_4 : f16
        %301 = vector.load %25[%c1] : memref<2xf32>, vector<15xf32>
        %302 = bufferization.to_tensor %alloc_7 : memref<5xi16>
        %303 = arith.subi %false, %false : i1
        %splat_49 = tensor.splat %cst_0 : tensor<2xf32>
        %304 = math.tanh %cst_0 : f32
        %305 = arith.negf %cst_6 : f32
        %306 = index.divu %c14, %c15
        %307 = arith.cmpf oeq, %cst, %cst : f32
        %308 = arith.negf %cst_6 : f32
        %309 = bufferization.clone %alloc_14 : memref<15xf32> to memref<15xf32>
        %310 = math.fpowi %298, %c1777150014_i32 : f16, i32
        %311 = math.floor %59 : tensor<5xf32>
        %312 = vector.extract %33[1] : vector<2xi1>
        %313 = math.copysign %272, %272 : tensor<15xf16>
        %314 = arith.addi %false_5, %false : i1
        memref.copy %alloc_20, %alloc_11 : memref<2xf32> to memref<2xf32>
        %315 = arith.shli %c1777150014_i32, %c342629357_i32 : i32
        %alloc_50 = memref.alloc() : memref<15x15xi64>
        %316 = tensor.empty() : tensor<24x15xi64>
        %317 = linalg.matmul ins(%collapsed, %alloc_50 : tensor<24x15xi64>, memref<15x15xi64>) outs(%316 : tensor<24x15xi64>) -> tensor<24x15xi64>
        %318 = index.ceildivs %c14, %c4
      }
      %281 = arith.cmpf true, %cst, %cst_6 : f32
      %282 = vector.transpose %34, [0] : vector<2xi32> to vector<2xi32>
      %283 = bufferization.to_tensor %alloc_12 : memref<2x12x15xf32>
      %284 = arith.remf %cst_0, %cst_2 : f32
      %285 = arith.cmpi sle, %c342629357_i32, %c1777150014_i32 : i32
      %286 = scf.index_switch %63 -> vector<5xf16> 
      case 1 {
        %288 = index.sizeof
        %289 = index.sizeof
        %290 = arith.maxsi %c1291372147_i32, %c342629357_i32 : i32
        %291 = vector.insertelement %cst_0, %47[%c4 : index] : vector<15xf32>
        %292 = math.cos %cst_6 : f32
        %rank_49 = tensor.rank %1 : tensor<2xi1>
        %293 = vector.transpose %277, [0] : vector<2xi16> to vector<2xi16>
        %294 = arith.maxsi %c1750124934_i64, %c304038688_i64 : i64
        %295 = arith.divui %c1750124934_i64, %c304038688_i64 : i64
        %296 = affine.load %alloc_21[%c5, %c2, %c13] : memref<2x12x15xf16>
        %297 = arith.shrsi %c614625657_i32, %c342629357_i32 : i32
        %298 = arith.minf %296, %296 : f16
        %299 = math.absf %cst_4 : f16
        %300 = math.exp %cst_2 : f32
        %c1_i64 = arith.constant 1 : i64
        %301 = vector.transfer_read %collapsed[%c1, %c9], %c1_i64 : tensor<24x15xi64>, vector<15xi64>
        %302 = index.maxs %c15, %c11
        %303 = vector.broadcast %cst_4 : f16 to vector<5xf16>
        scf.yield %303 : vector<5xf16>
      }
      default {
        %288 = math.expm1 %cst_3 : f16
        %289 = math.round %59 : tensor<5xf32>
        %290 = arith.ori %c1777150014_i32, %c342629357_i32 : i32
        %291 = vector.extract_strided_slice %274 {offsets = [10], sizes = [1], strides = [1]} : vector<15xi1> to vector<1xi1>
        %292 = vector.create_mask %46, %c1, %c5 : vector<2x12x15xi1>
        %293 = math.tanh %cst_4 : f16
        %294 = arith.divsi %false_1, %false_5 : i1
        %295 = math.exp2 %cst_4 : f16
        %296 = bufferization.to_memref %2 : memref<5xi64>
        %297 = arith.cmpi ne, %c1291372147_i32, %c1777150014_i32 : i32
        vector.print %35 : vector<2xi16>
        %298 = index.ceildivs %c8, %c13
        affine.store %c8837_i16, %alloc_7[%c7] : memref<5xi16>
        %299 = arith.divsi %c8837_i16, %c8837_i16 : i16
        %300 = math.ceil %272 : tensor<15xf16>
        %301 = math.sqrt %272 : tensor<15xf16>
        %302 = vector.broadcast %cst_3 : f16 to vector<5xf16>
        scf.yield %302 : vector<5xf16>
      }
      %287 = vector.extract %61[1] : vector<2xf32>
      memref.assume_alignment %alloc_21, 8 : memref<2x12x15xf16>
      memref.alloca_scope.return %c342629357_i32 : i32
    }
    %66 = math.log10 %cst_4 : f16
    %67 = math.log10 %cst_4 : f16
    %68 = vector.splat %false_1 : vector<15xi1>
    memref.assume_alignment %alloc_8, 4 : memref<2xf16>
    %69 = vector.broadcast %cst : f32 to vector<5xf32>
    vector.transfer_write %69, %alloc_12[%c2, %c6, %c5] {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : vector<5xf32>, memref<2x12x15xf32>
    %70 = vector.extract %20[9] : vector<12xf16>
    %71 = math.ctlz %false : i1
    %72 = vector.extract %32[0] : vector<2xi16>
    %73 = vector.load %25[%c0] : memref<2xf32>, vector<15xf32>
    %74 = affine.apply affine_map<(d0, d1, d2, d3) -> (d1 + d2 - d0)>(%c4, %c8, %c11, %c5)
    %75 = arith.divsi %c614625657_i32, %65 : i32
    %76 = vector.extract_strided_slice %61 {offsets = [0], sizes = [2], strides = [1]} : vector<2xf32> to vector<2xf32>
    %77 = index.maxu %74, %c15
    %true = arith.constant true
    %false_24 = arith.constant false
    %78 = vector.transfer_read %1[%c6], %false_24 : tensor<2xi1>, vector<i1>
    %79 = vector.insertelement %cst_6, %60[%74 : index] : vector<2xf32>
    %80 = math.atan %cst : f32
    %81 = arith.subi %c1291372147_i32, %65 : i32
    %82 = arith.shrsi %c342629357_i32, %c1777150014_i32 : i32
    %83 = arith.xori %c614625657_i32, %65 : i32
    %84 = arith.negf %cst_2 : f32
    %85 = arith.minf %cst_2, %cst_6 : f32
    %86 = vector.insert %true, %33 [1] : i1 into vector<2xi1>
    %87 = bufferization.to_tensor %alloc_15 : memref<2x12x15xi16>
    %88 = arith.divf %cst, %cst_2 : f32
    %89 = math.exp2 %cst_3 : f16
    %90 = affine.apply affine_map<(d0, d1) -> ((d1 mod 16) floordiv 32)>(%74, %c10)
    %collapsed_25 = tensor.collapse_shape %collapsed [[0, 1]] : tensor<24x15xi64> into tensor<360xi64>
    %91 = vector.load %alloc_20[%c1] : memref<2xf32>, vector<2xf32>
    memref.alloca_scope  {
      %261 = affine.max affine_map<(d0) -> (-(d0 + 64))>(%c0)
      %262 = arith.ori %c304038688_i64, %c304038688_i64 : i64
      %generated = tensor.generate %c2 {
      ^bb0(%arg3: index):
        %286 = vector.transpose %42, [0] : vector<5xi1> to vector<5xi1>
        %287 = math.tanh %cst : f32
        %288 = index.ceildivs %74, %c7
        %289 = vector.create_mask %c14 : vector<5xi1>
        tensor.yield %cst_3 : f16
      } : tensor<?xf16>
      %263 = math.fma %cst_6, %cst_2, %cst_0 : f32
      %264 = math.atan %cst_0 : f32
      %collapsed_46 = tensor.collapse_shape %0 [[0, 1], [2]] : tensor<2x12x15xi1> into tensor<24x15xi1>
      %c1_i64 = arith.constant 1 : i64
      %265 = vector.transfer_read %2[%c3], %c1_i64 : tensor<5xi64>, vector<i64>
      %alloc_47 = memref.alloc() : memref<12xi64>
      %alloc_48 = memref.alloc() : memref<15x12xi64>
      %266 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_47, %alloc_48 : memref<12xi64>, memref<15x12xi64>) outs(%8 : tensor<2x12x15xi64>) {
      ^bb0(%in: i64, %in_53: i64, %out: i64):
        %286 = vector.transpose %60, [0] : vector<2xf32> to vector<2xf32>
        %287 = affine.load %alloc_10[%c10, %c14, %c5] : memref<2x12x15xi64>
        %collapsed_54 = tensor.collapse_shape %0 [[0, 1], [2]] : tensor<2x12x15xi1> into tensor<24x15xi1>
        %288 = vector.broadcast %c1750124934_i64 : i64 to vector<i64>
        %289 = vector.transfer_write %288, %2[%c15] : vector<i64>, tensor<5xi64>
        %290 = index.ceildivu %c11, %c7
        %from_elements_55 = tensor.from_elements %c1291372147_i32, %c342629357_i32, %c1291372147_i32, %c1777150014_i32, %c614625657_i32, %c1777150014_i32, %65, %c614625657_i32, %c1291372147_i32, %c1777150014_i32, %c342629357_i32, %c342629357_i32, %c1777150014_i32, %c614625657_i32, %c1291372147_i32, %65, %c614625657_i32, %c1291372147_i32, %c614625657_i32, %c342629357_i32, %65, %c1291372147_i32, %c342629357_i32, %c1777150014_i32, %c1777150014_i32, %c342629357_i32, %c342629357_i32, %c1777150014_i32, %c1777150014_i32, %c342629357_i32, %c614625657_i32, %c1777150014_i32, %65, %c1291372147_i32, %65, %65, %c1777150014_i32, %c1291372147_i32, %c342629357_i32, %c342629357_i32, %c1291372147_i32, %c614625657_i32, %c1777150014_i32, %c614625657_i32, %c1291372147_i32, %65, %c1777150014_i32, %c614625657_i32, %c342629357_i32, %65, %c1291372147_i32, %65, %c614625657_i32, %c1291372147_i32, %c1291372147_i32, %c1291372147_i32, %65, %65, %c342629357_i32, %65, %c614625657_i32, %c614625657_i32, %c614625657_i32, %65, %c1291372147_i32, %65, %c1291372147_i32, %65, %c614625657_i32, %c1291372147_i32, %c1777150014_i32, %65, %c1291372147_i32, %c614625657_i32, %c1291372147_i32, %65, %65, %c342629357_i32, %65, %c1291372147_i32, %c1777150014_i32, %c614625657_i32, %c1777150014_i32, %c1291372147_i32, %65, %c1291372147_i32, %c614625657_i32, %c1777150014_i32, %65, %c1777150014_i32, %c1291372147_i32, %c614625657_i32, %c1291372147_i32, %c1291372147_i32, %c342629357_i32, %65, %c342629357_i32, %c1777150014_i32, %c342629357_i32, %c1291372147_i32, %c342629357_i32, %c1291372147_i32, %c1777150014_i32, %65, %c614625657_i32, %c1291372147_i32, %c1777150014_i32, %c1291372147_i32, %c1777150014_i32, %c342629357_i32, %c1291372147_i32, %c1291372147_i32, %c342629357_i32, %c614625657_i32, %c614625657_i32, %c1777150014_i32, %c342629357_i32, %c1291372147_i32, %c1777150014_i32, %c614625657_i32, %65, %c614625657_i32, %65, %c1291372147_i32, %c1291372147_i32, %c1777150014_i32, %c1291372147_i32, %c614625657_i32, %65, %65, %c1777150014_i32, %c1777150014_i32, %c1291372147_i32, %c1777150014_i32, %65, %c614625657_i32, %c1291372147_i32, %c614625657_i32, %c1291372147_i32, %c1777150014_i32, %65, %65, %c614625657_i32, %c1291372147_i32, %c614625657_i32, %c1291372147_i32, %c342629357_i32, %65, %c1777150014_i32, %c1777150014_i32, %c1291372147_i32, %65, %c1291372147_i32, %c614625657_i32, %65, %c1777150014_i32, %c1291372147_i32, %c1291372147_i32, %c1291372147_i32, %c342629357_i32, %65, %c1291372147_i32, %c1291372147_i32, %c1291372147_i32, %c1777150014_i32, %c1291372147_i32, %c342629357_i32, %65, %c1777150014_i32, %c342629357_i32, %c614625657_i32, %65, %c342629357_i32, %65, %c1777150014_i32, %c1777150014_i32, %c1777150014_i32, %c614625657_i32, %c1777150014_i32, %c1291372147_i32, %c1291372147_i32, %65, %c1777150014_i32, %c614625657_i32, %c342629357_i32, %65, %c614625657_i32, %c1291372147_i32, %c342629357_i32, %65, %c1777150014_i32, %c614625657_i32, %c614625657_i32, %c1777150014_i32, %c1777150014_i32, %c1777150014_i32, %c1291372147_i32, %c614625657_i32, %c342629357_i32, %c1777150014_i32, %c342629357_i32, %c1777150014_i32, %c1291372147_i32, %c614625657_i32, %c614625657_i32, %c342629357_i32, %c1777150014_i32, %c342629357_i32, %c1291372147_i32, %65, %c1777150014_i32, %c1291372147_i32, %c614625657_i32, %c1291372147_i32, %c1291372147_i32, %c1777150014_i32, %65, %c1291372147_i32, %c342629357_i32, %65, %c342629357_i32, %c1777150014_i32, %65, %c614625657_i32, %c614625657_i32, %c342629357_i32, %c342629357_i32, %c1291372147_i32, %c614625657_i32, %c1291372147_i32, %c1777150014_i32, %c1291372147_i32, %c1777150014_i32, %c614625657_i32, %c1777150014_i32, %65, %c1291372147_i32, %c1291372147_i32, %c614625657_i32, %c1777150014_i32, %c614625657_i32, %c614625657_i32, %65, %c342629357_i32, %c1291372147_i32, %c614625657_i32, %c1291372147_i32, %c1291372147_i32, %c1291372147_i32, %c614625657_i32, %c1291372147_i32, %c342629357_i32, %c614625657_i32, %65, %c342629357_i32, %c1777150014_i32, %c342629357_i32, %c342629357_i32, %c1291372147_i32, %c614625657_i32, %65, %c342629357_i32, %c1777150014_i32, %65, %c1291372147_i32, %c1291372147_i32, %c1777150014_i32, %c614625657_i32, %c342629357_i32, %65, %c1777150014_i32, %c1291372147_i32, %c342629357_i32, %65, %c614625657_i32, %c1777150014_i32, %c1291372147_i32, %65, %65, %c1777150014_i32, %c614625657_i32, %c1291372147_i32, %c1291372147_i32, %c342629357_i32, %c342629357_i32, %c1291372147_i32, %c614625657_i32, %c614625657_i32, %c342629357_i32, %c614625657_i32, %c614625657_i32, %c342629357_i32, %65, %c614625657_i32, %65, %c1291372147_i32, %c614625657_i32, %c614625657_i32, %65, %c614625657_i32, %c614625657_i32, %c1777150014_i32, %c342629357_i32, %c1291372147_i32, %65, %65, %c1291372147_i32, %65, %c1777150014_i32, %c342629357_i32, %c1777150014_i32, %c1291372147_i32, %65, %c614625657_i32, %c1777150014_i32, %c614625657_i32, %c614625657_i32, %c614625657_i32, %c1291372147_i32, %c342629357_i32, %c342629357_i32, %c1291372147_i32, %c614625657_i32, %c342629357_i32, %c614625657_i32, %c614625657_i32, %65, %65, %c1777150014_i32, %c614625657_i32, %c1777150014_i32, %c1291372147_i32, %c1777150014_i32, %c614625657_i32, %c614625657_i32, %c1291372147_i32, %c1291372147_i32, %c614625657_i32, %c342629357_i32, %c342629357_i32, %c342629357_i32, %c1291372147_i32, %c1777150014_i32, %c1777150014_i32, %65, %65, %c342629357_i32, %c1777150014_i32, %c342629357_i32, %c342629357_i32, %c1777150014_i32, %c1777150014_i32, %c614625657_i32, %c342629357_i32, %c1777150014_i32, %65, %65, %c614625657_i32, %c614625657_i32, %c1777150014_i32 : tensor<2x12x15xi32>
        %291 = arith.shrui %287, %in_53 : i64
        %from_elements_56 = tensor.from_elements %out, %c1_i64, %c304038688_i64, %287, %c1750124934_i64, %c1750124934_i64, %287, %287, %c304038688_i64, %in, %c1_i64, %in, %c304038688_i64, %c304038688_i64, %c304038688_i64 : tensor<15xi64>
        %292 = vector.load %alloc_10[%c1, %c9, %c8] : memref<2x12x15xi64>, vector<2x12x15xi64>
        memref.assume_alignment %alloc_21, 4 : memref<2x12x15xf16>
        %293 = math.round %cst_2 : f32
        %294 = arith.minf %cst_4, %cst_3 : f16
        %295 = arith.maxsi %false_1, %false : i1
        %296 = vector.broadcast %c11 : index to vector<2xindex>
        vector.scatter %alloc_14[%c1] [%296], %33, %61 : memref<15xf32>, vector<2xindex>, vector<2xi1>, vector<2xf32>
        %297 = arith.remsi %in_53, %out : i64
        %298 = arith.subi %false_1, %false_1 : i1
        %299 = index.sizeof
        %300 = math.powf %cst_3, %cst_3 : f16
        %from_elements_57 = tensor.from_elements %true, %false_1, %false_1, %false, %true : tensor<5xi1>
        %301 = math.ipowi %7, %18 : tensor<15xi1>
        %302 = arith.divsi %c304038688_i64, %287 : i64
        %303 = index.divs %c3, %90
        %304 = math.ipowi %3, %12 : tensor<15xi16>
        %305 = index.mul %c0, %c6
        %306 = math.powf %59, %59 : tensor<5xf32>
        %307 = arith.divf %cst_4, %cst_4 : f16
        %308 = index.sizeof
        %alloc_58 = memref.alloc() : memref<2x12x15xf32>
        %309 = arith.divf %cst_4, %cst_3 : f16
        %310 = math.rsqrt %cst_2 : f32
        %311 = math.copysign %cst_3, %cst_4 : f16
        %312 = arith.muli %c1_i64, %c1750124934_i64 : i64
        linalg.yield %in_53 : i64
      } -> tensor<2x12x15xi64>
      %267 = scf.if %true -> (memref<2x12x15xi1>) {
        %286 = arith.divui %c8837_i16, %c8837_i16 : i16
        %287 = bufferization.clone %alloc_7 : memref<5xi16> to memref<5xi16>
        %288 = arith.andi %c342629357_i32, %65 : i32
        %289 = math.tan %cst_2 : f32
        %290 = vector.broadcast %28 : index to vector<5xindex>
        %291 = vector.broadcast %c8837_i16 : i16 to vector<5xi16>
        vector.scatter %alloc_16[%c10] [%290], %42, %291 : memref<15xi16>, vector<5xindex>, vector<5xi1>, vector<5xi16>
        %292 = math.absi %c1750124934_i64 : i64
        %293 = vector.flat_transpose %34 {columns = 1 : i32, rows = 2 : i32} : vector<2xi32> -> vector<2xi32>
        %294 = memref.atomic_rmw mulf %cst_0, %alloc_20[%c0] : (f32, memref<2xf32>) -> f32
        %alloc_53 = memref.alloc() : memref<2x12x15xi1>
        scf.yield %alloc_53 : memref<2x12x15xi1>
      } else {
        %286 = vector.transpose %61, [0] : vector<2xf32> to vector<2xf32>
        %287 = memref.load %alloc_13[%c0] : memref<5xf32>
        %288 = math.absi %c1777150014_i32 : i32
        %289 = math.ipowi %8, %8 : tensor<2x12x15xi64>
        %290 = math.round %cst_3 : f16
        %291 = math.ipowi %31, %31 : tensor<2xi16>
        %292 = vector.insert %c1291372147_i32, %34 [1] : i32 into vector<2xi32>
        %293 = vector.shuffle %73, %47 [0, 1, 2, 4, 7, 9, 10, 13, 18, 19, 21, 22, 23, 24, 25, 27] : vector<15xf32>, vector<15xf32>
        %alloc_53 = memref.alloc() : memref<2x12x15xi1>
        scf.yield %alloc_53 : memref<2x12x15xi1>
      }
      %268 = index.ceildivu %46, %c10
      %269 = arith.subi %false_5, %false : i1
      scf.index_switch %90 
      case 1 {
        %286 = math.log10 %cst_3 : f16
        %287 = arith.muli %false_1, %false_5 : i1
        %288 = index.casts %63 : index to i32
        %289 = math.fma %cst_4, %cst_3, %cst_3 : f16
        %290 = index.sub %c15, %c5
        %splat_53 = tensor.splat %cst_6 : tensor<15xf32>
        %291 = index.divu %46, %c15
        %292 = vector.extract %42[2] : vector<5xi1>
        %293 = math.sqrt %cst : f32
        vector.print %35 : vector<2xi16>
        %294 = math.ipowi %1, %1 : tensor<2xi1>
        %295 = math.cos %cst_2 : f32
        %296 = math.tanh %cst_2 : f32
        %297 = arith.cmpi uge, %true, %false_5 : i1
        vector.print %47 : vector<15xf32>
        %298 = arith.shrsi %c1777150014_i32, %65 : i32
        scf.yield
      }
      default {
        %286 = math.fma %59, %59, %59 : tensor<5xf32>
        %287 = arith.shli %c1_i64, %c1_i64 : i64
        %288 = arith.divf %cst_6, %cst_0 : f32
        %289 = arith.ori %c614625657_i32, %c1291372147_i32 : i32
        %c0_i64_53 = arith.constant 0 : i64
        %c0_i64_54 = arith.constant 0 : i64
        %290 = vector.transfer_read %15[%c5], %c0_i64_54 : tensor<15xi64>, vector<i64>
        %291 = bufferization.to_memref %1 : memref<2xi1>
        %292 = math.roundeven %cst_2 : f32
        vector.print %32 : vector<2xi16>
        %293 = vector.flat_transpose %91 {columns = 1 : i32, rows = 2 : i32} : vector<2xf32> -> vector<2xf32>
        %294 = arith.shrsi %true, %false_1 : i1
        %295 = arith.remsi %false_1, %false : i1
        %cst_55 = arith.constant 1.15384461E+9 : f32
        %296 = arith.divsi %c1750124934_i64, %c1_i64 : i64
        %297 = arith.cmpi ne, %c1291372147_i32, %65 : i32
        %298 = math.round %cst_3 : f16
        %299 = index.maxu %74, %77
      }
      %270 = memref.alloca_scope  -> (memref<5xi32>) {
        %286 = index.maxu %c11, %46
        memref.store %cst_3, %alloc_18[%c0] : memref<5xf16>
        %287 = arith.shrsi %c1750124934_i64, %c304038688_i64 : i64
        %from_elements_53 = tensor.from_elements %false_1, %false_1 : tensor<2xi1>
        %288 = math.powf %cst_4, %cst_4 : f16
        %289 = arith.subi %c8837_i16, %c8837_i16 : i16
        %290 = index.divu %c13, %46
        %collapsed_54 = tensor.collapse_shape %8 [[0, 1], [2]] : tensor<2x12x15xi64> into tensor<24x15xi64>
        %291 = arith.muli %c1750124934_i64, %c304038688_i64 : i64
        %292 = memref.atomic_rmw assign %cst_2, %alloc_14[%c2] : (f32, memref<15xf32>) -> f32
        %293 = arith.cmpi sgt, %c614625657_i32, %c1291372147_i32 : i32
        %from_elements_55 = tensor.from_elements %c1_i64, %c304038688_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1_i64, %c304038688_i64, %c1_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c1_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1_i64, %c1_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c304038688_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c304038688_i64, %c304038688_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1750124934_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c304038688_i64, %c1750124934_i64, %c1750124934_i64, %c304038688_i64, %c304038688_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c1_i64, %c1_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c1_i64, %c304038688_i64, %c304038688_i64, %c1_i64, %c1_i64, %c1_i64, %c1750124934_i64, %c304038688_i64, %c1750124934_i64 : tensor<2x12x15xi64>
        %294 = math.exp2 %cst_4 : f16
        %295 = vector.splat %c13 : vector<15xindex>
        %296 = memref.realloc %alloc_7 : memref<5xi16> to memref<15xi16>
        %297 = arith.negf %cst_0 : f32
        %298 = math.log10 %cst_2 : f32
        %299 = arith.divui %c1_i64, %c1750124934_i64 : i64
        %300 = affine.load %alloc_22[%c2] : memref<15xi64>
        %301 = vector.broadcast %cst_4 : f16 to vector<12x12xf16>
        %302 = vector.outerproduct %20, %20, %301 {kind = #vector.kind<mul>} : vector<12xf16>, vector<12xf16>
        %303 = math.exp2 %cst : f32
        %rank_56 = tensor.rank %3 : tensor<15xi16>
        %304 = vector.broadcast %c304038688_i64 : i64 to vector<12xi64>
        %305 = vector.broadcast %false_5 : i1 to vector<12xi1>
        %306 = vector.maskedload %29[], %305, %304 : memref<i64>, vector<12xi1>, vector<12xi64> into vector<12xi64>
        %307 = arith.divsi %c1777150014_i32, %c342629357_i32 : i32
        memref.copy %alloc_17, %alloc_9 : memref<2xi16> to memref<2xi16>
        %alloc_57 = memref.alloc() : memref<5xi64>
        memref.copy %alloc_19, %alloc_57 : memref<5xi64> to memref<5xi64>
        %308 = index.casts %c304038688_i64 : i64 to index
        %309 = arith.cmpf uno, %cst_2, %cst_6 : f32
        %splat_58 = tensor.splat %c1750124934_i64 : tensor<15xi64>
        %310 = index.mul %c8, %261
        %311 = bufferization.clone %alloc_14 : memref<15xf32> to memref<15xf32>
        %312 = arith.divui %true, %false_1 : i1
        %alloc_59 = memref.alloc() : memref<5xi32>
        memref.alloca_scope.return %alloc_59 : memref<5xi32>
      }
      %alloc_49 = memref.alloc() : memref<2x12x15xf16>
      memref.copy %alloc_21, %alloc_49 : memref<2x12x15xf16> to memref<2x12x15xf16>
      %271 = math.tan %59 : tensor<5xf32>
      %272 = math.copysign %59, %59 : tensor<5xf32>
      %273 = arith.ceildivsi %true, %true : i1
      %c0_i64 = arith.constant 0 : i64
      %c0_i64_50 = arith.constant 0 : i64
      %274 = vector.transfer_read %10[%268], %c0_i64_50 : tensor<5xi64>, vector<i64>
      %275 = vector.transpose %33, [0] : vector<2xi1> to vector<2xi1>
      %276 = index.mul %c5, %90
      %277 = index.ceildivu %90, %268
      %278 = index.sizeof
      %279 = bufferization.to_tensor %alloc : memref<2xf32>
      %280 = memref.alloca_scope  -> (memref<15xf32>) {
        %286 = arith.ori %false_1, %false_1 : i1
        %287 = index.sizeof
        %288 = tensor.empty() : tensor<15x15xi1>
        %289 = tensor.empty() : tensor<24x15xi1>
        %290 = linalg.matmul ins(%collapsed_46, %288 : tensor<24x15xi1>, tensor<15x15xi1>) outs(%289 : tensor<24x15xi1>) -> tensor<24x15xi1>
        %291 = math.round %cst_3 : f16
        %292 = memref.atomic_rmw minf %cst_4, %alloc_18[%c2] : (f16, memref<5xf16>) -> f16
        %293 = bufferization.clone %alloc_21 : memref<2x12x15xf16> to memref<2x12x15xf16>
        %294 = vector.shuffle %60, %60 [0, 1, 2] : vector<2xf32>, vector<2xf32>
        %295 = math.floor %cst_4 : f16
        %296 = math.exp2 %cst_0 : f32
        %297 = math.expm1 %cst_3 : f16
        %298 = index.casts %c12 : index to i32
        %299 = arith.remsi %c1291372147_i32, %c1291372147_i32 : i32
        vector.print %60 : vector<2xf32>
        %300 = math.atan %279 : tensor<2xf32>
        %301 = vector.transpose %76, [0] : vector<2xf32> to vector<2xf32>
        %302 = math.fma %cst_4, %cst_4, %cst_3 : f16
        %303 = arith.subi %c0_i64, %c0_i64 : i64
        %304 = index.sizeof
        %305 = affine.apply affine_map<(d0, d1, d2, d3) -> (d1 * -2 - 1)>(%c0, %c15, %304, %c1)
        %306 = math.cttz %4 : tensor<15xi32>
        %307 = vector.extract_strided_slice %73 {offsets = [7], sizes = [2], strides = [1]} : vector<15xf32> to vector<2xf32>
        %308 = vector.extract_strided_slice %33 {offsets = [0], sizes = [2], strides = [1]} : vector<2xi1> to vector<2xi1>
        %309 = vector.broadcast %c8 : index to vector<15xindex>
        %310 = vector.broadcast %false_5 : i1 to vector<15xi1>
        vector.scatter %alloc_13[%c3] [%309], %310, %47 : memref<5xf32>, vector<15xindex>, vector<15xi1>, vector<15xf32>
        %311 = vector.reduction <mul>, %76 : vector<2xf32> into f32
        %312 = index.divu %28, %c12
        %313 = arith.addi %c1777150014_i32, %c1291372147_i32 : i32
        %314 = arith.divui %true, %false : i1
        %315 = math.copysign %cst_3, %cst_4 : f16
        %splat_53 = tensor.splat %cst_6 : tensor<5xf32>
        %alloc_54 = memref.alloc() : memref<5xi64>
        memref.copy %alloc_19, %alloc_54 : memref<5xi64> to memref<5xi64>
        %316 = memref.load %25[%c0] : memref<2xf32>
        %317 = arith.remsi %c8837_i16, %c8837_i16 : i16
        memref.alloca_scope.return %alloc_14 : memref<15xf32>
      }
      %281 = index.add %c3, %c6
      %282 = math.log10 %cst : f32
      %283 = arith.divf %cst_0, %cst_6 : f32
      %cast_51 = tensor.cast %11 : tensor<15xi64> to tensor<?xi64>
      scf.if %false {
        %286 = arith.divf %cst_4, %cst_3 : f16
        %287 = arith.andi %c8837_i16, %c8837_i16 : i16
        %288 = vector.flat_transpose %20 {columns = 3 : i32, rows = 4 : i32} : vector<12xf16> -> vector<12xf16>
        %289 = arith.remsi %c1_i64, %c1750124934_i64 : i64
        %290 = arith.mulf %cst_4, %cst_3 : f16
        %291 = index.mul %c4, %c1
        %292 = math.powf %cst_4, %cst_4 : f16
        %293 = vector.create_mask %276 : vector<5xi1>
      } else {
        %286 = math.rsqrt %279 : tensor<2xf32>
        %287 = index.sub %c7, %c5
        %288 = math.rsqrt %59 : tensor<5xf32>
        %289 = index.casts %c614625657_i32 : i32 to index
        %290 = arith.cmpf oeq, %cst_2, %cst_2 : f32
        %291 = arith.cmpi ne, %c1291372147_i32, %c614625657_i32 : i32
        %292 = arith.minui %c8837_i16, %c8837_i16 : i16
        bufferization.dealloc_tensor %cast_51 : tensor<?xi64>
      }
      %cast_52 = tensor.cast %7 : tensor<15xi1> to tensor<?xi1>
      %284 = vector.splat %c7 : vector<2x12x15xindex>
      %285 = index.add %c1, %c8
    }
    %92 = arith.muli %c1750124934_i64, %c304038688_i64 : i64
    %93 = math.log2 %cst_3 : f16
    %94 = vector.splat %c8837_i16 : vector<2x12x15xi16>
    %95 = index.divs %c6, %c8
    %96 = math.absi %6 : tensor<5xi16>
    %97 = math.floor %cst : f32
    %98 = memref.realloc %alloc_14 : memref<15xf32> to memref<15xf32>
    %99 = affine.apply affine_map<(d0) -> (d0 + d0 floordiv 128 - d0 floordiv 128)>(%c6)
    %100 = math.round %cst_2 : f32
    %from_elements = tensor.from_elements %c1750124934_i64, %c1750124934_i64 : tensor<2xi64>
    %101 = math.powf %cst_6, %cst_2 : f32
    %cast_26 = tensor.cast %2 : tensor<5xi64> to tensor<?xi64>
    %102 = arith.addi %false_1, %false_5 : i1
    %103 = math.log %cst_0 : f32
    %104 = vector.broadcast %c7 : index to vector<2xindex>
