module {
  func.func nested @func1(%arg0: vector<15xi64>, %arg1: memref<16x16xi1>) {
    %c1653018709_i64 = arith.constant 1653018709 : i64
    %cst = arith.constant 1.42491661E+9 : f32
    %cst_0 = arith.constant 0x4E07AA9E : f32
    %cst_1 = arith.constant 2.195200e+04 : f16
    %cst_2 = arith.constant 0x4DD824A6 : f32
    %c-60_i16 = arith.constant -60 : i16
    %c1099692294_i32 = arith.constant 1099692294 : i32
    %false = arith.constant false
    %cst_3 = arith.constant 1.3388576E+9 : f32
    %c1026596729_i32 = arith.constant 1026596729 : i32
    %c-17004_i16 = arith.constant -17004 : i16
    %c1376839441_i32 = arith.constant 1376839441 : i32
    %c7286_i16 = arith.constant 7286 : i16
    %cst_4 = arith.constant 3.328000e+03 : f16
    %true = arith.constant true
    %c2074_i16 = arith.constant 2074 : i16
    %0 = tensor.empty() : tensor<16x16x16xf32>
    %1 = tensor.empty() : tensor<16x1xi16>
    %2 = tensor.empty() : tensor<16x16x16xf16>
    %3 = tensor.empty() : tensor<16x16xi16>
    %4 = tensor.empty() : tensor<16x16xi32>
    %5 = tensor.empty() : tensor<16x16xf16>
    %6 = tensor.empty() : tensor<16x16x16xi64>
    %7 = tensor.empty() : tensor<16x16x16xf32>
    %8 = tensor.empty() : tensor<16x16xi1>
    %9 = tensor.empty() : tensor<16x16xi1>
    %10 = tensor.empty() : tensor<15xi1>
    %11 = tensor.empty() : tensor<15xi32>
    %12 = tensor.empty() : tensor<16x16xf32>
    %13 = tensor.empty() : tensor<16x16xi64>
    %14 = tensor.empty() : tensor<16x16x16xf16>
    %15 = tensor.empty() : tensor<16x1xf16>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<16x1xf32>
    %alloc_5 = memref.alloc() : memref<16x16x16xf16>
    %alloc_6 = memref.alloc() : memref<15xi1>
    %alloc_7 = memref.alloc() : memref<15xf16>
    %alloc_8 = memref.alloc() : memref<16x1xi1>
    %alloc_9 = memref.alloc() : memref<16x16x16xf16>
    %alloc_10 = memref.alloc() : memref<15xi64>
    %alloc_11 = memref.alloc() : memref<15xf32>
    %alloc_12 = memref.alloc() : memref<16x16xi64>
    %alloc_13 = memref.alloc() : memref<16x1xi32>
    %alloc_14 = memref.alloc() : memref<15xi1>
    %alloc_15 = memref.alloc() : memref<16x16x16xi32>
    %alloc_16 = memref.alloc() : memref<16x1xf32>
    %alloc_17 = memref.alloc() : memref<16x16x16xf32>
    %alloc_18 = memref.alloc() : memref<16x1xf16>
    %alloc_19 = memref.alloc() : memref<16x16xf16>
    %16 = tensor.empty() : tensor<16x16x16xf16>
    %17 = linalg.copy ins(%14 : tensor<16x16x16xf16>) outs(%16 : tensor<16x16x16xf16>) -> tensor<16x16x16xf16>
    %alloc_20 = memref.alloc() : memref<15xf16>
    linalg.transpose ins(%alloc_7 : memref<15xf16>) outs(%alloc_20 : memref<15xf16>) permutation = [0] 
    %18 = tensor.empty() : tensor<16xi64>
    %reduced = linalg.reduce ins(%13 : tensor<16x16xi64>) outs(%18 : tensor<16xi64>) dimensions = [0] 
      (%in: i64, %init: i64) {
        %alloc_52 = memref.alloc() : memref<16x16xi1>
        memref.tensor_store %9, %alloc_52 : memref<16x16xi1>
        %cast_53 = tensor.cast %11 : tensor<15xi32> to tensor<?xi32>
        %246 = tensor.empty() : tensor<16x16x16xi64>
        %mapped_54 = linalg.map ins(%6, %6, %6 : tensor<16x16x16xi64>, tensor<16x16x16xi64>, tensor<16x16x16xi64>) outs(%246 : tensor<16x16x16xi64>)
          (%in_56: i64, %in_57: i64, %in_58: i64) {
            %258 = math.exp2 %12 : tensor<16x16xf32>
            %259 = math.exp %15 : tensor<16x1xf16>
            %260 = arith.shrsi %c1653018709_i64, %init : i64
            %261 = index.maxu %c5, %c13
            %262 = vector.broadcast %in_58 : i64 to vector<1xi64>
            %263 = vector.extract_strided_slice %262 {offsets = [0], sizes = [1], strides = [1]} : vector<1xi64> to vector<1xi64>
            %264 = index.sizeof
            %265 = arith.addf %cst_2, %cst_2 : f32
            %266 = vector.reduction <xor>, %262 : vector<1xi64> into i64
            %267 = arith.remui %false, %false : i1
            %268 = affine.min affine_map<(d0, d1, d2) -> (d2, d2 + 4, (d2 mod 32) * 128)>(%c14, %c6, %c9)
            %269 = arith.maxsi %in_56, %in_56 : i64
            %270 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<add>} %263, %262, %in : vector<1xi64>, vector<1xi64> into i64
            %271 = memref.atomic_rmw assign %cst_4, %alloc_19[%c0, %c6] : (f16, memref<16x16xf16>) -> f16
            %272 = arith.ori %c-60_i16, %c2074_i16 : i16
            %273 = math.exp %2 : tensor<16x16x16xf16>
            %274 = index.add %264, %c11
            %275 = arith.minf %cst_3, %cst_3 : f32
            %276 = vector.load %alloc_13[%c11, %c0] : memref<16x1xi32>, vector<16x16xi32>
            %277 = vector.splat %c11 : vector<16x16xindex>
            %278 = arith.remui %init, %init : i64
            %279 = memref.load %alloc_15[%c12, %c5, %c7] : memref<16x16x16xi32>
            %280 = index.add %274, %c9
            %281 = vector.extract_strided_slice %263 {offsets = [0], sizes = [1], strides = [1]} : vector<1xi64> to vector<1xi64>
            %alloc_59 = memref.alloc() : memref<16x1xf16>
            %282 = memref.atomic_rmw addf %cst_4, %alloc_20[%c11] : (f16, memref<15xf16>) -> f16
            %cast_60 = tensor.cast %7 : tensor<16x16x16xf32> to tensor<?x?x?xf32>
            %283 = vector.broadcast %false : i1 to vector<1xi1>
            %284 = vector.maskedload %alloc_6[%c0], %283, %283 : memref<15xi1>, vector<1xi1>, vector<1xi1> into vector<1xi1>
            %285 = arith.minsi %in_58, %in : i64
            %286 = arith.addf %cst_3, %cst_2 : f32
            %287 = math.copysign %0, %0 : tensor<16x16x16xf32>
            %288 = vector.splat %in : vector<16x16xi64>
            %289 = math.atan %cst_1 : f16
            %c1_i64_61 = arith.constant 1 : i64
            linalg.yield %c1_i64_61 : i64
          }
        %alloc_55 = memref.alloc() : memref<1x16xi16>
        %247 = tensor.empty() : tensor<16x16xi16>
        %248 = linalg.matmul ins(%1, %alloc_55 : tensor<16x1xi16>, memref<1x16xi16>) outs(%247 : tensor<16x16xi16>) -> tensor<16x16xi16>
        %249 = vector.broadcast %c-17004_i16 : i16 to vector<15xi16>
        %250 = vector.shuffle %249, %249 [2, 3, 5, 7, 8, 14, 17, 19, 24, 25, 28] : vector<15xi16>, vector<15xi16>
        %251 = vector.broadcast %true : i1 to vector<16x16x16xi1>
        %252 = vector.broadcast %c1099692294_i32 : i32 to vector<16x16x16xi32>
        %253 = vector.gather %8[%c6, %c3] [%252], %251, %251 : tensor<16x16xi1>, vector<16x16x16xi32>, vector<16x16x16xi1>, vector<16x16x16xi1> into vector<16x16x16xi1>
        %254 = vector.broadcast %c11 : index to vector<16xindex>
        %255 = vector.broadcast %true : i1 to vector<16xi1>
        %256 = vector.broadcast %cst_4 : f16 to vector<16xf16>
        vector.scatter %alloc_20[%c12] [%254], %255, %256 : memref<15xf16>, vector<16xindex>, vector<16xi1>, vector<16xf16>
        %257 = arith.maxui %c1026596729_i32, %c1099692294_i32 : i32
        %c1_i64 = arith.constant 1 : i64
        linalg.yield %c1_i64 : i64
      }
    %19 = scf.parallel (%arg2) = (%c14) to (%c10) step (%c6) init (%alloc) -> memref<16x1xf32> {
      %246 = vector.broadcast %c1376839441_i32 : i32 to vector<1xi32>
      %247 = vector.flat_transpose %246 {columns = 1 : i32, rows = 1 : i32} : vector<1xi32> -> vector<1xi32>
      %collapsed_52 = tensor.collapse_shape %17 [[0, 1], [2]] : tensor<16x16x16xf16> into tensor<256x16xf16>
      %248 = math.expm1 %collapsed_52 : tensor<256x16xf16>
      affine.store %cst_4, %alloc_18[%c9, %c10] : memref<16x1xf16>
      %collapsed_53 = tensor.collapse_shape %5 [[0, 1]] : tensor<16x16xf16> into tensor<256xf16>
      %249 = scf.execute_region -> vector<15xi64> {
        %257 = index.maxs %c3, %c15
        %258 = memref.realloc %alloc_20 : memref<15xf16> to memref<1xf16>
        %259 = arith.maxui %c-60_i16, %c-60_i16 : i16
        %260 = math.exp %5 : tensor<16x16xf16>
        %261 = math.atan2 %collapsed_52, %collapsed_52 : tensor<256x16xf16>
        %262 = bufferization.clone %alloc_15 : memref<16x16x16xi32> to memref<16x16x16xi32>
        %263 = index.add %c10, %257
        %c5178055_i32 = arith.constant 5178055 : i32
        %264 = memref.load %alloc_17[%c4, %c3, %c2] : memref<16x16x16xf32>
        %265 = arith.minsi %true, %true : i1
        %266 = index.castu %c8 : index to i32
        %267 = bufferization.to_memref %11 : memref<15xi32>
        %268 = tensor.empty() : tensor<16x1xi32>
        %269 = math.fpowi %15, %268 : tensor<16x1xf16>, tensor<16x1xi32>
        %extracted = tensor.extract %7[%c6, %c13, %c1] : tensor<16x16x16xf32>
        %270 = math.exp2 %collapsed_53 : tensor<256xf16>
        %271 = arith.shrsi %false, %true : i1
        %272 = vector.broadcast %c1653018709_i64 : i64 to vector<15xi64>
        scf.yield %272 : vector<15xi64>
      }
      %from_elements_54 = tensor.from_elements %c7286_i16, %c-60_i16, %c-60_i16, %c-60_i16, %c-60_i16, %c2074_i16, %c2074_i16, %c2074_i16, %c2074_i16, %c2074_i16, %c7286_i16, %c7286_i16, %c2074_i16, %c2074_i16, %c2074_i16, %c-17004_i16, %c7286_i16, %c7286_i16, %c-17004_i16, %c-60_i16, %c-60_i16, %c2074_i16, %c-60_i16, %c2074_i16, %c-17004_i16, %c-60_i16, %c2074_i16, %c7286_i16, %c-17004_i16, %c-60_i16, %c-60_i16, %c7286_i16, %c7286_i16, %c7286_i16, %c2074_i16, %c-17004_i16, %c-17004_i16, %c2074_i16, %c-60_i16, %c-17004_i16, %c-17004_i16, %c-60_i16, %c-60_i16, %c2074_i16, %c-17004_i16, %c7286_i16, %c-60_i16, %c-60_i16, %c7286_i16, %c7286_i16, %c-60_i16, %c-17004_i16, %c-60_i16, %c-60_i16, %c2074_i16, %c-17004_i16, %c2074_i16, %c-17004_i16, %c-17004_i16, %c-60_i16, %c-60_i16, %c2074_i16, %c-60_i16, %c2074_i16, %c7286_i16, %c2074_i16, %c-60_i16, %c-17004_i16, %c7286_i16, %c-17004_i16, %c7286_i16, %c7286_i16, %c-17004_i16, %c-60_i16, %c2074_i16, %c-60_i16, %c-60_i16, %c-60_i16, %c2074_i16, %c7286_i16, %c-60_i16, %c-17004_i16, %c7286_i16, %c-17004_i16, %c2074_i16, %c7286_i16, %c7286_i16, %c2074_i16, %c2074_i16, %c-17004_i16, %c-60_i16, %c7286_i16, %c-60_i16, %c-60_i16, %c-17004_i16, %c7286_i16, %c-60_i16, %c-17004_i16, %c-17004_i16, %c2074_i16, %c7286_i16, %c-17004_i16, %c-17004_i16, %c2074_i16, %c-60_i16, %c7286_i16, %c-17004_i16, %c-17004_i16, %c7286_i16, %c-17004_i16, %c-60_i16, %c-60_i16, %c7286_i16, %c7286_i16, %c-17004_i16, %c2074_i16, %c7286_i16, %c2074_i16, %c-17004_i16, %c2074_i16, %c7286_i16, %c7286_i16, %c7286_i16, %c-60_i16, %c-60_i16, %c-60_i16, %c-17004_i16, %c-60_i16, %c2074_i16, %c2074_i16, %c-60_i16, %c2074_i16, %c-60_i16, %c7286_i16, %c-60_i16, %c2074_i16, %c-60_i16, %c-17004_i16, %c-60_i16, %c2074_i16, %c2074_i16, %c-17004_i16, %c-17004_i16, %c-17004_i16, %c-60_i16, %c-60_i16, %c2074_i16, %c-60_i16, %c-17004_i16, %c-17004_i16, %c-60_i16, %c2074_i16, %c-17004_i16, %c2074_i16, %c-17004_i16, %c-17004_i16, %c7286_i16, %c7286_i16, %c-60_i16, %c2074_i16, %c2074_i16, %c-17004_i16, %c7286_i16, %c7286_i16, %c-60_i16, %c-60_i16, %c2074_i16, %c-17004_i16, %c2074_i16, %c-17004_i16, %c7286_i16, %c7286_i16, %c-17004_i16, %c-60_i16, %c2074_i16, %c7286_i16, %c2074_i16, %c-17004_i16, %c-17004_i16, %c-17004_i16, %c2074_i16, %c-17004_i16, %c-17004_i16, %c2074_i16, %c7286_i16, %c7286_i16, %c-60_i16, %c7286_i16, %c-60_i16, %c2074_i16, %c7286_i16, %c-17004_i16, %c-60_i16, %c-60_i16, %c2074_i16, %c7286_i16, %c2074_i16, %c-17004_i16, %c7286_i16, %c7286_i16, %c7286_i16, %c7286_i16, %c-60_i16, %c2074_i16, %c7286_i16, %c2074_i16, %c2074_i16, %c2074_i16, %c2074_i16, %c-17004_i16, %c-60_i16, %c-17004_i16, %c-60_i16, %c-17004_i16, %c2074_i16, %c2074_i16, %c2074_i16, %c2074_i16, %c-17004_i16, %c2074_i16, %c-17004_i16, %c-17004_i16, %c7286_i16, %c-17004_i16, %c2074_i16, %c-60_i16, %c7286_i16, %c2074_i16, %c-60_i16, %c-17004_i16, %c2074_i16, %c-17004_i16, %c7286_i16, %c-17004_i16, %c2074_i16, %c2074_i16, %c7286_i16, %c7286_i16, %c-60_i16, %c2074_i16, %c-17004_i16, %c2074_i16, %c-17004_i16, %c7286_i16, %c2074_i16, %c-60_i16, %c-60_i16, %c-17004_i16, %c7286_i16, %c-17004_i16, %c2074_i16, %c7286_i16, %c-17004_i16, %c7286_i16, %c2074_i16, %c-17004_i16 : tensor<16x16xi16>
      %250 = index.maxu %c8, %c0
      bufferization.dealloc_tensor %5 : tensor<16x16xf16>
      %251 = bufferization.clone %alloc_20 : memref<15xf16> to memref<15xf16>
      %252 = index.floordivs %c4, %c14
      %253 = math.copysign %14, %17 : tensor<16x16x16xf16>
      memref.alloca_scope  {
        %257 = index.ceildivs %c4, %c14
        %258 = vector.load %alloc_5[%c11, %c8, %c2] : memref<16x16x16xf16>, vector<16x16x16xf16>
        %259 = arith.andi %c1376839441_i32, %c1099692294_i32 : i32
        %260 = bufferization.to_memref %15 : memref<16x1xf16>
        %261 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minsi>} %247, %247, %c1099692294_i32 : vector<1xi32>, vector<1xi32> into i32
        %262 = affine.min affine_map<(d0, d1, d2) -> (0, 0)>(%c7, %c5, %c3)
        %263 = arith.ori %false, %false : i1
        %264 = vector.broadcast %cst_1 : f16 to vector<16x16xf16>
        %dest_56, %accumulated_value_57 = vector.scan <add>, %258, %264 {inclusive = true, reduction_dim = 1 : i64} : vector<16x16x16xf16>, vector<16x16xf16>
        %expanded_58 = tensor.expand_shape %7 [[0], [1], [2, 3]] : tensor<16x16x16xf32> into tensor<16x16x16x1xf32>
        %265 = math.log10 %cst : f32
        %266 = vector.splat %c1653018709_i64 : vector<16x1xi64>
        %267 = vector.splat %c2 : vector<16x16xindex>
        %expanded_59 = tensor.expand_shape %expanded_58 [[0], [1], [2], [3, 4]] : tensor<16x16x16x1xf32> into tensor<16x16x16x1x1xf32>
        %inserted_60 = tensor.insert %cst into %0[%c9, %c3, %c12] : tensor<16x16x16xf32>
        bufferization.dealloc_tensor %12 : tensor<16x16xf32>
        %alloc_61 = memref.alloc() : memref<16x16xi1>
        memref.tensor_store %8, %alloc_61 : memref<16x16xi1>
        %268 = math.cttz %c2074_i16 : i16
        vector.print %258 : vector<16x16x16xf16>
        %269 = vector.flat_transpose %246 {columns = 1 : i32, rows = 1 : i32} : vector<1xi32> -> vector<1xi32>
        %270 = math.rsqrt %12 : tensor<16x16xf32>
        %271 = arith.shli %c1026596729_i32, %c1099692294_i32 : i32
        %272 = arith.remsi %false, %true : i1
        bufferization.dealloc_tensor %collapsed_52 : tensor<256x16xf16>
        %273 = arith.negf %cst_2 : f32
        %274 = bufferization.clone %alloc_14 : memref<15xi1> to memref<15xi1>
        %275 = arith.minui %c1099692294_i32, %c1099692294_i32 : i32
        %276 = index.castu %262 : index to i32
        %277 = math.powf %collapsed_53, %collapsed_53 : tensor<256xf16>
        %278 = vector.broadcast %c1099692294_i32 : i32 to vector<i32>
        %279 = vector.transfer_write %278, %4[%c9, %c8] : vector<i32>, tensor<16x16xi32>
        %c1384651813_i32 = arith.constant 1384651813 : i32
        %280 = math.exp %12 : tensor<16x16xf32>
        %281 = tensor.empty(%c2, %c8) : tensor<16x?x?xf16>
      }
      %254 = math.ctlz %1 : tensor<16x1xi16>
      %255 = arith.subi %c7286_i16, %c-60_i16 : i16
      %256 = arith.divf %cst_0, %cst_0 : f32
      %alloc_55 = memref.alloc() : memref<16x1xf32>
      scf.reduce(%alloc_55)  : memref<16x1xf32> {
      ^bb0(%arg3: memref<16x1xf32>, %arg4: memref<16x1xf32>):
        %257 = vector.insertelement %c1099692294_i32, %247[%c7 : index] : vector<1xi32>
        %258 = vector.load %alloc_55[%c12, %c0] : memref<16x1xf32>, vector<15xf32>
        %extracted = tensor.extract %5[%c9, %c9] : tensor<16x16xf16>
        %259 = index.castu %c12 : index to i32
        %cst_56 = arith.constant 1.000000e+00 : f16
        %260 = vector.transfer_read %15[%252, %c7], %cst_56 : tensor<16x1xf16>, vector<f16>
        %261 = vector.transpose %258, [0] : vector<15xf32> to vector<15xf32>
        memref.store %cst_0, %alloc_11[%c1] : memref<15xf32>
        %262 = affine.apply affine_map<(d0) -> ((d0 mod 4) floordiv 4)>(%c8)
        %alloc_57 = memref.alloc() : memref<16x1xf32>
        scf.reduce.return %alloc_57 : memref<16x1xf32>
      }
      scf.yield
    }
    %20 = affine.vector_load %alloc_17[%c6, %c7, %c1] : memref<16x16x16xf32>, vector<16xf32>
    affine.vector_store %20, %alloc_16[%c11, %c6] : memref<16x1xf32>, vector<16xf32>
    %21 = tensor.empty() : tensor<15xf16>
    %22 = tensor.empty() : tensor<f16>
    %23 = linalg.dot ins(%alloc_7, %21 : memref<15xf16>, tensor<15xf16>) outs(%22 : tensor<f16>) -> tensor<f16>
    %24 = scf.execute_region -> memref<15xf32> {
      %246 = arith.addi %c1376839441_i32, %c1099692294_i32 : i32
      %247 = scf.while (%arg2 = %cst_0) : (f32) -> f32 {
        %259 = arith.divf %cst_0, %cst : f32
        %260 = arith.remf %cst_4, %cst_4 : f16
        %261 = vector.broadcast %cst_0 : f32 to vector<16x1xf32>
        %262 = vector.fma %261, %261, %261 : vector<16x1xf32>
        %263 = arith.ceildivsi %c2074_i16, %c7286_i16 : i16
        %264 = vector.splat %c4 : vector<16x16x16xindex>
        %265 = math.sqrt %cst : f32
        %266 = arith.addf %arg2, %arg2 : f32
        %267 = memref.load %alloc_16[%c14, %c0] : memref<16x1xf32>
        scf.condition(%false) %cst_3 : f32
      } do {
      ^bb0(%arg2: f32):
        %259 = bufferization.to_memref %13 : memref<16x16xi64>
        %260 = vector.extract_strided_slice %20 {offsets = [3], sizes = [5], strides = [1]} : vector<16xf32> to vector<5xf32>
        %261 = vector.insertelement %arg2, %260[%c7 : index] : vector<5xf32>
        %262 = math.ctlz %true : i1
        %263 = arith.remf %cst_3, %cst_2 : f32
        %264 = bufferization.clone %alloc_18 : memref<16x1xf16> to memref<16x1xf16>
        %265 = math.round %23 : tensor<f16>
        %266 = index.divu %c1, %c13
        %267 = math.copysign %12, %12 : tensor<16x16xf32>
        %268 = index.divs %c0, %c14
        %269 = vector.create_mask %c5 : vector<15xi1>
        %270 = math.cttz %c7286_i16 : i16
        %271 = tensor.empty() : tensor<1x15xf16>
        %272 = tensor.empty() : tensor<16x15xf16>
        %273 = linalg.matmul ins(%15, %271 : tensor<16x1xf16>, tensor<1x15xf16>) outs(%272 : tensor<16x15xf16>) -> tensor<16x15xf16>
        %274 = arith.subi %c1099692294_i32, %c1026596729_i32 : i32
        %cast_53 = tensor.cast %14 : tensor<16x16x16xf16> to tensor<?x?x?xf16>
        %275 = arith.remf %cst_1, %cst_4 : f16
        scf.yield %cst_0 : f32
      }
      %248 = index.sub %c3, %c8
      %249 = math.rsqrt %16 : tensor<16x16x16xf16>
      %250 = scf.execute_region -> vector<15xi16> {
        %259 = math.round %17 : tensor<16x16x16xf16>
        %260 = math.atan2 %2, %2 : tensor<16x16x16xf16>
        %261 = math.expm1 %23 : tensor<f16>
        %262 = index.mul %c11, %c12
        %cst_53 = arith.constant 6.336000e+04 : f16
        %263 = index.divu %c6, %c8
        %264 = vector.broadcast %cst_4 : f16 to vector<1x1x16xf16>
        %265 = vector.broadcast %cst_1 : f16 to vector<1x16xf16>
        %dest_54, %accumulated_value_55 = vector.scan <add>, %264, %265 {inclusive = false, reduction_dim = 1 : i64} : vector<1x1x16xf16>, vector<1x16xf16>
        %266 = math.log10 %15 : tensor<16x1xf16>
        %267 = arith.remsi %c1653018709_i64, %c1653018709_i64 : i64
        %268 = math.powf %23, %22 : tensor<f16>
        %splat_56 = tensor.splat %c1026596729_i32 : tensor<16x16xi32>
        %inserted_57 = tensor.insert %cst_1 into %23[] : tensor<f16>
        %269 = index.ceildivs %c13, %262
        %270 = affine.min affine_map<(d0, d1) -> (-d0, d0 - d1 mod 8 + 16, d0 - (d0 + 16), d1 mod 16)>(%263, %c10)
        %271 = vector.splat %c8 : vector<16x16xindex>
        %272 = index.sub %c7, %c1
        %273 = vector.broadcast %c-60_i16 : i16 to vector<15xi16>
        scf.yield %273 : vector<15xi16>
      }
      %251 = math.powf %5, %5 : tensor<16x16xf16>
      %252 = bufferization.clone %alloc : memref<16x1xf32> to memref<16x1xf32>
      %253 = index.add %c11, %c7
      %collapsed_52 = tensor.collapse_shape %14 [[0, 1], [2]] : tensor<16x16x16xf16> into tensor<256x16xf16>
      %254 = math.log10 %7 : tensor<16x16x16xf32>
      %255 = index.sub %c3, %c5
      %256 = math.ctpop %c1099692294_i32 : i32
      %257 = vector.matrix_multiply %20, %20 {lhs_columns = 16 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<16xf32>, vector<16xf32>) -> vector<1xf32>
      affine.store %c1653018709_i64, %alloc_10[%c2] : memref<15xi64>
      %258 = math.atan %14 : tensor<16x16x16xf16>
      memref.tensor_store %0, %alloc_17 : memref<16x16x16xf32>
      scf.yield %alloc_11 : memref<15xf32>
    }
    %25 = index.add %c9, %c11
    %26 = memref.realloc %alloc_14 : memref<15xi1> to memref<1xi1>
    memref.store %cst_4, %alloc_9[%c10, %c14, %c9] : memref<16x16x16xf16>
    %27 = math.atan2 %15, %15 : tensor<16x1xf16>
    %28 = arith.shli %true, %true : i1
    %29 = arith.remf %cst_4, %cst_4 : f16
    %30 = vector.broadcast %cst_2 : f32 to vector<15xf32>
    %31 = vector.fma %30, %30, %30 : vector<15xf32>
    %32 = memref.realloc %alloc_10 : memref<15xi64> to memref<16xi64>
    %33 = math.tanh %5 : tensor<16x16xf16>
    %34 = math.ctpop %4 : tensor<16x16xi32>
    %35 = math.ctlz %13 : tensor<16x16xi64>
    %rank = tensor.rank %8 : tensor<16x16xi1>
    %36 = math.expm1 %cst_4 : f16
    %37 = memref.atomic_rmw mulf %cst_4, %alloc_5[%c14, %c4, %c10] : (f16, memref<16x16x16xf16>) -> f16
    %38 = arith.muli %false, %true : i1
    %39 = math.log10 %21 : tensor<15xf16>
    %40 = arith.shrui %c1099692294_i32, %c1026596729_i32 : i32
    %41 = math.atan %15 : tensor<16x1xf16>
    memref.tensor_store %0, %alloc_17 : memref<16x16x16xf32>
    %cast = tensor.cast %5 : tensor<16x16xf16> to tensor<?x?xf16>
    %42 = index.maxu %c0, %25
    %43 = tensor.empty() : tensor<16x16x16xi1>
    %44 = vector.broadcast %false : i1 to vector<16x16x16xi1>
    %45 = vector.broadcast %c1099692294_i32 : i32 to vector<16x16x16xi32>
    %46 = vector.gather %43[%c4, %c15, %rank] [%45], %44, %44 : tensor<16x16x16xi1>, vector<16x16x16xi32>, vector<16x16x16xi1>, vector<16x16x16xi1> into vector<16x16x16xi1>
    %47 = index.floordivs %c13, %c0
    %48 = vector.shuffle %45, %45 [0, 1, 5, 6, 8, 11, 12, 13, 15, 16, 19, 20, 21, 23, 25, 26, 27, 29, 30, 31] : vector<16x16x16xi32>, vector<16x16x16xi32>
    %expanded = tensor.expand_shape %14 [[0], [1], [2, 3]] : tensor<16x16x16xf16> into tensor<16x16x16x1xf16>
    %49 = memref.atomic_rmw addi %c1376839441_i32, %alloc_13[%c2, %c0] : (i32, memref<16x1xi32>) -> i32
    %50 = math.round %14 : tensor<16x16x16xf16>
    bufferization.dealloc_tensor %13 : tensor<16x16xi64>
    scf.index_switch %rank 
    case 1 {
      scf.if %true {
        %259 = arith.maxsi %c2074_i16, %c-17004_i16 : i16
        %260 = math.copysign %12, %12 : tensor<16x16xf32>
        %261 = math.absf %7 : tensor<16x16x16xf32>
        %262 = arith.divf %cst, %cst_0 : f32
        %263 = arith.maxsi %c1653018709_i64, %c1653018709_i64 : i64
        %264 = math.fma %12, %12, %12 : tensor<16x16xf32>
        %265 = arith.addi %c1653018709_i64, %c1653018709_i64 : i64
        %266 = arith.subi %c-17004_i16, %c-60_i16 : i16
      }
      %246 = arith.addf %cst_2, %cst_3 : f32
      memref.copy %alloc_11, %24 : memref<15xf32> to memref<15xf32>
      %247 = arith.divsi %c2074_i16, %c7286_i16 : i16
      vector.print %31 : vector<15xf32>
      %248 = tensor.empty() : tensor<16x1xi64>
      %249 = math.atan2 %23, %23 : tensor<f16>
      %250 = affine.min affine_map<(d0, d1, d2, d3) -> (d2 - d1 + d1 + 12, d2 - d1 - 4, d1 - (d0 mod 4 - 32), (d0 mod 4) floordiv 128)>(%c5, %c2, %c14, %42)
      %251 = arith.ori %c1026596729_i32, %c1099692294_i32 : i32
      %252 = arith.ceildivsi %c1376839441_i32, %c1099692294_i32 : i32
      %253 = arith.minsi %false, %true : i1
      %254 = math.ceil %21 : tensor<15xf16>
      %255 = index.maxu %c1, %c14
      %256 = index.add %250, %255
      %257 = vector.load %alloc_12[%c5, %c3] : memref<16x16xi64>, vector<16x16x16xi64>
      %cst_52 = arith.constant 1.000000e+00 : f16
      %cst_53 = arith.constant 0.000000e+00 : f16
      %258 = vector.transfer_read %2[%256, %c7, %c10], %cst_53 {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : tensor<16x16x16xf16>, vector<16xf16>
      scf.yield
    }
    default {
      %246 = bufferization.clone %alloc_13 : memref<16x1xi32> to memref<16x1xi32>
      %247 = arith.ceildivsi %false, %true : i1
      %248 = index.divu %c6, %c10
      %249 = index.divu %c14, %248
      %250 = affine.if affine_set<(d0, d1, d2) : (2 >= 0, 1 >= 0, (((d1 floordiv 128) ceildiv 4) mod 2) * 2 == 0, (d1 floordiv 128) ceildiv 4 >= 0)>(%c14, %c12, %c10) -> memref<16x16xi64> {
        %262 = math.cttz %c1653018709_i64 : i64
        %263 = index.divs %42, %c9
        %264 = math.log1p %2 : tensor<16x16x16xf16>
        %265 = affine.min affine_map<(d0, d1, d2, d3) -> (d0)>(%rank, %c13, %c15, %c14)
        %266 = arith.remsi %false, %true : i1
        %267 = arith.subi %c1376839441_i32, %c1376839441_i32 : i32
        %expanded_52 = tensor.expand_shape %7 [[0], [1], [2, 3]] : tensor<16x16x16xf32> into tensor<16x16x16x1xf32>
        %inserted_53 = tensor.insert %cst_4 into %23[] : tensor<f16>
        affine.yield %alloc_12 : memref<16x16xi64>
      } else {
        %262 = bufferization.clone %alloc_6 : memref<15xi1> to memref<15xi1>
        %263 = math.log10 %12 : tensor<16x16xf32>
        %264 = arith.mulf %cst_4, %cst_1 : f16
        %265 = vector.broadcast %c1376839441_i32 : i32 to vector<16x16xi32>
        %dest_52, %accumulated_value_53 = vector.scan <maxsi>, %45, %265 {inclusive = false, reduction_dim = 1 : i64} : vector<16x16x16xi32>, vector<16x16xi32>
        %266 = vector.insertelement %cst_3, %30[%c12 : index] : vector<15xf32>
        %267 = vector.broadcast %false : i1 to vector<16x16xi1>
        %268 = vector.insert %267, %44 [1] : vector<16x16xi1> into vector<16x16x16xi1>
        %269 = tensor.empty() : tensor<15xi32>
        %270 = arith.mulf %cst_2, %cst_0 : f32
        affine.yield %alloc_12 : memref<16x16xi64>
      }
      %251 = arith.minsi %true, %false : i1
      %252 = affine.min affine_map<(d0, d1, d2) -> (d2 + d1)>(%c0, %c6, %c5)
      %253 = bufferization.clone %alloc_18 : memref<16x1xf16> to memref<16x1xf16>
      %254 = math.powf %5, %5 : tensor<16x16xf16>
      %255 = arith.ori %true, %false : i1
      %256 = affine.if affine_set<(d0, d1) : (-(d1 + 4) >= 0)>(%c14, %c14) -> i16 {
        %262 = vector.splat %false : vector<16x1xi1>
        %263 = vector.splat %c8 : vector<16x16xindex>
        %264 = math.cos %17 : tensor<16x16x16xf16>
        memref.tensor_store %13, %alloc_12 : memref<16x16xi64>
        %265 = arith.remui %c1653018709_i64, %c1653018709_i64 : i64
        %266 = arith.andi %c1376839441_i32, %c1026596729_i32 : i32
        %267 = memref.load %alloc_19[%c15, %c12] : memref<16x16xf16>
        %268 = index.casts %true : i1 to index
        affine.yield %c-17004_i16 : i16
      } else {
        %262 = tensor.empty() : tensor<16x16xi32>
        %263 = linalg.matmul ins(%4, %4 : tensor<16x16xi32>, tensor<16x16xi32>) outs(%262 : tensor<16x16xi32>) -> tensor<16x16xi32>
        affine.store %cst_2, %alloc_16[%c1, %c4] : memref<16x1xf32>
        %264 = math.round %15 : tensor<16x1xf16>
        %265 = math.rsqrt %14 : tensor<16x16x16xf16>
        %266 = arith.mulf %cst_2, %cst_2 : f32
        %267 = index.sub %c4, %c9
        %268 = math.fma %5, %5, %5 : tensor<16x16xf16>
        %269 = index.floordivs %47, %47
        affine.yield %c7286_i16 : i16
      }
      memref.assume_alignment %alloc_12, 16 : memref<16x16xi64>
      %257 = index.sub %25, %c11
      %258 = vector.bitcast %45 : vector<16x16x16xi32> to vector<16x16x16xi32>
      %259 = vector.bitcast %46 : vector<16x16x16xi1> to vector<16x16x16xi1>
      %260 = tensor.empty() : tensor<16x1xf16>
      %261 = linalg.matmul ins(%5, %15 : tensor<16x16xf16>, tensor<16x1xf16>) outs(%260 : tensor<16x1xf16>) -> tensor<16x1xf16>
    }
    %51 = vector.multi_reduction <mul>, %20, %20 [] : vector<16xf32> to vector<16xf32>
    %alloc_21 = memref.alloc() : memref<16x1xi16>
    %cast_22 = tensor.cast %5 : tensor<16x16xf16> to tensor<?x?xf16>
    memref.store %cst_0, %alloc_11[%c3] : memref<15xf32>
    %52 = affine.apply affine_map<(d0) -> ((d0 mod 4) floordiv 4)>(%c12)
    memref.store %c1653018709_i64, %alloc_10[%c5] : memref<15xi64>
    %53 = arith.muli %c1026596729_i32, %c1099692294_i32 : i32
    %54 = index.ceildivs %c1, %c7
    %55 = arith.minsi %c1376839441_i32, %c1026596729_i32 : i32
    %56 = math.log1p %15 : tensor<16x1xf16>
    memref.alloca_scope  {
      %246 = vector.bitcast %44 : vector<16x16x16xi1> to vector<16x16x16xi1>
      memref.alloca_scope  {
        %alloc_58 = memref.alloc() : memref<16xi64>
        memref.tensor_store %reduced, %alloc_58 : memref<16xi64>
        %274 = math.roundeven %7 : tensor<16x16x16xf32>
        %cast_59 = tensor.cast %6 : tensor<16x16x16xi64> to tensor<?x?x?xi64>
        %275 = vector.transpose %246, [1, 2, 0] : vector<16x16x16xi1> to vector<16x16x16xi1>
        %expanded_60 = tensor.expand_shape %7 [[0], [1], [2, 3]] : tensor<16x16x16xf32> into tensor<16x16x16x1xf32>
        %276 = arith.subi %false, %false : i1
        %277 = index.sub %c4, %c3
        %278 = index.floordivs %c2, %277
        %279 = arith.mulf %cst_2, %cst_0 : f32
        %280 = bufferization.clone %alloc_5 : memref<16x16x16xf16> to memref<16x16x16xf16>
        %281 = index.casts %c6 : index to i32
        %282 = math.rsqrt %21 : tensor<15xf16>
        %283 = arith.ceildivsi %true, %true : i1
        bufferization.dealloc_tensor %expanded : tensor<16x16x16x1xf16>
        %284 = math.sqrt %2 : tensor<16x16x16xf16>
        %285 = vector.broadcast %c1026596729_i32 : i32 to vector<16x16xi32>
        %dest_61, %accumulated_value_62 = vector.scan <maxsi>, %45, %285 {inclusive = false, reduction_dim = 2 : i64} : vector<16x16x16xi32>, vector<16x16xi32>
        %286 = arith.addi %true, %false : i1
        %287 = vector.extract_strided_slice %31 {offsets = [13], sizes = [1], strides = [1]} : vector<15xf32> to vector<1xf32>
        %288 = index.add %rank, %c12
        %289 = vector.broadcast %cst : f32 to vector<16x1xf32>
        %290 = vector.fma %289, %289, %289 : vector<16x1xf32>
        %291 = vector.multi_reduction <minf>, %30, %30 [] : vector<15xf32> to vector<15xf32>
        %292 = index.castu %true : i1 to index
        %293 = math.ctpop %18 : tensor<16xi64>
        %294 = index.add %c11, %c14
        memref.tensor_store %14, %alloc_5 : memref<16x16x16xf16>
        %295 = bufferization.clone %280 : memref<16x16x16xf16> to memref<16x16x16xf16>
        %296 = math.log2 %22 : tensor<f16>
        %297 = bufferization.clone %alloc_8 : memref<16x1xi1> to memref<16x1xi1>
        %298 = arith.ori %c-17004_i16, %c2074_i16 : i16
        %299 = affine.max affine_map<(d0) -> ((d0 mod 32) floordiv 32, -(d0 mod 32 + 2), (d0 * 4) floordiv 16)>(%c12)
        %300 = math.log10 %5 : tensor<16x16xf16>
        %301 = math.fpowi %cst_1, %c1376839441_i32 : f16, i32
      }
      %alloc_52 = memref.alloc() : memref<f16>
      memref.tensor_store %22, %alloc_52 : memref<f16>
      %expanded_53 = tensor.expand_shape %0 [[0], [1], [2, 3]] : tensor<16x16x16xf32> into tensor<16x16x16x1xf32>
      %247 = math.exp2 %15 : tensor<16x1xf16>
      bufferization.dealloc_tensor %2 : tensor<16x16x16xf16>
      %248 = tensor.empty() : tensor<16x16x16xf16>
      %mapped_54 = linalg.map ins(%14, %16 : tensor<16x16x16xf16>, tensor<16x16x16xf16>) outs(%248 : tensor<16x16x16xf16>)
        (%in: f16, %in_58: f16) {
          %collapsed_59 = tensor.collapse_shape %15 [[0, 1]] : tensor<16x1xf16> into tensor<16xf16>
          %274 = arith.maxsi %c1026596729_i32, %c1099692294_i32 : i32
          %275 = math.atan2 %248, %14 : tensor<16x16x16xf16>
          %276 = index.casts %c7 : index to i32
          %277 = vector.broadcast %rank : index to vector<16xindex>
          %278 = vector.broadcast %true : i1 to vector<16xi1>
          vector.scatter %alloc_8[%c10, %c0] [%277], %278, %278 : memref<16x1xi1>, vector<16xindex>, vector<16xi1>, vector<16xi1>
          %279 = tensor.empty() : tensor<16x16xi1>
          %280 = linalg.matmul ins(%9, %8 : tensor<16x16xi1>, tensor<16x16xi1>) outs(%279 : tensor<16x16xi1>) -> tensor<16x16xi1>
          %281 = affine.min affine_map<(d0, d1, d2, d3) -> (d2 ceildiv 8, d0 - d1, d2 ceildiv 8 + 2)>(%c7, %25, %c0, %c15)
          %inserted_60 = tensor.insert %cst_4 into %5[%c4, %c5] : tensor<16x16xf16>
          %282 = arith.subi %c1026596729_i32, %c1026596729_i32 : i32
          %283 = vector.broadcast %c1099692294_i32 : i32 to vector<16xi32>
          %284 = vector.broadcast %false : i1 to vector<16xi1>
          %285 = vector.maskedload %alloc_13[%c1, %c0], %284, %283 : memref<16x1xi32>, vector<16xi1>, vector<16xi32> into vector<16xi32>
          %286 = vector.shuffle %246, %44 [0, 1, 2, 3, 4, 11, 14, 16, 17, 18, 20, 21, 24, 25, 26, 28, 31] : vector<16x16x16xi1>, vector<16x16x16xi1>
          %287 = index.castu %c11 : index to i32
          memref.store %in_58, %alloc_9[%c2, %c11, %c0] : memref<16x16x16xf16>
          %288 = index.maxu %52, %c6
          %289 = arith.maxui %c7286_i16, %c2074_i16 : i16
          %290 = math.ctpop %279 : tensor<16x16xi1>
          %extracted_61 = tensor.extract %8[%c5, %c12] : tensor<16x16xi1>
          %291 = math.tanh %cst_2 : f32
          %292 = affine.load %alloc_15[%c8, %c13, %c3] : memref<16x16x16xi32>
          %293 = arith.remf %cst_1, %cst_4 : f16
          %294 = math.round %21 : tensor<15xf16>
          %inserted_62 = tensor.insert %false into %9[%c4, %c6] : tensor<16x16xi1>
          %295 = bufferization.to_memref %7 : memref<16x16x16xf32>
          %296 = memref.load %alloc_8[%c10, %c0] : memref<16x1xi1>
          %297 = arith.addi %false, %false : i1
          %298 = math.cttz %c1026596729_i32 : i32
          %alloc_63 = memref.alloc() : memref<16x16x16xi64>
          bufferization.dealloc_tensor %248 : tensor<16x16x16xf16>
          %299 = index.casts %false : i1 to index
          %300 = arith.remf %cst_0, %cst_3 : f32
          %collapsed_64 = tensor.collapse_shape %0 [[0, 1], [2]] : tensor<16x16x16xf32> into tensor<256x16xf32>
          %301 = memref.load %alloc_18[%c5, %c0] : memref<16x1xf16>
          %cst_65 = arith.constant 1.000000e+00 : f16
          linalg.yield %cst_65 : f16
        }
      memref.tensor_store %15, %alloc_18 : memref<16x1xf16>
      %249 = math.cos %12 : tensor<16x16xf32>
      %250 = index.ceildivu %c5, %c6
      %251 = arith.maxf %cst, %cst_3 : f32
      %252 = arith.maxui %c-60_i16, %c7286_i16 : i16
      %splat_55 = tensor.splat %c1376839441_i32 : tensor<16x16x16xi32>
      %253 = arith.remui %c1376839441_i32, %c1099692294_i32 : i32
      %254 = arith.addi %c1653018709_i64, %c1653018709_i64 : i64
      %255 = arith.andi %c1099692294_i32, %c1099692294_i32 : i32
      %256 = vector.splat %c11 : vector<16x16x16xindex>
      %257 = bufferization.clone %alloc_7 : memref<15xf16> to memref<15xf16>
      %258 = arith.shrsi %c-60_i16, %c2074_i16 : i16
      %259 = bufferization.clone %alloc_13 : memref<16x1xi32> to memref<16x1xi32>
      %260 = arith.maxsi %c7286_i16, %c-17004_i16 : i16
      %261 = index.maxs %c13, %c3
      %262 = vector.reduction <add>, %31 : vector<15xf32> into f32
      %263 = arith.remui %c7286_i16, %c-17004_i16 : i16
      %264 = vector.broadcast %c1653018709_i64 : i64 to vector<15xi64>
      %265 = vector.broadcast %true : i1 to vector<15xi1>
      %266 = vector.broadcast %c1376839441_i32 : i32 to vector<15xi32>
      %267 = vector.gather %alloc_10[%250] [%266], %265, %264 : memref<15xi64>, vector<15xi32>, vector<15xi1>, vector<15xi64> into vector<15xi64>
      %268 = memref.load %alloc_13[%c3, %c0] : memref<16x1xi32>
      %269 = arith.divf %cst_1, %cst_4 : f16
      %270 = arith.addf %cst_4, %cst_1 : f16
      %cst_56 = arith.constant 1.000000e+00 : f32
      %cst_57 = arith.constant 0.000000e+00 : f32
      %271 = vector.transfer_read %12[%c2, %c2], %cst_57 : tensor<16x16xf32>, vector<f32>
      %extracted = tensor.extract %9[%c13, %c8] : tensor<16x16xi1>
      %272 = vector.flat_transpose %266 {columns = 5 : i32, rows = 3 : i32} : vector<15xi32> -> vector<15xi32>
      %273 = vector.extract_strided_slice %44 {offsets = [6, 10], sizes = [7, 5], strides = [1, 1]} : vector<16x16x16xi1> to vector<7x5x16xi1>
    }
    %57 = arith.remsi %c1099692294_i32, %c1099692294_i32 : i32
    %58 = math.log10 %17 : tensor<16x16x16xf16>
    %59 = math.log2 %2 : tensor<16x16x16xf16>
    %60 = vector.broadcast %cst_1 : f16 to vector<1xf16>
    %61 = vector.broadcast %true : i1 to vector<1xi1>
    %62 = vector.maskedload %alloc_9[%c10, %c6, %c1], %61, %60 : memref<16x16x16xf16>, vector<1xi1>, vector<1xf16> into vector<1xf16>
    %63 = vector.insertelement %cst_1, %62[%c5 : index] : vector<1xf16>
    %expanded_23 = tensor.expand_shape %2 [[0], [1], [2, 3]] : tensor<16x16x16xf16> into tensor<16x16x16x1xf16>
    %expanded_24 = tensor.expand_shape %16 [[0], [1], [2, 3]] : tensor<16x16x16xf16> into tensor<16x16x16x1xf16>
    %64 = index.casts %true : i1 to index
    %65 = index.sub %c4, %c9
    %66 = vector.broadcast %c1376839441_i32 : i32 to vector<16x16xi32>
    %dest, %accumulated_value = vector.scan <minui>, %45, %66 {inclusive = true, reduction_dim = 1 : i64} : vector<16x16x16xi32>, vector<16x16xi32>
    memref.assume_alignment %alloc_17, 2 : memref<16x16x16xf32>
    %67 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<add>} %60, %62, %cst_4 : vector<1xf16>, vector<1xf16> into f16
    %68 = arith.minsi %c-17004_i16, %c-17004_i16 : i16
    %69 = vector.create_mask %c6, %c5 : vector<16x16xi1>
    %from_elements = tensor.from_elements %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64, %c1653018709_i64 : tensor<16x16xi64>
    %70 = bufferization.clone %alloc_18 : memref<16x1xf16> to memref<16x1xf16>
    %71 = math.floor %cst_4 : f16
    %72 = math.log10 %2 : tensor<16x16x16xf16>
    %73 = arith.remf %cst_4, %cst_1 : f16
    %74 = bufferization.clone %alloc_5 : memref<16x16x16xf16> to memref<16x16x16xf16>
    %75 = arith.ceildivsi %c1376839441_i32, %c1026596729_i32 : i32
    %76 = index.sub %c8, %c8
    %77 = index.add %c15, %c0
    %78 = arith.divsi %c1653018709_i64, %c1653018709_i64 : i64
    %79 = arith.muli %c1376839441_i32, %c1026596729_i32 : i32
    %80 = index.sizeof
    %81 = index.add %c8, %c4
    %82 = bufferization.to_memref %23 : memref<f16>
    %83 = vector.bitcast %20 : vector<16xf32> to vector<16xi32>
    bufferization.dealloc_tensor %11 : tensor<15xi32>
    %84 = index.maxs %c15, %52
    %85 = index.add %c10, %47
    memref.copy %alloc_14, %alloc_6 : memref<15xi1> to memref<15xi1>
    %splat = tensor.splat %c-60_i16 : tensor<16x16xi16>
    %expanded_25 = tensor.expand_shape %2 [[0], [1], [2, 3]] : tensor<16x16x16xf16> into tensor<16x16x16x1xf16>
    %86 = arith.ori %c7286_i16, %c2074_i16 : i16
    %87 = affine.apply affine_map<(d0) -> (d0 * -64)>(%c5)
    %88 = memref.realloc %alloc_10 : memref<15xi64> to memref<15xi64>
    %89 = math.round %0 : tensor<16x16x16xf32>
    %90 = math.ctlz %c1653018709_i64 : i64
    %91 = math.powf %cst, %cst_2 : f32
    %92 = vector.broadcast %true : i1 to vector<16x16x16x16xi1>
    %93 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2, d3, d4) -> (d4, d0, d1)>, affine_map<(d0, d1, d2, d3, d4) -> (d4, d2, d3)>, affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3)>], iterator_types = ["parallel", "parallel", "parallel", "parallel", "reduction"], kind = #vector.kind<mul>} %44, %44, %92 : vector<16x16x16xi1>, vector<16x16x16xi1> into vector<16x16x16x16xi1>
    %94 = math.atan2 %cst_4, %cst_4 : f16
    %95 = index.castu %c9 : index to i32
    %96 = index.maxu %c4, %c11
    %97 = vector.create_mask %42, %rank : vector<16x16xi1>
    %c394555334_i32 = arith.constant 394555334 : i32
    %98 = vector.load %alloc_7[%c12] : memref<15xf16>, vector<16x16x16xf16>
    %99 = index.add %c13, %85
    %100 = math.ctpop %11 : tensor<15xi32>
    %101 = vector.broadcast %cst_4 : f16 to vector<16x16xf16>
    %dest_26, %accumulated_value_27 = vector.scan <add>, %98, %101 {inclusive = false, reduction_dim = 1 : i64} : vector<16x16x16xf16>, vector<16x16xf16>
    %102 = bufferization.to_memref %cast : memref<?x?xf16>
    affine.for %arg2 = 0 to 76 {
    }
    %103 = arith.divsi %false, %true : i1
    %104 = arith.minui %true, %false : i1
    %105 = index.ceildivu %64, %65
    %106 = tensor.empty() : tensor<16x16x16xf16>
    %mapped = linalg.map ins(%2 : tensor<16x16x16xf16>) outs(%106 : tensor<16x16x16xf16>)
      (%in: f16) {
        %expanded_52 = tensor.expand_shape %0 [[0], [1], [2, 3]] : tensor<16x16x16xf32> into tensor<16x16x16x1xf32>
        %246 = math.cttz %11 : tensor<15xi32>
        %247 = math.fpowi %in, %c1026596729_i32 : f16, i32
        %cst_53 = arith.constant 0x4E044918 : f32
        %248 = math.powf %cst_2, %cst_3 : f32
        %249 = vector.bitcast %31 : vector<15xf32> to vector<15xi32>
        %250 = math.log10 %0 : tensor<16x16x16xf32>
        %251 = arith.minf %cst, %cst_2 : f32
        %252 = vector.broadcast %cst_1 : f16 to vector<16x16xf16>
        %dest_54, %accumulated_value_55 = vector.scan <minf>, %98, %252 {inclusive = true, reduction_dim = 2 : i64} : vector<16x16x16xf16>, vector<16x16xf16>
        %alloc_56 = memref.alloc() : memref<16x16x16xi1>
        memref.tensor_store %43, %alloc_56 : memref<16x16x16xi1>
        %253 = affine.load %alloc[%c12, %c10] : memref<16x1xf32>
        %254 = memref.atomic_rmw minf %in, %70[%c7, %c0] : (f16, memref<16x1xf16>) -> f16
        %255 = arith.remui %c-17004_i16, %c-17004_i16 : i16
        %256 = vector.splat %54 : vector<16x16xindex>
        %257 = index.maxu %42, %c2
        %258 = index.casts %c7286_i16 : i16 to index
        %259 = vector.insert %cst_0, %31 [1] : f32 into vector<15xf32>
        %260 = vector.splat %false : vector<15xi1>
        %261 = math.fma %5, %5, %5 : tensor<16x16xf16>
        %262 = bufferization.to_memref %8 : memref<16x16xi1>
        %263 = tensor.empty() : tensor<16x16x16xf32>
        %mapped_57 = linalg.map ins(%7, %0 : tensor<16x16x16xf32>, tensor<16x16x16xf32>) outs(%263 : tensor<16x16x16xf32>)
          (%in_59: f32, %in_60: f32) {
            %273 = vector.create_mask %c14 : vector<15xi1>
            %274 = arith.minsi %c1653018709_i64, %c1653018709_i64 : i64
            %275 = vector.insert %in_60, %30 [2] : f32 into vector<15xf32>
            %276 = index.castu %c5 : index to i32
            %277 = vector.broadcast %true : i1 to vector<16xi1>
            %278 = vector.multi_reduction <mul>, %69, %277 [1] : vector<16x16xi1> to vector<16xi1>
            %279 = arith.maxui %c-17004_i16, %c-17004_i16 : i16
            %280 = bufferization.to_memref %expanded_24 : memref<16x16x16x1xf16>
            %281 = index.ceildivu %54, %c13
            %282 = arith.maxf %in_60, %cst_0 : f32
            %283 = arith.divsi %c1653018709_i64, %c1653018709_i64 : i64
            memref.store %in, %74[%c12, %c5, %c8] : memref<16x16x16xf16>
            %284 = math.log1p %expanded_24 : tensor<16x16x16x1xf16>
            %extracted = tensor.extract %23[] : tensor<f16>
            %expanded_61 = tensor.expand_shape %5 [[0], [1, 2]] : tensor<16x16xf16> into tensor<16x16x1xf16>
            %285 = vector.multi_reduction <mul>, %20, %20 [] : vector<16xf32> to vector<16xf32>
            %286 = index.maxs %99, %258
            %inserted_62 = tensor.insert %true into %10[%c11] : tensor<15xi1>
            %287 = math.powf %0, %263 : tensor<16x16x16xf32>
            %288 = arith.maxsi %c1026596729_i32, %c1376839441_i32 : i32
            vector.print %60 : vector<1xf16>
            %289 = math.ctlz %9 : tensor<16x16xi1>
            %290 = arith.remui %c1099692294_i32, %c1026596729_i32 : i32
            %291 = arith.minui %c-60_i16, %c7286_i16 : i16
            %292 = math.round %cst_0 : f32
            %cst_63 = arith.constant 1.000000e+00 : f16
            %293 = vector.transfer_read %14[%42, %77, %25], %cst_63 : tensor<16x16x16xf16>, vector<f16>
            %294 = bufferization.to_memref %4 : memref<16x16xi32>
            %dest_64, %accumulated_value_65 = vector.scan <add>, %97, %277 {inclusive = false, reduction_dim = 1 : i64} : vector<16x16xi1>, vector<16xi1>
            %295 = index.maxs %c11, %77
            memref.assume_alignment %alloc_13, 8 : memref<16x1xi32>
            %296 = arith.addi %c1653018709_i64, %c1653018709_i64 : i64
            %297 = math.exp2 %expanded : tensor<16x16x16x1xf16>
            %298 = index.divu %80, %c4
            %cst_66 = arith.constant 1.000000e+00 : f32
            linalg.yield %cst_66 : f32
          }
        %c-25867_i16 = arith.constant -25867 : i16
        %264 = arith.remsi %c7286_i16, %c2074_i16 : i16
        %265 = math.ipowi %false, %true : i1
        %266 = vector.extract_strided_slice %98 {offsets = [10], sizes = [1], strides = [1]} : vector<16x16x16xf16> to vector<1x16x16xf16>
