module {
  func.func nested @func1(%arg0: vector<14xi64>, %arg1: i16, %arg2: tensor<16x16x14xf16>) {
    %cst = arith.constant 6.224000e+04 : f16
    %c1676342753_i64 = arith.constant 1676342753 : i64
    %false = arith.constant false
    %true = arith.constant true
    %c24348_i16 = arith.constant 24348 : i16
    %c-20547_i16 = arith.constant -20547 : i16
    %cst_0 = arith.constant 0x4D7EFDC1 : f32
    %true_1 = arith.constant true
    %c2052943229_i32 = arith.constant 2052943229 : i32
    %c1212773757_i64 = arith.constant 1212773757 : i64
    %true_2 = arith.constant true
    %c32214_i16 = arith.constant 32214 : i16
    %c988780503_i64 = arith.constant 988780503 : i64
    %cst_3 = arith.constant 4.998400e+04 : f16
    %cst_4 = arith.constant 3.907200e+04 : f16
    %c30443_i16 = arith.constant 30443 : i16
    %0 = tensor.empty() : tensor<14xi16>
    %1 = tensor.empty() : tensor<14xi32>
    %2 = tensor.empty() : tensor<16x16x14xf16>
    %3 = tensor.empty() : tensor<16x16x14xi1>
    %4 = tensor.empty() : tensor<6xi32>
    %5 = tensor.empty() : tensor<14xf16>
    %6 = tensor.empty() : tensor<14xi64>
    %7 = tensor.empty() : tensor<14xi1>
    %8 = tensor.empty() : tensor<14xi32>
    %9 = tensor.empty() : tensor<6xi1>
    %10 = tensor.empty() : tensor<16x16x14xi32>
    %11 = tensor.empty() : tensor<14xi1>
    %12 = tensor.empty() : tensor<16x16x14xi64>
    %13 = tensor.empty() : tensor<16x16x14xi64>
    %14 = tensor.empty() : tensor<16x16x14xf32>
    %15 = tensor.empty() : tensor<14xi64>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<14xi16>
    %alloc_5 = memref.alloc() : memref<14xi32>
    %alloc_6 = memref.alloc() : memref<14xf16>
    %alloc_7 = memref.alloc() : memref<6xi64>
    %alloc_8 = memref.alloc() : memref<14xf16>
    %alloc_9 = memref.alloc() : memref<14xf32>
    %alloc_10 = memref.alloc() : memref<16x16x14xi16>
    %alloc_11 = memref.alloc() : memref<6xf16>
    %alloc_12 = memref.alloc() : memref<16x16x14xi1>
    %alloc_13 = memref.alloc() : memref<14xi64>
    %alloc_14 = memref.alloc() : memref<14xi64>
    %alloc_15 = memref.alloc() : memref<14xi64>
    %alloc_16 = memref.alloc() : memref<14xi1>
    %alloc_17 = memref.alloc() : memref<14xi64>
    %alloc_18 = memref.alloc() : memref<14xf32>
    %alloc_19 = memref.alloc() : memref<14xi32>
    %16 = tensor.empty() : tensor<14xi1>
    %17 = linalg.copy ins(%11 : tensor<14xi1>) outs(%16 : tensor<14xi1>) -> tensor<14xi1>
    %alloc_20 = memref.alloc() : memref<6xi32>
    linalg.transpose ins(%4 : tensor<6xi32>) outs(%alloc_20 : memref<6xi32>) permutation = [0] 
    %alloc_21 = memref.alloc() : memref<f16>
    linalg.reduce ins(%alloc_8 : memref<14xf16>) outs(%alloc_21 : memref<f16>) dimensions = [0] 
      (%in: f16, %init: f16) {
        %271 = vector.broadcast %c30443_i16 : i16 to vector<16x16x14xi16>
        %272 = vector.transpose %271, [1, 2, 0] : vector<16x16x14xi16> to vector<16x14x16xi16>
        %generated_42 = tensor.generate %c4, %c13 {
        ^bb0(%arg3: index, %arg4: index, %arg5: index):
          %279 = arith.divf %cst, %cst : f16
          %280 = index.maxs %c6, %c7
          %281 = bufferization.to_tensor %alloc_11 : memref<6xf16>
          %282 = vector.broadcast %c1676342753_i64 : i64 to vector<6xi64>
          %283 = vector.reduction <minui>, %282 : vector<6xi64> into i64
          tensor.yield %c2052943229_i32 : i32
        } : tensor<?x?x14xi32>
        %273 = vector.broadcast %c-20547_i16 : i16 to vector<3xi16>
        %274 = vector.reduction <and>, %273 : vector<3xi16> into i16
        %275 = arith.remsi %c32214_i16, %c32214_i16 : i16
        %alloc_43 = memref.alloc() : memref<14xi16>
        memref.copy %alloc, %alloc_43 : memref<14xi16> to memref<14xi16>
        %276 = index.castu %c15 : index to i32
        %277 = vector.extract %271[14] : vector<16x16x14xi16>
        %278 = memref.load %alloc_21[] : memref<f16>
        %cst_44 = arith.constant 1.000000e+00 : f16
        linalg.yield %cst_44 : f16
      }
    scf.parallel (%arg3) = (%c1) to (%c8) step (%c4) {
      %271 = vector.broadcast %cst : f16 to vector<1xf16>
      %272 = vector.broadcast %cst : f16 to vector<1xf16>
      %273 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %271, %272, %cst : vector<1xf16>, vector<1xf16> into f16
      scf.index_switch %c10 
      case 1 {
        %extracted = tensor.extract %6[%c3] : tensor<14xi64>
        %291 = bufferization.to_memref %3 : memref<16x16x14xi1>
        %292 = arith.cmpf oge, %cst_4, %cst : f16
        %293 = math.absf %2 : tensor<16x16x14xf16>
        %294 = vector.broadcast %c2052943229_i32 : i32 to vector<i32>
        %295 = vector.transfer_write %294, %10[%c4, %c13, %c4] : vector<i32>, tensor<16x16x14xi32>
        %296 = index.floordivs %c14, %c9
        %297 = arith.minf %cst_4, %cst_3 : f16
        %298 = arith.remui %c1212773757_i64, %c1676342753_i64 : i64
        %299 = math.cttz %15 : tensor<14xi64>
        %300 = index.castu %c14 : index to i32
        %c1434327458_i64 = arith.constant 1434327458 : i64
        %301 = arith.shli %c2052943229_i32, %c2052943229_i32 : i32
        %302 = arith.ceildivsi %true_1, %true_1 : i1
        %303 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<mul>} %271, %271, %cst_3 : vector<1xf16>, vector<1xf16> into f16
        %304 = arith.remui %c32214_i16, %c32214_i16 : i16
        %305 = arith.divf %cst, %cst_3 : f16
        scf.yield
      }
      case 2 {
        %291 = math.cttz %0 : tensor<14xi16>
        %292 = arith.divsi %c988780503_i64, %c1676342753_i64 : i64
        %293 = math.fpowi %2, %10 : tensor<16x16x14xf16>, tensor<16x16x14xi32>
        %cst_44 = arith.constant 1.000000e+00 : f32
        %294 = vector.transfer_read %alloc_9[%c5], %cst_44 : memref<14xf32>, vector<f32>
        %295 = index.ceildivu %c6, %c5
        %collapsed_45 = tensor.collapse_shape %2 [[0, 1], [2]] : tensor<16x16x14xf16> into tensor<256x14xf16>
        %296 = arith.xori %c24348_i16, %c30443_i16 : i16
        %297 = vector.splat %cst_44 : vector<14xf32>
        %298 = arith.cmpi eq, %false, %false : i1
        %299 = arith.minui %false, %true_1 : i1
        %300 = math.fpowi %5, %8 : tensor<14xf16>, tensor<14xi32>
        %301 = bufferization.to_tensor %alloc_6 : memref<14xf16>
        %302 = arith.shrui %c32214_i16, %c24348_i16 : i16
        %303 = math.exp2 %301 : tensor<14xf16>
        %304 = arith.remf %cst_4, %cst_3 : f16
        %305 = tensor.empty() : tensor<16x16x14xi16>
        scf.yield
      }
      default {
        %291 = index.casts %c11 : index to i32
        %292 = vector.bitcast %271 : vector<1xf16> to vector<1xf16>
        %293 = affine.max affine_map<(d0, d1) -> (d0 mod 8 - 2, d0 mod 8 - 2)>(%c3, %c4)
        %294 = tensor.empty(%c7) : tensor<?xi32>
        %295 = arith.remui %c2052943229_i32, %c2052943229_i32 : i32
        memref.tensor_store %5, %alloc_6 : memref<14xf16>
        memref.assume_alignment %alloc_20, 16 : memref<6xi32>
        %expanded_44 = tensor.expand_shape %5 [[0, 1]] : tensor<14xf16> into tensor<14x1xf16>
        %296 = vector.broadcast %cst : f16 to vector<16x16x14xf16>
        %297 = vector.splat %c13 : vector<6xindex>
        %298 = tensor.empty(%c7) : tensor<?xf16>
        %299 = math.ceil %14 : tensor<16x16x14xf32>
        %300 = memref.realloc %alloc_19 : memref<14xi32> to memref<6xi32>
        %301 = arith.andi %false, %true : i1
        %302 = index.divs %c4, %c4
        %303 = vector.broadcast %c6 : index to vector<16xindex>
        %304 = vector.broadcast %false : i1 to vector<16xi1>
        %305 = vector.broadcast %c2052943229_i32 : i32 to vector<16xi32>
        vector.scatter %alloc_5[%c9] [%303], %304, %305 : memref<14xi32>, vector<16xindex>, vector<16xi1>, vector<16xi32>
      }
      %274 = index.mul %c14, %c3
      %275 = vector.reduction <mul>, %271 : vector<1xf16> into f16
      %276 = math.roundeven %cst : f16
      %277 = memref.alloca_scope  -> (i64) {
        %291 = vector.transpose %271, [0] : vector<1xf16> to vector<1xf16>
        %292 = vector.broadcast %true_1 : i1 to vector<i1>
        %293 = vector.transfer_write %292, %7[%c6] : vector<i1>, tensor<14xi1>
        bufferization.dealloc_tensor %7 : tensor<14xi1>
        %294 = vector.insert %cst, %271 [0] : f16 into vector<1xf16>
        %295 = vector.bitcast %271 : vector<1xf16> to vector<1xf16>
        %296 = arith.maxf %cst, %cst_4 : f16
        %297 = vector.insert %cst_3, %271 [0] : f16 into vector<1xf16>
        %298 = arith.cmpi eq, %true, %true_1 : i1
        %299 = vector.flat_transpose %271 {columns = 1 : i32, rows = 1 : i32} : vector<1xf16> -> vector<1xf16>
        %300 = math.tan %cst : f16
        %301 = arith.floordivsi %c988780503_i64, %c988780503_i64 : i64
        %302 = arith.maxf %cst_3, %cst_3 : f16
        %303 = vector.insert %cst_4, %299 [0] : f16 into vector<1xf16>
        %304 = index.floordivs %c11, %c6
        %305 = vector.shuffle %292, %292 [0, 1] : vector<i1>, vector<i1>
        %collapsed_44 = tensor.collapse_shape %2 [[0, 1], [2]] : tensor<16x16x14xf16> into tensor<256x14xf16>
        %306 = math.absi %9 : tensor<6xi1>
        %307 = affine.apply affine_map<(d0, d1, d2) -> (d1 ceildiv 64)>(%c14, %274, %274)
        %308 = index.sizeof
        %309 = arith.remf %cst_3, %cst_4 : f16
        %310 = math.powf %2, %2 : tensor<16x16x14xf16>
        %311 = arith.shrsi %c-20547_i16, %c-20547_i16 : i16
        %312 = vector.load %alloc_10[%c9, %c2, %c13] : memref<16x16x14xi16>, vector<6xi16>
        %313 = affine.load %alloc_13[%c7] : memref<14xi64>
        %314 = math.ceil %cst_0 : f32
        %315 = vector.bitcast %299 : vector<1xf16> to vector<1xf16>
        %316 = math.cos %2 : tensor<16x16x14xf16>
        %collapsed_45 = tensor.collapse_shape %14 [[0, 1], [2]] : tensor<16x16x14xf32> into tensor<256x14xf32>
        %317 = math.log10 %cst_3 : f16
        %318 = math.round %14 : tensor<16x16x14xf32>
        %319 = index.castu %c24348_i16 : i16 to index
        %320 = index.floordivs %c9, %c6
        memref.alloca_scope.return %c1676342753_i64 : i64
      }
      %alloc_42 = memref.alloc() : memref<16x16x14xf16>
      %278 = tensor.empty() : tensor<14x16xi1>
      %279 = tensor.empty() : tensor<16x14xi1>
      %alloc_43 = memref.alloc() : memref<16xi1>
      %280 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%278, %279, %alloc_43 : tensor<14x16xi1>, tensor<16x14xi1>, memref<16xi1>) outs(%3 : tensor<16x16x14xi1>) {
      ^bb0(%in: i1, %in_44: i1, %in_45: i1, %out: i1):
        %291 = math.ctpop %9 : tensor<6xi1>
        %292 = arith.shli %out, %true_1 : i1
        %293 = arith.maxf %cst_4, %cst : f16
        %294 = arith.remf %cst_3, %cst_4 : f16
        %295 = index.sizeof
        %296 = math.floor %2 : tensor<16x16x14xf16>
        %297 = vector.extract %271[0] : vector<1xf16>
        memref.store %c1212773757_i64, %alloc_17[%c6] : memref<14xi64>
        %298 = vector.broadcast %cst_0 : f32 to vector<6xf32>
        %299 = vector.fma %298, %298, %298 : vector<6xf32>
        %false_46 = index.bool.constant false
        %alloc_47 = memref.alloc() : memref<14xi32>
        %300 = vector.broadcast %274 : index to vector<3xindex>
        %301 = vector.broadcast %in_45 : i1 to vector<3xi1>
        vector.scatter %alloc_16[%c13] [%300], %301, %301 : memref<14xi1>, vector<3xindex>, vector<3xi1>, vector<3xi1>
        memref.store %c1212773757_i64, %alloc_14[%c1] : memref<14xi64>
        %302 = index.ceildivs %arg3, %c12
        %303 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minf>} %298, %298, %cst_0 : vector<6xf32>, vector<6xf32> into f32
        %304 = math.exp2 %cst_0 : f32
        %305 = arith.maxf %cst_4, %cst_4 : f16
        %306 = math.absi %9 : tensor<6xi1>
        %307 = math.log1p %cst_0 : f32
        %308 = math.round %cst_4 : f16
        %309 = vector.insert %cst_0, %299 [1] : f32 into vector<6xf32>
        %310 = arith.addi %in_45, %out : i1
        %311 = math.absf %cst_3 : f16
        %312 = index.ceildivs %c12, %295
        %313 = arith.divf %cst_4, %cst : f16
        %314 = vector.broadcast %c13 : index to vector<3xindex>
        %315 = vector.broadcast %true_2 : i1 to vector<3xi1>
        %316 = vector.broadcast %c2052943229_i32 : i32 to vector<3xi32>
        vector.scatter %alloc_20[%c4] [%314], %315, %316 : memref<6xi32>, vector<3xindex>, vector<3xi1>, vector<3xi32>
        %317 = affine.load %alloc_11[%c11] : memref<6xf16>
        %318 = math.atan %14 : tensor<16x16x14xf32>
        %319 = index.divs %c8, %c6
        %320 = arith.maxui %false_46, %in_45 : i1
        %321 = arith.shrui %c-20547_i16, %c30443_i16 : i16
        %322 = math.log2 %2 : tensor<16x16x14xf16>
        linalg.yield %in_45 : i1
      } -> tensor<16x16x14xi1>
      %281 = vector.broadcast %c2052943229_i32 : i32 to vector<i32>
      %282 = vector.transfer_write %281, %8[%c1] : vector<i32>, tensor<14xi32>
      %283 = arith.shrsi %true, %true_2 : i1
      %284 = math.powf %2, %2 : tensor<16x16x14xf16>
      %285 = math.fma %cst, %cst_4, %cst_3 : f16
      %286 = arith.floordivsi %true, %false : i1
      %287 = math.rsqrt %cst_3 : f16
      %288 = math.floor %5 : tensor<14xf16>
      %289 = vector.broadcast %cst_4 : f16 to vector<1x1xf16>
      %290 = vector.outerproduct %271, %271, %289 {kind = #vector.kind<add>} : vector<1xf16>, vector<1xf16>
      scf.yield
    }
    %18 = affine.vector_load %alloc_13[%c14] : memref<14xi64>, vector<3xi64>
    affine.vector_store %18, %alloc_7[%c0] : memref<6xi64>, vector<3xi64>
    %alloc_22 = memref.alloc() : memref<6xf16>
    %19 = tensor.empty() : tensor<f16>
    %20 = linalg.dot ins(%alloc_11, %alloc_22 : memref<6xf16>, memref<6xf16>) outs(%19 : tensor<f16>) -> tensor<f16>
    %21 = math.tanh %20 : tensor<f16>
    %22 = math.exp2 %2 : tensor<16x16x14xf16>
    %23 = math.log10 %2 : tensor<16x16x14xf16>
    %24 = index.mul %c13, %c3
    %25 = math.floor %14 : tensor<16x16x14xf32>
    %26 = vector.reduction <minsi>, %18 : vector<3xi64> into i64
    %generated = tensor.generate %c5 {
    ^bb0(%arg3: index):
      %271 = vector.extract %18[1] : vector<3xi64>
      %272 = vector.reduction <minsi>, %18 : vector<3xi64> into i64
      %alloca_42 = memref.alloca() : memref<16x16x14xf16>
      %273 = tensor.empty(%c14) : tensor<?xf16>
      tensor.yield %c2052943229_i32 : i32
    } : tensor<?xi32>
    %27 = affine.load %alloc_21[] : memref<f16>
    %28 = index.ceildivs %c5, %c4
    %29 = vector.flat_transpose %18 {columns = 3 : i32, rows = 1 : i32} : vector<3xi64> -> vector<3xi64>
    %30 = index.maxs %c5, %c0
    %31 = arith.remf %27, %cst : f16
    %alloc_23 = memref.alloc() : memref<16x16x14xi32>
    %32 = math.atan %5 : tensor<14xf16>
    %33 = index.ceildivs %c6, %24
    memref.assume_alignment %alloc_16, 8 : memref<14xi1>
    %34 = index.ceildivs %c14, %c8
    %35 = arith.subi %true_1, %true : i1
    %36 = math.roundeven %27 : f16
    %rank = tensor.rank %15 : tensor<14xi64>
    %37 = vector.extract %18[0] : vector<3xi64>
    %38 = vector.broadcast %c2052943229_i32 : i32 to vector<i32>
    %39 = vector.transfer_write %38, %4[%c6] : vector<i32>, tensor<6xi32>
    %40 = vector.broadcast %c988780503_i64 : i64 to vector<3x3xi64>
    %41 = vector.outerproduct %29, %18, %40 {kind = #vector.kind<or>} : vector<3xi64>, vector<3xi64>
    %42 = arith.subi %true_1, %true_1 : i1
    %43 = index.divs %c8, %28
    vector.print %38 : vector<i32>
    %44 = math.tanh %cst_3 : f16
    %45 = math.round %2 : tensor<16x16x14xf16>
    %46 = math.fma %20, %20, %20 : tensor<f16>
    %47 = index.ceildivu %30, %43
    %48 = index.mul %c0, %24
    %49 = arith.cmpf une, %cst_4, %cst : f16
    %50 = vector.transpose %18, [0] : vector<3xi64> to vector<3xi64>
    %51 = index.ceildivs %c9, %24
    %alloc_24 = memref.alloc() : memref<14xf32>
    %52 = vector.matrix_multiply %29, %29 {lhs_columns = 3 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<3xi64>, vector<3xi64>) -> vector<1xi64>
    %53 = arith.shli %c24348_i16, %c24348_i16 : i16
    %54 = arith.ori %c1212773757_i64, %c1676342753_i64 : i64
    %55 = index.castu %28 : index to i32
    %56 = math.round %2 : tensor<16x16x14xf16>
    %57 = vector.broadcast %c988780503_i64 : i64 to vector<i64>
    %58 = vector.transfer_write %57, %15[%c6] : vector<i64>, tensor<14xi64>
    %59 = arith.maxui %c2052943229_i32, %c2052943229_i32 : i32
    %60 = vector.reduction <or>, %18 : vector<3xi64> into i64
    %collapsed = tensor.collapse_shape %14 [[0, 1], [2]] : tensor<16x16x14xf32> into tensor<256x14xf32>
    %61 = arith.cmpf une, %cst, %cst_3 : f16
    %62 = math.ctpop %8 : tensor<14xi32>
    %63 = arith.shrui %c988780503_i64, %c1676342753_i64 : i64
    %64 = arith.minf %cst_3, %cst_3 : f16
    %65 = math.absf %14 : tensor<16x16x14xf32>
    %66 = index.divs %c14, %43
    %67 = vector.reduction <maxui>, %52 : vector<1xi64> into i64
    %68 = arith.remf %cst_3, %cst : f16
    %69 = affine.min affine_map<(d0) -> (((-d0) floordiv 2) * 2, d0)>(%c12)
    %70 = index.add %66, %c0
    %71 = vector.insert %c1676342753_i64, %18 [2] : i64 into vector<3xi64>
    %72 = vector.bitcast %29 : vector<3xi64> to vector<3xi64>
    %73 = vector.extract_strided_slice %72 {offsets = [1], sizes = [1], strides = [1]} : vector<3xi64> to vector<1xi64>
    %74 = affine.apply affine_map<(d0, d1, d2, d3) -> (d0 floordiv 64 - (d3 + 32))>(%c2, %c1, %43, %43)
    %75 = arith.divf %cst, %27 : f16
    %true_25 = index.bool.constant true
    %76 = affine.min affine_map<(d0) -> (-d0)>(%c12)
    %77 = affine.min affine_map<(d0, d1) -> (((d1 - d0) * 2) floordiv 128, (-d0 + 2) floordiv 8, d0 + 4)>(%30, %28)
    %78 = vector.transpose %38, [] : vector<i32> to vector<i32>
    %79 = math.roundeven %2 : tensor<16x16x14xf16>
    %80 = vector.broadcast %cst_0 : f32 to vector<16x16x14xf32>
    %81 = vector.fma %80, %80, %80 : vector<16x16x14xf32>
    %82 = affine.min affine_map<(d0, d1, d2, d3) -> (d3 - d2 - 1, d3 - 1)>(%c9, %c3, %c6, %74)
    %83 = math.absi %4 : tensor<6xi32>
    %84 = vector.extract %80[15] : vector<16x16x14xf32>
    %85 = bufferization.to_tensor %alloc_9 : memref<14xf32>
    %86 = vector.broadcast %cst_0 : f32 to vector<16xf32>
    %87 = vector.multi_reduction <minf>, %80, %86 [1, 2] : vector<16x16x14xf32> to vector<16xf32>
    %88 = arith.addi %c24348_i16, %c-20547_i16 : i16
    %splat = tensor.splat %cst_3 : tensor<16x16x14xf16>
    %89 = tensor.empty() : tensor<14x14xf32>
    %90 = tensor.empty() : tensor<256x14xf32>
    %91 = linalg.matmul ins(%collapsed, %89 : tensor<256x14xf32>, tensor<14x14xf32>) outs(%90 : tensor<256x14xf32>) -> tensor<256x14xf32>
    %92 = index.floordivs %51, %c11
    %93 = vector.reduction <mul>, %29 : vector<3xi64> into i64
    %94 = vector.reduction <add>, %18 : vector<3xi64> into i64
    %95 = bufferization.clone %alloc : memref<14xi16> to memref<14xi16>
    %96 = vector.insert %c1212773757_i64, %52 [0] : i64 into vector<1xi64>
    memref.copy %alloc_18, %alloc_9 : memref<14xf32> to memref<14xf32>
    %97 = vector.shuffle %38, %38 [0, 1] : vector<i32>, vector<i32>
    memref.store %cst_4, %alloc_11[%c2] : memref<6xf16>
    scf.if %true_2 {
      %271 = affine.apply affine_map<(d0, d1, d2, d3) -> (d2 ceildiv 16)>(%34, %c3, %c2, %c14)
      %272 = vector.insertelement %cst_0, %86[%c14 : index] : vector<16xf32>
      %273 = math.ceil %5 : tensor<14xf16>
      %274 = math.ceil %27 : f16
      %rank_42 = tensor.rank %16 : tensor<14xi1>
      %275 = arith.cmpi eq, %c1676342753_i64, %c988780503_i64 : i64
      memref.assume_alignment %alloc_7, 1 : memref<6xi64>
      %276 = arith.cmpi ule, %false, %true_2 : i1
    }
    %98 = arith.remsi %c2052943229_i32, %c2052943229_i32 : i32
    %99 = vector.load %alloc_17[%c2] : memref<14xi64>, vector<14xi64>
    %100 = vector.broadcast %cst_0 : f32 to vector<14xf32>
    %101 = vector.insert %100, %80 [6, 10] : vector<14xf32> into vector<16x16x14xf32>
    %102 = affine.apply affine_map<(d0, d1) -> (d0 ceildiv 8 - (d1 ceildiv 2 + d1 + 8) + d1 ceildiv 2 + d1 + 8 + (d1 ceildiv 2) * 2)>(%66, %30)
    %103 = index.divs %33, %c14
    %104 = vector.load %alloc_10[%c11, %c9, %c2] : memref<16x16x14xi16>, vector<16x16x14xi16>
    %105 = math.tanh %2 : tensor<16x16x14xf16>
    %c637394378_i32 = arith.constant 637394378 : i32
    %106 = math.ctpop %6 : tensor<14xi64>
    %dest, %accumulated_value = vector.scan <maxf>, %80, %84 {inclusive = false, reduction_dim = 1 : i64} : vector<16x16x14xf32>, vector<16x14xf32>
    %c0_i64 = arith.constant 0 : i64
    %107 = vector.transfer_read %alloc_17[%82], %c0_i64 : memref<14xi64>, vector<i64>
    %108 = arith.subi %true_1, %true_25 : i1
    %109 = index.ceildivs %82, %c6
    %110 = vector.broadcast %c30443_i16 : i16 to vector<i16>
    %111 = vector.transfer_write %110, %0[%24] : vector<i16>, tensor<14xi16>
    %112 = vector.bitcast %80 : vector<16x16x14xf32> to vector<16x16x14xf32>
    %113 = arith.divf %cst_4, %cst_4 : f16
    vector.print %80 : vector<16x16x14xf32>
    %114 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} outs(%14 : tensor<16x16x14xf32>) {
    ^bb0(%out: f32):
      %271 = arith.subi %false, %false : i1
      %272 = arith.divf %cst_3, %cst_4 : f16
      %273 = arith.xori %c988780503_i64, %c1212773757_i64 : i64
      %274 = index.castu %51 : index to i32
      %275 = vector.broadcast %c7 : index to vector<6xindex>
      %276 = vector.broadcast %true_2 : i1 to vector<6xi1>
      %277 = vector.broadcast %c2052943229_i32 : i32 to vector<6xi32>
      vector.scatter %alloc_19[%c12] [%275], %276, %277 : memref<14xi32>, vector<6xindex>, vector<6xi1>, vector<6xi32>
      vector.print %100 : vector<14xf32>
      %rank_42 = tensor.rank %9 : tensor<6xi1>
      %278 = arith.negf %cst_3 : f16
      %279 = arith.remsi %false, %false : i1
      %280 = arith.ori %true, %true_25 : i1
      %281 = index.divu %c9, %28
      %282 = index.mul %281, %70
      %283 = vector.load %alloc_18[%c2] : memref<14xf32>, vector<6xf32>
      %284 = arith.minsi %c24348_i16, %c-20547_i16 : i16
      %285 = tensor.empty() : tensor<14xf32>
      %286 = math.ctpop %16 : tensor<14xi1>
      %287 = arith.shrsi %true_1, %true_2 : i1
      %288 = tensor.empty() : tensor<14x16xf32>
      %289 = tensor.empty() : tensor<256x16xf32>
      %290 = linalg.matmul ins(%90, %288 : tensor<256x14xf32>, tensor<14x16xf32>) outs(%289 : tensor<256x16xf32>) -> tensor<256x16xf32>
      %291 = memref.atomic_rmw addf %cst, %alloc_11[%c3] : (f16, memref<6xf16>) -> f16
      %292 = vector.broadcast %69 : index to vector<16xindex>
      %293 = vector.broadcast %true_25 : i1 to vector<16xi1>
      vector.scatter %alloc_9[%c5] [%292], %293, %86 : memref<14xf32>, vector<16xindex>, vector<16xi1>, vector<16xf32>
      %294 = index.add %92, %c8
      %295 = affine.apply affine_map<(d0, d1, d2, d3) -> (d1 - 32)>(%102, %102, %c6, %70)
      %296 = math.expm1 %27 : f16
      %297 = index.ceildivu %c1, %24
      %298 = index.divs %rank_42, %43
      %299 = tensor.empty() : tensor<14xf16>
      %mapped = linalg.map ins(%5, %alloc_8, %alloc_6 : tensor<14xf16>, memref<14xf16>, memref<14xf16>) outs(%299 : tensor<14xf16>)
        (%in: f16, %in_43: f16, %in_44: f16) {
          %309 = vector.extract_strided_slice %18 {offsets = [1], sizes = [2], strides = [1]} : vector<3xi64> to vector<2xi64>
          %310 = math.fpowi %cst_0, %c2052943229_i32 : f32, i32
          %311 = vector.extract %72[2] : vector<3xi64>
          %312 = vector.broadcast %47 : index to vector<6xindex>
          %313 = vector.broadcast %true_1 : i1 to vector<6xi1>
          vector.scatter %alloc_16[%c8] [%312], %313, %313 : memref<14xi1>, vector<6xindex>, vector<6xi1>, vector<6xi1>
          memref.store %c0_i64, %alloc_15[%c9] : memref<14xi64>
          %314 = index.mul %298, %51
          bufferization.dealloc_tensor %4 : tensor<6xi32>
          %315 = arith.remf %cst, %cst_3 : f16
          %316 = index.divs %109, %51
          %317 = affine.apply affine_map<(d0) -> ((d0 * 2) mod 128)>(%rank)
          %318 = index.ceildivs %c8, %c12
          %319 = arith.divf %cst_0, %out : f32
          %inserted = tensor.insert %true into %3[%c14, %c10, %c6] : tensor<16x16x14xi1>
          %320 = bufferization.to_memref %85 : memref<14xf32>
          %collapsed_45 = tensor.collapse_shape %10 [[0, 1], [2]] : tensor<16x16x14xi32> into tensor<256x14xi32>
          %321 = vector.broadcast %cst_0 : f32 to vector<f32>
          vector.transfer_write %321, %320[%70] : vector<f32>, memref<14xf32>
          %322 = index.add %102, %c8
          %323 = affine.max affine_map<(d0, d1) -> (d0 + d0 + (d0 - 8) * 2 - 24 + 4, d1, ((d0 - 8) * 2) mod 8)>(%70, %103)
          memref.tensor_store %6, %alloc_14 : memref<14xi64>
          %324 = arith.remui %c0_i64, %c1676342753_i64 : i64
          %325 = index.maxs %48, %rank_42
          %alloc_46 = memref.alloc() : memref<6xf32>
          %326 = vector.broadcast %true_2 : i1 to vector<14xi1>
          %327 = vector.broadcast %c2052943229_i32 : i32 to vector<14xi32>
          %328 = vector.gather %alloc_46[%322] [%327], %326, %100 : memref<6xf32>, vector<14xi32>, vector<14xi1>, vector<14xf32> into vector<14xf32>
          %329 = arith.divui %c988780503_i64, %c0_i64 : i64
          %330 = math.fma %5, %299, %5 : tensor<14xf16>
          %331 = index.ceildivs %47, %43
          %332 = arith.remf %cst, %in_43 : f16
          %333 = arith.minui %c-20547_i16, %c32214_i16 : i16
          %334 = math.exp %in : f16
          %335 = arith.shrsi %c1212773757_i64, %c1676342753_i64 : i64
          %336 = vector.splat %rank : vector<14xindex>
          %337 = arith.xori %c988780503_i64, %c1212773757_i64 : i64
          %c523532208_i64 = arith.constant 523532208 : i64
          %cst_47 = arith.constant 1.000000e+00 : f16
          linalg.yield %cst_47 : f16
        }
      %300 = vector.broadcast %74 : index to vector<16xindex>
      %301 = vector.broadcast %false : i1 to vector<16xi1>
      %302 = vector.broadcast %c-20547_i16 : i16 to vector<16xi16>
      vector.scatter %alloc_10[%c7, %c15, %c4] [%300], %301, %302 : memref<16x16x14xi16>, vector<16xindex>, vector<16xi1>, vector<16xi16>
      %303 = math.roundeven %splat : tensor<16x16x14xf16>
      %304 = vector.broadcast %true_1 : i1 to vector<16x16x14xi1>
      %305 = vector.broadcast %c2052943229_i32 : i32 to vector<16x16x14xi32>
      %306 = vector.gather %alloc_10[%c13, %82, %74] [%305], %304, %104 : memref<16x16x14xi16>, vector<16x16x14xi32>, vector<16x16x14xi1>, vector<16x16x14xi16> into vector<16x16x14xi16>
      memref.assume_alignment %alloc_17, 2 : memref<14xi64>
      %307 = math.cos %cst_4 : f16
      %c1_i32 = arith.constant 1 : i32
      %308 = vector.transfer_read %1[%rank], %c1_i32 : tensor<14xi32>, vector<i32>
      linalg.yield %out : f32
    } -> tensor<16x16x14xf32>
    %115 = vector.broadcast %cst_4 : f16 to vector<14xf16>
    %116 = vector.broadcast %true_2 : i1 to vector<14xi1>
    %117 = vector.maskedload %alloc_22[%c5], %116, %115 : memref<6xf16>, vector<14xi1>, vector<14xf16> into vector<14xf16>
    %118 = math.round %27 : f16
    %119 = arith.subi %c-20547_i16, %c24348_i16 : i16
    %120 = arith.remui %c32214_i16, %c-20547_i16 : i16
    %121 = index.floordivs %c0, %28
    %122 = arith.maxf %cst_3, %27 : f16
    %123 = arith.ceildivsi %c32214_i16, %c30443_i16 : i16
    %124 = math.powf %85, %85 : tensor<14xf32>
    %125 = math.fpowi %14, %10 : tensor<16x16x14xf32>, tensor<16x16x14xi32>
    %126 = arith.maxui %c-20547_i16, %c32214_i16 : i16
    %127 = tensor.empty() : tensor<16xf32>
    %128 = tensor.empty() : tensor<16x14x16xf32>
    %129 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1)>, affine_map<(d0, d1, d2) -> (d1, d2, d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%127, %128 : tensor<16xf32>, tensor<16x14x16xf32>) outs(%14 : tensor<16x16x14xf32>) {
    ^bb0(%in: f32, %in_42: f32, %out: f32):
      %271 = math.round %85 : tensor<14xf32>
      %272 = index.sub %c5, %70
      %273 = bufferization.to_tensor %alloc_8 : memref<14xf16>
      %274 = arith.maxf %out, %cst_0 : f32
      %275 = math.absf %20 : tensor<f16>
      %dest_43, %accumulated_value_44 = vector.scan <add>, %112, %84 {inclusive = true, reduction_dim = 1 : i64} : vector<16x16x14xf32>, vector<16x14xf32>
      %276 = arith.cmpi ult, %c-20547_i16, %c32214_i16 : i16
      %277 = vector.broadcast %c2052943229_i32 : i32 to vector<14xi32>
      %278 = vector.maskedload %alloc_20[%c0], %116, %277 : memref<6xi32>, vector<14xi1>, vector<14xi32> into vector<14xi32>
      %279 = math.ceil %273 : tensor<14xf16>
      %280 = affine.for %arg3 = 0 to 31 iter_args(%arg4 = %alloc_5) -> (memref<14xi32>) {
        affine.yield %alloc_5 : memref<14xi32>
      }
      %alloc_45 = memref.alloc() : memref<16x16x14xi1>
      %281 = affine.max affine_map<(d0, d1) -> (d0 - 2, 1, d1 - 8, -d1 - 36)>(%c6, %66)
      %282 = arith.remsi %true_2, %true_25 : i1
      %283 = vector.shuffle %99, %99 [1, 3, 5, 7, 10, 11, 16, 17, 18, 19, 20, 21, 22, 24, 26] : vector<14xi64>, vector<14xi64>
      %284 = vector.multi_reduction <mul>, %117, %cst_4 [0] : vector<14xf16> to f16
      %285 = affine.for %arg3 = 0 to 114 iter_args(%arg4 = %90) -> (tensor<256x14xf32>) {
        affine.yield %arg4 : tensor<256x14xf32>
      }
      %collapsed_46 = tensor.collapse_shape %splat [[0, 1], [2]] : tensor<16x16x14xf16> into tensor<256x14xf16>
      %alloca_47 = memref.alloca() : memref<16x16x14xf16>
      %286 = arith.subi %c1212773757_i64, %c1676342753_i64 : i64
      %287 = vector.insert %c0_i64, %99 [12] : i64 into vector<14xi64>
      %288 = bufferization.to_tensor %alloc_11 : memref<6xf16>
      %289 = vector.broadcast %true_2 : i1 to vector<14x14xi1>
      %290 = vector.outerproduct %116, %116, %289 {kind = #vector.kind<maxsi>} : vector<14xi1>, vector<14xi1>
      %291 = index.divs %102, %281
      %292 = arith.cmpi sgt, %true_1, %true_25 : i1
      %293 = math.ctlz %true_1 : i1
      %294 = index.sizeof
      %alloc_48 = memref.alloc() : memref<16xf16>
      %295 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>, affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_6, %2, %alloc_48 : memref<14xf16>, tensor<16x16x14xf16>, memref<16xf16>) outs(%2 : tensor<16x16x14xf16>) {
      ^bb0(%in_49: f16, %in_50: f16, %in_51: f16, %out_52: f16):
        %300 = arith.divf %in_51, %cst : f16
        %301 = vector.reduction <mul>, %73 : vector<1xi64> into i64
        %302 = math.expm1 %in_49 : f16
        %303 = index.divs %rank, %121
        %304 = math.log10 %85 : tensor<14xf32>
        %305 = vector.broadcast %c5 : index to vector<16xindex>
        %306 = vector.broadcast %true_25 : i1 to vector<16xi1>
        %307 = vector.broadcast %c1676342753_i64 : i64 to vector<16xi64>
        vector.scatter %alloc_15[%c9] [%305], %306, %307 : memref<14xi64>, vector<16xindex>, vector<16xi1>, vector<16xi64>
        %from_elements = tensor.from_elements %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32, %c2052943229_i32 : tensor<14xi32>
        %308 = vector.broadcast %c7 : index to vector<14xindex>
        vector.scatter %alloc_19[%c12] [%308], %116, %278 : memref<14xi32>, vector<14xindex>, vector<14xi1>, vector<14xi32>
        %309 = bufferization.to_memref %13 : memref<16x16x14xi64>
        %310 = affine.apply affine_map<(d0, d1) -> (d0 ceildiv 8 - (d1 ceildiv 2 + d1 + 8) + d1 ceildiv 2 + d1 + 8 + (d1 ceildiv 2) * 2)>(%51, %c15)
        %311 = arith.cmpi slt, %true_2, %true_2 : i1
        memref.store %c2052943229_i32, %alloc_19[%c8] : memref<14xi32>
        %312 = index.ceildivs %c6, %109
        %expanded_53 = tensor.expand_shape %7 [[0, 1]] : tensor<14xi1> into tensor<14x1xi1>
        memref.tensor_store %3, %alloc_12 : memref<16x16x14xi1>
        %313 = arith.shrui %c1212773757_i64, %c1212773757_i64 : i64
        %rank_54 = tensor.rank %9 : tensor<6xi1>
        %alloc_55 = memref.alloc() : memref<16x16x14xi32>
        memref.tensor_store %10, %alloc_55 : memref<16x16x14xi32>
        %314 = arith.remf %out, %cst_0 : f32
        %315 = arith.remf %out_52, %284 : f16
        %316 = vector.transpose %18, [0] : vector<3xi64> to vector<3xi64>
        %317 = arith.xori %c32214_i16, %c24348_i16 : i16
        %318 = arith.addi %c-20547_i16, %c-20547_i16 : i16
        %319 = math.tan %out_52 : f16
        %320 = arith.andi %c-20547_i16, %c32214_i16 : i16
        %321 = math.log10 %collapsed : tensor<256x14xf32>
        %c588086567_i32 = arith.constant 588086567 : i32
        %322 = vector.broadcast %c1212773757_i64 : i64 to vector<16xi64>
        %323 = vector.broadcast %true_1 : i1 to vector<16xi1>
        %324 = vector.maskedload %alloc_14[%c7], %323, %322 : memref<14xi64>, vector<16xi1>, vector<16xi64> into vector<16xi64>
        %325 = math.ipowi %true_2, %true : i1
        %326 = vector.broadcast %c2052943229_i32 : i32 to vector<6xi32>
        %327 = vector.broadcast %true : i1 to vector<6xi1>
        %328 = vector.gather %10[%102, %66, %109] [%326], %327, %326 : tensor<16x16x14xi32>, vector<6xi32>, vector<6xi1>, vector<6xi32> into vector<6xi32>
        memref.tensor_store %12, %309 : memref<16x16x14xi64>
        %329 = affine.min affine_map<(d0) -> (d0 + 48, 0)>(%c15)
        linalg.yield %cst_3 : f16
      } -> tensor<16x16x14xf16>
      %296 = index.divu %69, %c15
      %297 = index.divs %70, %82
      vector.print %29 : vector<3xi64>
      %298 = tensor.empty() : tensor<16x16x14xi64>
      %299 = bufferization.clone %alloc_13 : memref<14xi64> to memref<14xi64>
      linalg.yield %in : f32
    } -> tensor<16x16x14xf32>
    %130 = math.fma %20, %20, %20 : tensor<f16>
    %131 = arith.maxui %c24348_i16, %c24348_i16 : i16
    %132 = vector.bitcast %18 : vector<3xi64> to vector<3xi64>
    %133 = arith.remsi %true, %true : i1
    memref.tensor_store %7, %alloc_16 : memref<14xi1>
    %alloca = memref.alloca() : memref<14xi64>
    %134 = tensor.empty() : tensor<14x3xf32>
    %135 = tensor.empty() : tensor<256x3xf32>
    %136 = linalg.matmul ins(%collapsed, %134 : tensor<256x14xf32>, tensor<14x3xf32>) outs(%135 : tensor<256x3xf32>) -> tensor<256x3xf32>
    %137 = arith.maxsi %c-20547_i16, %c32214_i16 : i16
    %138 = bufferization.to_tensor %alloc_7 : memref<6xi64>
    %true_26 = arith.constant true
    %139 = vector.insert %100, %81 [3, 14] : vector<14xf32> into vector<16x16x14xf32>
    %140 = index.maxu %69, %28
    %141 = vector.broadcast %cst_0 : f32 to vector<16x14x16x14xf32>
    %142 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2, d3, d4) -> (d4, d0, d1)>, affine_map<(d0, d1, d2, d3, d4) -> (d4, d2, d3)>, affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3)>], iterator_types = ["parallel", "parallel", "parallel", "parallel", "reduction"], kind = #vector.kind<mul>} %81, %112, %141 : vector<16x16x14xf32>, vector<16x16x14xf32> into vector<16x14x16x14xf32>
    %143 = index.sub %76, %82
    %144 = arith.andi %c24348_i16, %c24348_i16 : i16
    %145 = math.floor %cst : f16
    %146 = vector.broadcast %47 : index to vector<16xindex>
    %147 = vector.broadcast %true_2 : i1 to vector<16xi1>
    %148 = vector.broadcast %cst_4 : f16 to vector<16xf16>
    vector.scatter %alloc_11[%c0] [%146], %147, %148 : memref<6xf16>, vector<16xindex>, vector<16xi1>, vector<16xf16>
    %149 = scf.if %false -> (i64) {
      %271 = affine.load %alloc_15[%c5] : memref<14xi64>
      affine.for %arg3 = 0 to 75 {
      }
      %272 = vector.broadcast %271 : i64 to vector<3x3xi64>
      %273 = vector.outerproduct %18, %72, %272 {kind = #vector.kind<or>} : vector<3xi64>, vector<3xi64>
      %274 = arith.maxui %c32214_i16, %c30443_i16 : i16
      vector.print %81 : vector<16x16x14xf32>
      %275 = bufferization.to_memref %0 : memref<14xi16>
      %276 = vector.extract %52[0] : vector<1xi64>
      %277 = tensor.empty() : tensor<3x16xf32>
      %278 = tensor.empty() : tensor<256x16xf32>
      %279 = linalg.matmul ins(%135, %277 : tensor<256x3xf32>, tensor<3x16xf32>) outs(%278 : tensor<256x16xf32>) -> tensor<256x16xf32>
      scf.yield %c1212773757_i64 : i64
    } else {
      %271 = scf.while (%arg3 = %104) : (vector<16x16x14xi16>) -> vector<16x16x14xi16> {
        %rank_42 = tensor.rank %6 : tensor<14xi64>
        %279 = math.tan %14 : tensor<16x16x14xf32>
        %280 = arith.maxui %c1212773757_i64, %c0_i64 : i64
        %281 = arith.xori %true, %true_25 : i1
        %282 = vector.extract_strided_slice %52 {offsets = [0], sizes = [1], strides = [1]} : vector<1xi64> to vector<1xi64>
        %283 = arith.divf %27, %cst_4 : f16
        %284 = math.ctpop %6 : tensor<14xi64>
        %285 = arith.remf %cst, %cst_4 : f16
        scf.condition(%true_1) %104 : vector<16x16x14xi16>
      } do {
      ^bb0(%arg3: vector<16x16x14xi16>):
        %279 = vector.broadcast %cst_0 : f32 to vector<16x16x14xf32>
        %280 = vector.fma %279, %112, %81 : vector<16x16x14xf32>
        memref.store %c-20547_i16, %alloc[%c6] : memref<14xi16>
        %281 = math.powf %20, %20 : tensor<f16>
        %282 = arith.cmpi sge, %true_25, %true_25 : i1
        %283 = arith.shrui %c1212773757_i64, %c1676342753_i64 : i64
        %alloc_42 = memref.alloc() : memref<14xi1>
        %284 = math.expm1 %cst_3 : f16
        %285 = vector.bitcast %100 : vector<14xf32> to vector<14xf32>
        %286 = vector.transpose %112, [1, 0, 2] : vector<16x16x14xf32> to vector<16x16x14xf32>
        %287 = affine.min affine_map<(d0, d1, d2, d3) -> (d2)>(%51, %c2, %143, %77)
        %288 = vector.transpose %116, [0] : vector<14xi1> to vector<14xi1>
        %289 = vector.splat %c13 : vector<16x16x14xindex>
        %alloca_43 = memref.alloca() : memref<16x16x14xi64>
        %290 = affine.apply affine_map<(d0, d1, d2, d3) -> (d2 * 2)>(%c8, %76, %140, %c0)
        %291 = math.floor %cst_0 : f32
        memref.assume_alignment %alloc_19, 8 : memref<14xi32>
        scf.yield %104 : vector<16x16x14xi16>
      }
      %272 = math.fma %5, %5, %5 : tensor<14xf16>
      %273 = arith.ceildivsi %false, %true_25 : i1
      %274 = vector.insertelement %c1212773757_i64, %57[] : vector<i64>
      %275 = arith.divui %c1676342753_i64, %c1676342753_i64 : i64
      %276 = vector.bitcast %80 : vector<16x16x14xf32> to vector<16x16x14xf32>
      %277 = scf.if %false -> (memref<14xi1>) {
        %alloca_42 = memref.alloca() : memref<16x16x14xi16>
        %collapsed_43 = tensor.collapse_shape %collapsed [[0, 1]] : tensor<256x14xf32> into tensor<3584xf32>
        %279 = vector.maskedload %alloc_9[%c2], %116, %100 : memref<14xf32>, vector<14xi1>, vector<14xf32> into vector<14xf32>
        %280 = math.ctpop %false : i1
        %281 = index.add %82, %c15
        %282 = vector.extract %112[1] : vector<16x16x14xf32>
        %283 = memref.atomic_rmw maxf %cst_0, %alloc_9[%c12] : (f32, memref<14xf32>) -> f32
        %284 = index.divs %c3, %76
        scf.yield %alloc_16 : memref<14xi1>
      } else {
        %279 = vector.broadcast %c1212773757_i64 : i64 to vector<1x1xi64>
        %280 = vector.outerproduct %52, %73, %279 {kind = #vector.kind<mul>} : vector<1xi64>, vector<1xi64>
        %281 = arith.divsi %c-20547_i16, %c24348_i16 : i16
        %282 = index.divs %c15, %c1
        %283 = affine.max affine_map<(d0) -> (d0 floordiv 128, d0 + (d0 + 1) ceildiv 4 + 66, d0, (d0 - (d0 + 66) + 1) mod 2 - 8)>(%92)
        %alloca_42 = memref.alloca() : memref<6xi1>
        %284 = math.round %2 : tensor<16x16x14xf16>
        %285 = vector.broadcast %c24348_i16 : i16 to vector<3xi16>
        %286 = vector.broadcast %true_2 : i1 to vector<3xi1>
        %287 = vector.maskedload %alloc_10[%c11, %c5, %c0], %286, %285 : memref<16x16x14xi16>, vector<3xi1>, vector<3xi16> into vector<3xi16>
        %288 = math.fpowi %splat, %10 : tensor<16x16x14xf16>, tensor<16x16x14xi32>
        scf.yield %alloc_16 : memref<14xi1>
      }
      %278 = math.tan %cst : f16
      scf.yield %c1676342753_i64 : i64
    }
    %150 = math.absf %5 : tensor<14xf16>
    %151 = memref.atomic_rmw addf %cst_4, %alloc_8[%c10] : (f16, memref<14xf16>) -> f16
    %152 = affine.for %arg3 = 0 to 13 iter_args(%arg4 = %c15) -> (index) {
      affine.yield %c2 : index
    }
    %153 = arith.shrsi %c24348_i16, %c32214_i16 : i16
    %154 = math.cttz %138 : tensor<6xi64>
    vector.print %73 : vector<1xi64>
    %155 = bufferization.to_tensor %alloc_13 : memref<14xi64>
    %156 = tensor.empty() : tensor<256x14xi32>
    %157 = math.fpowi %90, %156 : tensor<256x14xf32>, tensor<256x14xi32>
    %158 = index.mul %c0, %c11
    %expanded = tensor.expand_shape %11 [[0, 1]] : tensor<14xi1> into tensor<14x1xi1>
    %159 = vector.broadcast %cst_0 : f32 to vector<16x16x14xf32>
    %160 = vector.fma %159, %80, %159 : vector<16x16x14xf32>
    %161 = tensor.empty() : tensor<16x14x16xf16>
    %alloc_27 = memref.alloc() : memref<16x14xf16>
    %162 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1, d2, d0)>, affine_map<(d0, d1, d2) -> (d1, d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%161, %alloc_27 : tensor<16x14x16xf16>, memref<16x14xf16>) outs(%2 : tensor<16x16x14xf16>) {
    ^bb0(%in: f16, %in_42: f16, %out: f16):
      %alloc_43 = memref.alloc() : memref<16x14xf32>
      %271 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1, d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_43 : memref<16x14xf32>) outs(%14 : tensor<16x16x14xf32>) {
      ^bb0(%in_50: f32, %out_51: f32):
        %299 = arith.minui %149, %149 : i64
        %300 = math.rsqrt %5 : tensor<14xf16>
        %301 = memref.atomic_rmw mins %c988780503_i64, %alloc_14[%c3] : (i64, memref<14xi64>) -> i64
        %302 = bufferization.to_memref %6 : memref<14xi64>
        %303 = affine.max affine_map<(d0, d1) -> (d0 floordiv 2, (-(d1 ceildiv 4) - 1) floordiv 4, 0, d1 - d0 floordiv 2 - 1)>(%158, %121)
        %304 = math.atan2 %27, %27 : f16
        %305 = vector.extract_strided_slice %160 {offsets = [0, 11], sizes = [4, 1], strides = [1, 1]} : vector<16x16x14xf32> to vector<4x1x14xf32>
        %306 = math.roundeven %20 : tensor<f16>
        %307 = arith.divsi %false, %true_2 : i1
        %308 = index.divs %c3, %70
        %309 = tensor.empty() : tensor<6xf16>
        %expanded_52 = tensor.expand_shape %6 [[0, 1]] : tensor<14xi64> into tensor<14x1xi64>
        %310 = index.sizeof
        %alloca_53 = memref.alloca() : memref<16x16x14xi1>
        %311 = math.tan %collapsed : tensor<256x14xf32>
        %312 = vector.broadcast %c1212773757_i64 : i64 to vector<3x3xi64>
        %313 = vector.outerproduct %29, %72, %312 {kind = #vector.kind<minsi>} : vector<3xi64>, vector<3xi64>
        %314 = math.cttz %4 : tensor<6xi32>
        %315 = arith.divui %true_2, %true_2 : i1
        %316 = arith.remf %in_42, %cst_4 : f16
        %317 = bufferization.to_memref %1 : memref<14xi32>
        %318 = memref.realloc %alloc_17 : memref<14xi64> to memref<16xi64>
        %319 = vector.broadcast %c24348_i16 : i16 to vector<14xi16>
        %320 = vector.broadcast %c2052943229_i32 : i32 to vector<14xi32>
        %321 = vector.gather %0[%c2] [%320], %116, %319 : tensor<14xi16>, vector<14xi32>, vector<14xi1>, vector<14xi16> into vector<14xi16>
        %322 = arith.maxsi %c0_i64, %c0_i64 : i64
        %323 = math.tan %cst_4 : f16
        %324 = math.powf %in_42, %cst : f16
        %325 = arith.divsi %c30443_i16, %c-20547_i16 : i16
        %326 = math.atan %in : f16
        %327 = index.divs %121, %c11
        %328 = vector.broadcast %in_50 : f32 to vector<16x16xf32>
        %dest_54, %accumulated_value_55 = vector.scan <maxf>, %80, %328 {inclusive = false, reduction_dim = 2 : i64} : vector<16x16x14xf32>, vector<16x16xf32>
        %329 = vector.bitcast %72 : vector<3xi64> to vector<3xi64>
        %330 = vector.broadcast %149 : i64 to vector<14xi64>
        %331 = vector.broadcast %in_50 : f32 to vector<f32>
        vector.transfer_write %331, %alloc_9[%310] : vector<f32>, memref<14xf32>
        linalg.yield %cst_0 : f32
      } -> tensor<16x16x14xf32>
      %272 = index.floordivs %43, %103
      bufferization.dealloc_tensor %0 : tensor<14xi16>
      %generated_44 = tensor.generate %66 {
      ^bb0(%arg3: index):
        %alloca_50 = memref.alloca() : memref<16x16x14xf16>
        %299 = index.mul %c7, %c1
        %dest_51, %accumulated_value_52 = vector.scan <maxf>, %112, %84 {inclusive = true, reduction_dim = 1 : i64} : vector<16x16x14xf32>, vector<16x14xf32>
        %300 = affine.load %alloc_6[%c14] : memref<14xf16>
        tensor.yield %true_1 : i1
      } : tensor<?xi1>
      %273 = affine.load %alloc_6[%c12] : memref<14xf16>
      scf.if %false {
        %expanded_50 = tensor.expand_shape %15 [[0, 1]] : tensor<14xi64> into tensor<14x1xi64>
        %299 = math.log1p %27 : f16
        %300 = arith.xori %c32214_i16, %c32214_i16 : i16
        %301 = arith.cmpi uge, %c0_i64, %149 : i64
        %302 = index.ceildivu %103, %33
        %303 = bufferization.clone %alloc_12 : memref<16x16x14xi1> to memref<16x16x14xi1>
        %304 = math.rsqrt %27 : f16
        %305 = vector.multi_reduction <maxf>, %115, %115 [] : vector<14xf16> to vector<14xf16>
      }
      %274 = memref.realloc %alloc_19 : memref<14xi32> to memref<3xi32>
      %alloc_45 = memref.alloc() : memref<14xi32>
      %275 = vector.broadcast %c1676342753_i64 : i64 to vector<i64>
      %276 = vector.transfer_write %275, %15[%103] : vector<i64>, tensor<14xi64>
      %277 = affine.if affine_set<(d0, d1) : (d0 mod 16 == 0)>(%c5, %c15) -> memref<6xi32> {
        %299 = math.round %90 : tensor<256x14xf32>
        %alloca_50 = memref.alloca() : memref<14xi16>
        %300 = arith.negf %cst_0 : f32
        %301 = vector.multi_reduction <minsi>, %116, %116 [] : vector<14xi1> to vector<14xi1>
        %alloc_51 = memref.alloc() : memref<14xi16>
        %collapsed_52 = tensor.collapse_shape %10 [[0, 1], [2]] : tensor<16x16x14xi32> into tensor<256x14xi32>
        %302 = arith.ceildivsi %c32214_i16, %c-20547_i16 : i16
        %303 = vector.broadcast %false : i1 to vector<16x16x14xi1>
        %304 = vector.broadcast %c2052943229_i32 : i32 to vector<16x16x14xi32>
        %305 = vector.gather %alloc[%33] [%304], %303, %104 : memref<14xi16>, vector<16x16x14xi32>, vector<16x16x14xi1>, vector<16x16x14xi16> into vector<16x16x14xi16>
        affine.yield %alloc_20 : memref<6xi32>
      } else {
        %299 = index.floordivs %102, %82
        memref.store %in, %alloc_6[%c5] : memref<14xf16>
        %300 = arith.cmpi sge, %c32214_i16, %c24348_i16 : i16
        %301 = math.log2 %20 : tensor<f16>
        %302 = arith.maxui %true, %true : i1
        %dest_50, %accumulated_value_51 = vector.scan <minf>, %159, %84 {inclusive = true, reduction_dim = 1 : i64} : vector<16x16x14xf32>, vector<16x14xf32>
        %alloc_52 = memref.alloc() : memref<6xi1>
        %303 = math.sqrt %cst_0 : f32
        affine.yield %alloc_20 : memref<6xi32>
      }
      %dest_46, %accumulated_value_47 = vector.scan <mul>, %112, %84 {inclusive = true, reduction_dim = 0 : i64} : vector<16x16x14xf32>, vector<16x14xf32>
      %alloc_48 = memref.alloc() : memref<14x3xf32>
      %278 = tensor.empty() : tensor<256x3xf32>
      %279 = linalg.matmul ins(%90, %alloc_48 : tensor<256x14xf32>, memref<14x3xf32>) outs(%278 : tensor<256x3xf32>) -> tensor<256x3xf32>
      %280 = arith.addi %149, %149 : i64
      %281 = arith.divf %cst, %cst_4 : f16
      %282 = math.log1p %out : f16
      %283 = math.round %273 : f16
      %collapsed_49 = tensor.collapse_shape %2 [[0, 1], [2]] : tensor<16x16x14xf16> into tensor<256x14xf16>
      %284 = index.sub %48, %rank
      %285 = arith.divsi %c1676342753_i64, %149 : i64
      %286 = math.tanh %out : f16
      %287 = math.exp2 %5 : tensor<14xf16>
      %288 = index.castu %true_2 : i1 to index
      %289 = index.divs %51, %33
      %290 = math.fpowi %in_42, %c2052943229_i32 : f16, i32
      %291 = math.log2 %collapsed_49 : tensor<256x14xf16>
      %292 = index.divs %c0, %109
      %293 = math.sqrt %2 : tensor<16x16x14xf16>
      %294 = arith.addi %true, %true_25 : i1
      %295 = affine.apply affine_map<(d0, d1) -> (d0 ceildiv 8 - (d1 ceildiv 2 + d1 + 8) + d1 ceildiv 2 + d1 + 8 + (d1 ceildiv 2) * 2)>(%103, %47)
      %296 = memref.realloc %alloc_11 : memref<6xf16> to memref<6xf16>
      %297 = index.floordivs %c15, %rank
      %298 = arith.remf %in, %cst : f16
      linalg.yield %273 : f16
    } -> tensor<16x16x14xf16>
    %163 = vector.insertelement %c1676342753_i64, %132[%34 : index] : vector<3xi64>
    %164 = math.floor %85 : tensor<14xf32>
    %165 = math.absi %17 : tensor<14xi1>
    %166 = arith.negf %cst_4 : f16
    %167 = math.log2 %14 : tensor<16x16x14xf32>
