module {
  func.func @func1(%arg0: tensor<8x15x9xi1>) -> f16 {
    %cst = arith.constant 0x4E529D4F : f32
    %c1908153259_i64 = arith.constant 1908153259 : i64
    %cst_0 = arith.constant 1.035200e+04 : f16
    %cst_1 = arith.constant 2.05520102E+9 : f32
    %c564459480_i64 = arith.constant 564459480 : i64
    %cst_2 = arith.constant 1.23726362E+9 : f32
    %false = arith.constant false
    %c1647736072_i64 = arith.constant 1647736072 : i64
    %c27427_i16 = arith.constant 27427 : i16
    %c23984_i16 = arith.constant 23984 : i16
    %cst_3 = arith.constant 2.835200e+04 : f16
    %c606377018_i32 = arith.constant 606377018 : i32
    %cst_4 = arith.constant 5.568000e+04 : f16
    %c1284375718_i64 = arith.constant 1284375718 : i64
    %true = arith.constant true
    %c1069903657_i32 = arith.constant 1069903657 : i32
    %0 = tensor.empty() : tensor<9x15x8xi32>
    %1 = tensor.empty() : tensor<8x15x9xi32>
    %2 = tensor.empty() : tensor<15x1xf32>
    %3 = tensor.empty() : tensor<9x15x8xi16>
    %4 = tensor.empty() : tensor<9x15x8xi32>
    %5 = tensor.empty() : tensor<8x15x9xf32>
    %6 = tensor.empty() : tensor<8x1x15xf16>
    %7 = tensor.empty() : tensor<8x15x9xi64>
    %8 = tensor.empty() : tensor<8x15x9xi16>
    %9 = tensor.empty() : tensor<8x1x15xi16>
    %10 = tensor.empty() : tensor<8x1x15xf32>
    %11 = tensor.empty() : tensor<8x15x9xf16>
    %12 = tensor.empty() : tensor<8x1x15xf32>
    %13 = tensor.empty() : tensor<15x1xi64>
    %14 = tensor.empty() : tensor<15x1xi64>
    %15 = tensor.empty() : tensor<15x1xf16>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<15x1xi64>
    %alloc_5 = memref.alloc() : memref<8x15x9xf32>
    %alloc_6 = memref.alloc() : memref<8x1x15xi64>
    %alloc_7 = memref.alloc() : memref<8x1x15xf32>
    %alloc_8 = memref.alloc() : memref<15x1xi1>
    %alloc_9 = memref.alloc() : memref<9x15x8xf16>
    %alloc_10 = memref.alloc() : memref<8x1x15xf32>
    %alloc_11 = memref.alloc() : memref<15x1xi16>
    %alloc_12 = memref.alloc() : memref<9x15x8xi16>
    %alloc_13 = memref.alloc() : memref<8x1x15xi1>
    %alloc_14 = memref.alloc() : memref<9x15x8xf32>
    %alloc_15 = memref.alloc() : memref<15x1xi32>
    %alloc_16 = memref.alloc() : memref<15x1xi1>
    %alloc_17 = memref.alloc() : memref<9x15x8xi32>
    %alloc_18 = memref.alloc() : memref<8x1x15xi1>
    %alloc_19 = memref.alloc() : memref<15x1xi1>
    %16 = tensor.empty() : tensor<8x15x9xi32>
    %17 = linalg.copy ins(%1 : tensor<8x15x9xi32>) outs(%16 : tensor<8x15x9xi32>) -> tensor<8x15x9xi32>
    %alloc_20 = memref.alloc() : memref<1x15xi32>
    linalg.transpose ins(%alloc_15 : memref<15x1xi32>) outs(%alloc_20 : memref<1x15xi32>) permutation = [1, 0] 
    %18 = tensor.empty() : tensor<8xf32>
    %reduced = linalg.reduce ins(%5 : tensor<8x15x9xf32>) outs(%18 : tensor<8xf32>) dimensions = [1, 2] 
      (%in: f32, %init: f32) {
        %273 = index.maxs %c12, %c0
        %274 = math.log2 %2 : tensor<15x1xf32>
        %275 = math.powf %15, %15 : tensor<15x1xf16>
        %276 = math.absf %6 : tensor<8x1x15xf16>
        %277 = vector.broadcast %c1069903657_i32 : i32 to vector<15x1xi32>
        %278 = vector.broadcast %cst_1 : f32 to vector<8x15x9xf32>
        %279 = vector.fma %278, %278, %278 : vector<8x15x9xf32>
        %280 = index.ceildivs %c8, %c2
        %281 = vector.broadcast %in : f32 to vector<8x9xf32>
        %282 = vector.multi_reduction <maxf>, %279, %281 [1] : vector<8x15x9xf32> to vector<8x9xf32>
        %283 = arith.maxsi %c1908153259_i64, %c564459480_i64 : i64
        %cst_41 = arith.constant 1.000000e+00 : f32
        linalg.yield %cst_41 : f32
      }
    scf.parallel (%arg1, %arg2) = (%c8, %c4) to (%c8, %c10) step (%c13, %c15) {
      %cst_41 = arith.constant 5.894400e+04 : f16
      %collapsed_42 = tensor.collapse_shape %3 [[0, 1], [2]] : tensor<9x15x8xi16> into tensor<135x8xi16>
      %273 = math.absf %10 : tensor<8x1x15xf32>
      %274 = vector.broadcast %true : i1 to vector<1xi1>
      %275 = vector.broadcast %true : i1 to vector<1xi1>
      %276 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<and>} %274, %275, %true : vector<1xi1>, vector<1xi1> into i1
      %collapsed_43 = tensor.collapse_shape %collapsed_42 [[0, 1]] : tensor<135x8xi16> into tensor<1080xi16>
      %alloc_44 = memref.alloc() : memref<1x9xi64>
      %277 = tensor.empty() : tensor<15x9xi64>
      %278 = linalg.matmul ins(%14, %alloc_44 : tensor<15x1xi64>, memref<1x9xi64>) outs(%277 : tensor<15x9xi64>) -> tensor<15x9xi64>
      %279 = math.tanh %cst : f32
      vector.print %274 : vector<1xi1>
      %280 = math.copysign %2, %2 : tensor<15x1xf32>
      %281 = vector.insertelement %true, %274[%c11 : index] : vector<1xi1>
      %282 = math.absf %6 : tensor<8x1x15xf16>
      %283 = math.copysign %18, %18 : tensor<8xf32>
      %284 = index.mul %c8, %arg2
      %285 = math.cos %10 : tensor<8x1x15xf32>
      %286 = vector.reduction <maxsi>, %274 : vector<1xi1> into i1
      %287 = arith.addf %cst_2, %cst : f32
      scf.yield
    }
    %19 = affine.vector_load %alloc[%c2, %c5] : memref<15x1xi64>, vector<1xi64>
    affine.vector_store %19, %alloc[%c12, %c3] : memref<15x1xi64>, vector<1xi64>
    %20 = tensor.empty() : tensor<8xf32>
    %21 = tensor.empty() : tensor<f32>
    %22 = linalg.dot ins(%18, %20 : tensor<8xf32>, tensor<8xf32>) outs(%21 : tensor<f32>) -> tensor<f32>
    %23 = math.powf %22, %22 : tensor<f32>
    %24 = math.tan %6 : tensor<8x1x15xf16>
    %25 = math.fma %5, %5, %5 : tensor<8x15x9xf32>
    %26 = arith.maxui %c1647736072_i64, %c1908153259_i64 : i64
    %27 = math.exp2 %6 : tensor<8x1x15xf16>
    %28 = arith.shli %true, %false : i1
    %29 = arith.shli %c27427_i16, %c23984_i16 : i16
    %30 = arith.maxf %cst_2, %cst : f32
    %31 = arith.addf %cst_2, %cst_2 : f32
    %32 = math.rsqrt %5 : tensor<8x15x9xf32>
    %33 = math.absf %5 : tensor<8x15x9xf32>
    scf.execute_region {
      %expanded = tensor.expand_shape %14 [[0], [1, 2]] : tensor<15x1xi64> into tensor<15x1x1xi64>
      %273 = arith.shrui %c1647736072_i64, %c1647736072_i64 : i64
      %274 = vector.shuffle %19, %19 [0] : vector<1xi64>, vector<1xi64>
      %275 = math.round %6 : tensor<8x1x15xf16>
      %276 = arith.maxui %c23984_i16, %c23984_i16 : i16
      %277 = math.exp2 %12 : tensor<8x1x15xf32>
      %278 = vector.create_mask %c14, %c1 : vector<15x1xi1>
      %279 = arith.minsi %c1069903657_i32, %c606377018_i32 : i32
      %280 = affine.min affine_map<(d0, d1, d2) -> (d1 * 32, d0, 0)>(%c7, %c3, %c4)
      %inserted_41 = tensor.insert %cst_2 into %12[%c4, %c0, %c13] : tensor<8x1x15xf32>
      %alloc_42 = memref.alloc() : memref<8x15x9xf16>
      %281 = bufferization.to_memref %10 : memref<8x1x15xf32>
      %282 = scf.if %true -> (i16) {
        %286 = arith.cmpi ule, %c1647736072_i64, %c1284375718_i64 : i64
        %alloc_43 = memref.alloc() : memref<15x1xi64>
        %287 = math.powf %cst, %cst_1 : f32
        memref.store %c23984_i16, %alloc_11[%c7, %c0] : memref<15x1xi16>
        %288 = vector.broadcast %true : i1 to vector<8x15x9xi1>
        %289 = math.sqrt %11 : tensor<8x15x9xf16>
        %290 = tensor.empty() : tensor<1x15xf16>
        %291 = tensor.empty() : tensor<15x15xf16>
        %292 = linalg.matmul ins(%15, %290 : tensor<15x1xf16>, tensor<1x15xf16>) outs(%291 : tensor<15x15xf16>) -> tensor<15x15xf16>
        %293 = affine.min affine_map<(d0, d1, d2, d3) -> ((d3 + 64) ceildiv 2, d1)>(%c13, %c1, %c6, %c13)
        scf.yield %c23984_i16 : i16
      } else {
        %286 = vector.broadcast %false : i1 to vector<1x1xi1>
        %287 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = ["parallel", "parallel", "reduction"], kind = #vector.kind<mul>} %278, %278, %286 : vector<15x1xi1>, vector<15x1xi1> into vector<1x1xi1>
        %288 = arith.muli %c1069903657_i32, %c1069903657_i32 : i32
        %alloc_43 = memref.alloc() : memref<9x15x8xi64>
        %289 = vector.broadcast %c1908153259_i64 : i64 to vector<8x1x15xi64>
        %290 = vector.broadcast %true : i1 to vector<8x1x15xi1>
        %291 = vector.broadcast %c606377018_i32 : i32 to vector<8x1x15xi32>
        %292 = vector.gather %alloc_43[%c6, %c11, %c8] [%291], %290, %289 : memref<9x15x8xi64>, vector<8x1x15xi32>, vector<8x1x15xi1>, vector<8x1x15xi64> into vector<8x1x15xi64>
        %293 = math.absf %21 : tensor<f32>
        %294 = arith.maxui %c1908153259_i64, %c564459480_i64 : i64
        %295 = math.absf %10 : tensor<8x1x15xf32>
        %296 = vector.matrix_multiply %19, %19 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
        %297 = vector.matrix_multiply %296, %19 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
        scf.yield %c27427_i16 : i16
      }
      %283 = arith.shrsi %c27427_i16, %c27427_i16 : i16
      %284 = math.log10 %12 : tensor<8x1x15xf32>
      %285 = arith.ori %c1647736072_i64, %c564459480_i64 : i64
      scf.yield
    }
    %34 = arith.shrsi %c23984_i16, %c23984_i16 : i16
    %35 = vector.matrix_multiply %19, %19 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
    memref.store %c1647736072_i64, %alloc[%c13, %c0] : memref<15x1xi64>
    %36 = vector.bitcast %35 : vector<1xi64> to vector<1xi64>
    %37 = math.powf %cst_2, %cst_1 : f32
    %38 = tensor.empty() : tensor<9x15x8xi16>
    %39 = vector.create_mask %c15, %c11, %c10 : vector<8x15x9xi1>
    %40 = vector.bitcast %36 : vector<1xi64> to vector<1xi64>
    %generated = tensor.generate %c14, %c7 {
    ^bb0(%arg1: index, %arg2: index, %arg3: index):
      %273 = vector.broadcast %c606377018_i32 : i32 to vector<8xi32>
      %274 = vector.transfer_write %273, %17[%c8, %c14, %c7] {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : vector<8xi32>, tensor<8x15x9xi32>
      %275 = math.log10 %cst : f32
      %276 = arith.maxf %cst_2, %cst_2 : f32
      %277 = vector.broadcast %cst_3 : f16 to vector<9x15x8xf16>
      tensor.yield %c1908153259_i64 : i64
    } : tensor<?x?x9xi64>
    %41 = math.rsqrt %2 : tensor<15x1xf32>
    %42 = arith.subi %c27427_i16, %c27427_i16 : i16
    %43 = memref.load %alloc_19[%c12, %c0] : memref<15x1xi1>
    %44 = math.log1p %cst_0 : f16
    %45 = vector.broadcast %c1647736072_i64 : i64 to vector<8x1x15xi64>
    %46 = vector.broadcast %false : i1 to vector<8x1x15xi1>
    %47 = vector.broadcast %c606377018_i32 : i32 to vector<8x1x15xi32>
    %48 = vector.gather %7[%c4, %c6, %c10] [%47], %46, %45 : tensor<8x15x9xi64>, vector<8x1x15xi32>, vector<8x1x15xi1>, vector<8x1x15xi64> into vector<8x1x15xi64>
    %49 = math.round %10 : tensor<8x1x15xf32>
    %50 = arith.divf %cst_1, %cst_2 : f32
    %51 = arith.shli %c27427_i16, %c27427_i16 : i16
    %52 = vector.reduction <minsi>, %36 : vector<1xi64> into i64
    %53 = vector.insertelement %c564459480_i64, %35[%c1 : index] : vector<1xi64>
    %54 = math.atan %21 : tensor<f32>
    %55 = math.atan2 %22, %22 : tensor<f32>
    %56 = math.log2 %11 : tensor<8x15x9xf16>
    %57 = arith.negf %cst_4 : f16
    %58 = math.roundeven %cst : f32
    %59 = tensor.empty() : tensor<9x15x8xf16>
    %60 = vector.broadcast %cst_0 : f16 to vector<15x1xf16>
    %61 = vector.broadcast %true : i1 to vector<15x1xi1>
    %62 = vector.broadcast %c606377018_i32 : i32 to vector<15x1xi32>
    %63 = vector.gather %59[%c5, %c13, %c6] [%62], %61, %60 : tensor<9x15x8xf16>, vector<15x1xi32>, vector<15x1xi1>, vector<15x1xf16> into vector<15x1xf16>
    %64 = math.atan %15 : tensor<15x1xf16>
    %65 = arith.minsi %c1284375718_i64, %c1647736072_i64 : i64
    %66 = math.fma %10, %10, %12 : tensor<8x1x15xf32>
    %67 = arith.addf %cst_0, %cst_0 : f16
    %68 = tensor.empty() : tensor<8x15x9xi32>
    %mapped = linalg.map ins(%17 : tensor<8x15x9xi32>) outs(%68 : tensor<8x15x9xi32>)
      (%in: i32) {
        %273 = bufferization.clone %alloc_16 : memref<15x1xi1> to memref<15x1xi1>
        %274 = index.add %c12, %c10
        %275 = math.absi %c1069903657_i32 : i32
        %276 = math.tan %5 : tensor<8x15x9xf32>
        %277 = memref.atomic_rmw maxf %cst_2, %alloc_5[%c7, %c8, %c3] : (f32, memref<8x15x9xf32>) -> f32
        %278 = vector.splat %c606377018_i32 : vector<9x15x8xi32>
        %279 = index.add %c6, %c4
        %280 = arith.shrsi %c27427_i16, %c23984_i16 : i16
        affine.for %arg1 = 0 to 46 {
        }
        %281 = arith.ori %true, %false : i1
        %282 = math.powf %cst_4, %cst_0 : f16
        %cst_41 = arith.constant 1.70526298E+9 : f32
        %283 = math.log1p %cst_0 : f16
        %284 = math.tanh %5 : tensor<8x15x9xf32>
        %285 = math.exp2 %2 : tensor<15x1xf32>
        %286 = tensor.empty() : tensor<15x1xi1>
        %287 = vector.broadcast %c564459480_i64 : i64 to vector<8x1xi64>
        %288 = vector.multi_reduction <mul>, %48, %287 [2] : vector<8x1x15xi64> to vector<8x1xi64>
        %289 = index.divu %c2, %c15
        %290 = math.exp %11 : tensor<8x15x9xf16>
        %291 = math.exp2 %10 : tensor<8x1x15xf32>
        %292 = math.powf %cst_2, %cst_2 : f32
        %293 = bufferization.to_tensor %alloc_19 : memref<15x1xi1>
        %294 = vector.reduction <xor>, %19 : vector<1xi64> into i64
        %295 = math.exp %6 : tensor<8x1x15xf16>
        %296 = scf.while (%arg1 = %48) : (vector<8x1x15xi64>) -> vector<8x1x15xi64> {
          %c366612574_i64 = arith.constant 366612574 : i64
          %303 = math.absi %13 : tensor<15x1xi64>
          %304 = tensor.empty(%c5, %c3) : tensor<?x15x?xi1>
          %305 = index.floordivs %c11, %c14
          %306 = arith.subi %c1069903657_i32, %c606377018_i32 : i32
          vector.print %36 : vector<1xi64>
          %307 = index.sub %c6, %c9
          %308 = affine.apply affine_map<(d0, d1) -> (((d1 - d0 + 4) * 2) floordiv 32 + 128)>(%c5, %305)
          scf.condition(%false) %48 : vector<8x1x15xi64>
        } do {
        ^bb0(%arg1: vector<8x1x15xi64>):
          %cast_42 = tensor.cast %12 : tensor<8x1x15xf32> to tensor<?x?x?xf32>
          %303 = tensor.empty(%c1, %c11) : tensor<?x15x?xf16>
          %304 = index.maxs %c0, %279
          %305 = math.powf %12, %12 : tensor<8x1x15xf32>
          %306 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<and>} %35, %35, %c564459480_i64 : vector<1xi64>, vector<1xi64> into i64
          %307 = arith.addf %cst_0, %cst_4 : f16
          %308 = index.add %c6, %c2
          %309 = bufferization.to_tensor %alloc_9 : memref<9x15x8xf16>
          %310 = arith.remsi %c1284375718_i64, %c1647736072_i64 : i64
          %311 = math.powf %21, %22 : tensor<f32>
          %312 = index.sub %c7, %c3
          %313 = vector.matrix_multiply %35, %36 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
          %314 = math.sqrt %6 : tensor<8x1x15xf16>
          %315 = arith.ori %in, %c606377018_i32 : i32
          %316 = index.sub %c5, %c4
          %317 = arith.addf %cst_3, %cst_3 : f16
          scf.yield %45 : vector<8x1x15xi64>
        }
        %297 = arith.muli %c1284375718_i64, %c1908153259_i64 : i64
        %298 = arith.addi %c606377018_i32, %c1069903657_i32 : i32
        %299 = arith.ori %c564459480_i64, %c1284375718_i64 : i64
        %300 = arith.divsi %true, %true : i1
        %301 = arith.maxf %cst_2, %cst_2 : f32
        affine.for %arg1 = 0 to 36 {
        }
        %302 = math.absi %1 : tensor<8x15x9xi32>
        %c0_i32 = arith.constant 0 : i32
        linalg.yield %c0_i32 : i32
      }
    %69 = vector.broadcast %cst_1 : f32 to vector<15x1xf32>
    %70 = vector.flat_transpose %35 {columns = 1 : i32, rows = 1 : i32} : vector<1xi64> -> vector<1xi64>
    %alloc_21 = memref.alloc() : memref<8x1x15xi64>
    %71 = arith.addf %cst_1, %cst : f32
    %72 = vector.broadcast %c1284375718_i64 : i64 to vector<15x1xi64>
    %73 = vector.gather %alloc_6[%c8, %c2, %c8] [%62], %61, %72 : memref<8x1x15xi64>, vector<15x1xi32>, vector<15x1xi1>, vector<15x1xi64> into vector<15x1xi64>
    %74 = math.atan2 %6, %6 : tensor<8x1x15xf16>
    %75 = memref.load %alloc_14[%c7, %c3, %c7] : memref<9x15x8xf32>
    %from_elements = tensor.from_elements %false, %true, %false, %true, %true, %true, %false, %false, %false, %true, %false, %true, %true, %false, %true, %false, %true, %true, %false, %true, %true, %false, %true, %true, %true, %false, %false, %false, %false, %true, %false, %true, %false, %false, %false, %true, %false, %false, %true, %true, %true, %false, %false, %true, %false, %false, %false, %true, %false, %true, %true, %false, %true, %false, %true, %false, %false, %false, %true, %true, %false, %false, %true, %false, %true, %true, %false, %true, %false, %true, %true, %true, %true, %false, %true, %false, %true, %true, %true, %true, %true, %false, %true, %false, %true, %true, %false, %true, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %false, %true, %true, %true, %true, %false, %false, %false, %false, %false, %true, %false, %true, %true, %false, %true, %true, %true, %true, %true, %true, %true : tensor<8x1x15xi1>
    %76 = math.log2 %22 : tensor<f32>
    %77 = arith.subi %c1069903657_i32, %c1069903657_i32 : i32
    %78 = arith.muli %c27427_i16, %c23984_i16 : i16
    %79 = arith.muli %c1284375718_i64, %c564459480_i64 : i64
    %80 = vector.shuffle %70, %70 [0] : vector<1xi64>, vector<1xi64>
    bufferization.dealloc_tensor %6 : tensor<8x1x15xf16>
    %81 = memref.load %alloc_14[%c1, %c3, %c0] : memref<9x15x8xf32>
    %alloc_22 = memref.alloc() : memref<15x1xf16>
    %82 = vector.gather %alloc_22[%c8, %c5] [%62], %61, %60 : memref<15x1xf16>, vector<15x1xi32>, vector<15x1xi1>, vector<15x1xf16> into vector<15x1xf16>
    %83 = math.log10 %11 : tensor<8x15x9xf16>
    %84 = arith.shrui %c23984_i16, %c27427_i16 : i16
    %85 = arith.addf %cst, %cst : f32
    %86 = arith.addf %cst_3, %cst_4 : f16
    %87 = math.absf %21 : tensor<f32>
    %88 = vector.bitcast %48 : vector<8x1x15xi64> to vector<8x1x15xi64>
    %89 = affine.apply affine_map<(d0, d1) -> (d1 + 16)>(%c1, %c5)
    %90 = arith.minui %c606377018_i32, %c1069903657_i32 : i32
    %91 = vector.reduction <maxui>, %70 : vector<1xi64> into i64
    %92 = math.powf %15, %15 : tensor<15x1xf16>
    %93 = affine.apply affine_map<(d0) -> (-d0 + 32)>(%c2)
    %true_23 = index.bool.constant true
    %94 = vector.create_mask %c0, %c9, %c8 : vector<8x1x15xi1>
    %95 = vector.shuffle %60, %63 [1, 3, 5, 6, 10, 11, 16, 17, 18, 21, 25, 28] : vector<15x1xf16>, vector<15x1xf16>
    %96 = math.tan %20 : tensor<8xf32>
    %97 = affine.load %alloc[%c8, %c12] : memref<15x1xi64>
    %98 = vector.multi_reduction <xor>, %40, %97 [0] : vector<1xi64> to i64
    %99 = math.floor %21 : tensor<f32>
    %100 = math.tanh %cst : f32
    %alloc_24 = memref.alloc() : memref<1x15xi16>
    %101 = tensor.empty() : tensor<15xi16>
    %102 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1, d2)>, affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_24, %101 : memref<1x15xi16>, tensor<15xi16>) outs(%9 : tensor<8x1x15xi16>) {
    ^bb0(%in: i16, %in_41: i16, %out: i16):
      %273 = vector.load %alloc_22[%c7, %c0] : memref<15x1xf16>, vector<8x1x15xf16>
      %274 = vector.multi_reduction <xor>, %35, %40 [] : vector<1xi64> to vector<1xi64>
      %275 = arith.divsi %c1647736072_i64, %c1647736072_i64 : i64
      %276 = arith.cmpf ueq, %cst_3, %cst_3 : f16
      %277 = index.maxs %c4, %c4
      %278 = index.add %c15, %c10
      %279 = arith.addi %in_41, %out : i16
      %280 = arith.muli %c1908153259_i64, %c1647736072_i64 : i64
      %281 = index.divu %c1, %c2
      %282 = affine.apply affine_map<(d0, d1, d2, d3) -> (-d0 - 8)>(%c11, %c6, %c1, %c6)
      %283 = index.castu %true_23 : i1 to index
      %284 = vector.create_mask %c3, %283 : vector<15x1xi1>
      %285 = tensor.empty() : tensor<1x8xi64>
      %286 = tensor.empty() : tensor<15x8xi64>
      %287 = linalg.matmul ins(%13, %285 : tensor<15x1xi64>, tensor<1x8xi64>) outs(%286 : tensor<15x8xi64>) -> tensor<15x8xi64>
      %288 = index.divu %c14, %277
      %289 = bufferization.to_memref %9 : memref<8x1x15xi16>
      %290 = vector.flat_transpose %19 {columns = 1 : i32, rows = 1 : i32} : vector<1xi64> -> vector<1xi64>
      %291 = math.tanh %12 : tensor<8x1x15xf32>
      bufferization.dealloc_tensor %14 : tensor<15x1xi64>
      %292 = math.exp2 %20 : tensor<8xf32>
      %293 = vector.shuffle %63, %82 [0, 3, 4, 5, 8, 9, 10, 11, 12, 13, 15, 17, 18, 22, 24, 26] : vector<15x1xf16>, vector<15x1xf16>
      %294 = math.log1p %18 : tensor<8xf32>
      %295 = vector.broadcast %true : i1 to vector<8x15x9xi1>
      %296 = math.cos %10 : tensor<8x1x15xf32>
      %alloc_42 = memref.alloc() : memref<1x9xf32>
      %297 = tensor.empty() : tensor<15x9xf32>
      %298 = linalg.matmul ins(%2, %alloc_42 : tensor<15x1xf32>, memref<1x9xf32>) outs(%297 : tensor<15x9xf32>) -> tensor<15x9xf32>
      %299 = arith.divui %true, %true_23 : i1
      %300 = arith.addi %c27427_i16, %c27427_i16 : i16
      %301 = vector.broadcast %c1647736072_i64 : i64 to vector<8x1x15xi64>
      %302 = vector.shuffle %69, %69 [3, 4, 6, 10, 14, 17, 24, 28, 29] : vector<15x1xf32>, vector<15x1xf32>
      %303 = vector.extract_strided_slice %301 {offsets = [3], sizes = [3], strides = [1]} : vector<8x1x15xi64> to vector<3x1x15xi64>
      %304 = math.absf %cst_0 : f16
      %alloc_43 = memref.alloc() : memref<1x15xi64>
      %305 = tensor.empty() : tensor<15x15xi64>
      %306 = linalg.matmul ins(%14, %alloc_43 : tensor<15x1xi64>, memref<1x15xi64>) outs(%305 : tensor<15x15xi64>) -> tensor<15x15xi64>
      %307 = vector.shuffle %94, %94 [1, 3, 5, 10, 12, 13, 14] : vector<8x1x15xi1>, vector<8x1x15xi1>
      linalg.yield %c27427_i16 : i16
    } -> tensor<8x1x15xi16>
    %103 = memref.alloca_scope  -> (memref<8x15x9xi32>) {
      %273 = vector.broadcast %cst_0 : f16 to vector<1x1xf16>
      %274 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = ["parallel", "parallel", "reduction"], kind = #vector.kind<mul>} %63, %82, %273 : vector<15x1xf16>, vector<15x1xf16> into vector<1x1xf16>
      %275 = affine.apply affine_map<(d0, d1, d2, d3) -> (-d0 - 8)>(%c10, %c4, %c13, %89)
      %c-32066_i16 = arith.constant -32066 : i16
      %cast_41 = tensor.cast %11 : tensor<8x15x9xf16> to tensor<?x?x?xf16>
      %276 = math.floor %20 : tensor<8xf32>
      %277 = bufferization.to_memref %18 : memref<8xf32>
      %alloc_42 = memref.alloc() : memref<9x15x8xf16>
      %278 = bufferization.to_memref %5 : memref<8x15x9xf32>
      %279 = math.absf %11 : tensor<8x15x9xf16>
      %280 = bufferization.to_tensor %alloc_7 : memref<8x1x15xf32>
      %expanded = tensor.expand_shape %5 [[0], [1], [2, 3]] : tensor<8x15x9xf32> into tensor<8x15x9x1xf32>
      %281 = arith.divsi %c1647736072_i64, %c1908153259_i64 : i64
      %282 = math.log2 %11 : tensor<8x15x9xf16>
      %283 = arith.xori %98, %98 : i64
      %284 = index.divu %c14, %275
      %285 = arith.shli %c564459480_i64, %c1647736072_i64 : i64
      %286 = vector.broadcast %97 : i64 to vector<1x1xi64>
      %287 = vector.outerproduct %35, %19, %286 {kind = #vector.kind<minsi>} : vector<1xi64>, vector<1xi64>
      %288 = math.ctpop %7 : tensor<8x15x9xi64>
      bufferization.dealloc_tensor %13 : tensor<15x1xi64>
      %289 = arith.minsi %true_23, %false : i1
      %290 = index.divu %284, %c7
      %291 = math.roundeven %10 : tensor<8x1x15xf32>
      %292 = vector.broadcast %cst_4 : f16 to vector<8x15x9xf16>
      %293 = math.log1p %11 : tensor<8x15x9xf16>
      affine.store %cst_3, %alloc_22[%c8, %c3] : memref<15x1xf16>
      vector.print %63 : vector<15x1xf16>
      %294 = math.log %cst : f32
      affine.store %true_23, %alloc_19[%c0, %c10] : memref<15x1xi1>
      %295 = arith.remsi %c1908153259_i64, %c1647736072_i64 : i64
      %296 = arith.divf %cst, %cst_1 : f32
      %297 = vector.broadcast %c27427_i16 : i16 to vector<15x1xi16>
      %298 = vector.extract %82[11] : vector<15x1xf16>
      %alloc_43 = memref.alloc() : memref<8x15x9xi32>
      memref.alloca_scope.return %alloc_43 : memref<8x15x9xi32>
    }
    %104 = affine.if affine_set<(d0, d1, d2, d3) : (d3 floordiv 16 == 0, d1 >= 0, d0 >= 0)>(%c13, %c11, %c3, %c7) -> f32 {
      %273 = affine.for %arg1 = 0 to 5 iter_args(%arg2 = %from_elements) -> (tensor<8x1x15xi1>) {
        affine.yield %arg2 : tensor<8x1x15xi1>
      }
      %274 = index.sub %c9, %c10
      %275 = affine.apply affine_map<(d0) -> (-d0 + 32)>(%c2)
      %276 = arith.subi %true_23, %true_23 : i1
      %c0_i32 = arith.constant 0 : i32
      %c0_i32_41 = arith.constant 0 : i32
      %277 = vector.transfer_read %103[%c10, %274, %c2], %c0_i32_41 {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : memref<8x15x9xi32>, vector<9xi32>
      %278 = math.ipowi %0, %0 : tensor<9x15x8xi32>
      %collapsed_42 = tensor.collapse_shape %12 [[0, 1], [2]] : tensor<8x1x15xf32> into tensor<8x15xf32>
      %279 = arith.maxui %c27427_i16, %c27427_i16 : i16
      affine.yield %cst_2 : f32
    } else {
      %273 = vector.broadcast %97 : i64 to vector<15xi64>
      %274 = vector.contract {indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0)>], iterator_types = ["parallel", "reduction"], kind = #vector.kind<and>} %35, %72, %273 : vector<1xi64>, vector<15x1xi64> into vector<15xi64>
      %275 = bufferization.clone %alloc_22 : memref<15x1xf16> to memref<15x1xf16>
      %276 = arith.shli %98, %c1284375718_i64 : i64
      %277 = affine.min affine_map<(d0, d1, d2) -> ((d0 + d2) ceildiv 8, d1, d2 + d2 + d0, d2 + d2 + d0)>(%c5, %c10, %c7)
      %278 = math.cos %18 : tensor<8xf32>
      %279 = vector.flat_transpose %40 {columns = 1 : i32, rows = 1 : i32} : vector<1xi64> -> vector<1xi64>
      %280 = arith.muli %false, %true : i1
      %281 = scf.while (%arg1 = %alloc_18) : (memref<8x1x15xi1>) -> memref<8x1x15xi1> {
        %282 = math.fma %11, %11, %11 : tensor<8x15x9xf16>
        %283 = math.exp %cst_4 : f16
        %284 = math.cos %20 : tensor<8xf32>
        %285 = arith.subi %c1284375718_i64, %98 : i64
        %286 = arith.maxsi %true, %false : i1
        %287 = arith.shli %98, %c1908153259_i64 : i64
        %288 = vector.load %alloc_9[%c5, %c12, %c0] : memref<9x15x8xf16>, vector<8x1x15xf16>
        %289 = vector.matrix_multiply %40, %70 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
        scf.condition(%true_23) %alloc_18 : memref<8x1x15xi1>
      } do {
      ^bb0(%arg1: memref<8x1x15xi1>):
        %282 = math.fma %20, %18, %18 : tensor<8xf32>
        %283 = vector.load %alloc_12[%c5, %c14, %c6] : memref<9x15x8xi16>, vector<8x1x15xi16>
        vector.print %46 : vector<8x1x15xi1>
        %284 = math.atan2 %cst_4, %cst_0 : f16
        %285 = index.casts %c5 : index to i32
        %286 = index.casts %c606377018_i32 : i32 to index
        %287 = bufferization.clone %alloc_19 : memref<15x1xi1> to memref<15x1xi1>
        %288 = vector.splat %cst_3 : vector<8x1x15xf16>
        %289 = arith.shrsi %c1908153259_i64, %c564459480_i64 : i64
        %290 = index.divu %c6, %c14
        %291 = vector.load %alloc_12[%c3, %c9, %c6] : memref<9x15x8xi16>, vector<9x15x8xi16>
        %expanded = tensor.expand_shape %18 [[0, 1]] : tensor<8xf32> into tensor<8x1xf32>
        %292 = bufferization.clone %alloc_20 : memref<1x15xi32> to memref<1x15xi32>
        %293 = vector.create_mask %c0, %c9, %c11 : vector<8x15x9xi1>
        %294 = math.log1p %59 : tensor<9x15x8xf16>
        %295 = math.absf %11 : tensor<8x15x9xf16>
        scf.yield %alloc_13 : memref<8x1x15xi1>
      }
      affine.yield %cst : f32
    }
    %105 = math.fma %18, %20, %18 : tensor<8xf32>
    %106 = math.fpowi %5, %1 : tensor<8x15x9xf32>, tensor<8x15x9xi32>
    %107 = arith.cmpi ule, %97, %c1647736072_i64 : i64
    %cast = tensor.cast %11 : tensor<8x15x9xf16> to tensor<?x?x?xf16>
    %108 = math.absi %c564459480_i64 : i64
    affine.for %arg1 = 0 to 54 {
    }
    %109 = arith.cmpf ord, %cst_0, %cst_4 : f16
    %110 = vector.shuffle %60, %82 [0, 3, 4, 5, 9, 11, 12, 13, 16, 17, 18, 20, 22, 24, 25, 26, 27, 29] : vector<15x1xf16>, vector<15x1xf16>
    %111 = arith.divsi %c23984_i16, %c23984_i16 : i16
    %112 = bufferization.clone %alloc_15 : memref<15x1xi32> to memref<15x1xi32>
    %113 = memref.alloca_scope  -> (memref<15x1xi1>) {
      %273 = math.powf %cst_4, %cst_0 : f16
      %274 = index.casts %98 : i64 to index
      %true_41 = arith.constant true
      %false_42 = arith.constant false
      %275 = vector.transfer_read %alloc_8[%c14, %c10], %false_42 {permutation_map = affine_map<(d0, d1) -> (d0)>} : memref<15x1xi1>, vector<1xi1>
      %276 = arith.shli %97, %c1908153259_i64 : i64
      %277 = math.atan2 %reduced, %reduced : tensor<8xf32>
      %278 = math.fpowi %cst_0, %c1069903657_i32 : f16, i32
      %279 = tensor.empty() : tensor<8x1x15xi1>
      %false_43 = index.bool.constant false
      %280 = math.log2 %cst_4 : f16
      %281 = math.fma %cst_2, %cst, %cst_1 : f32
      %282 = vector.splat %97 : vector<9x15x8xi64>
      %283 = memref.alloca_scope  -> (memref<9x15x8xi1>) {
        %alloc_44 = memref.alloc() : memref<1x9xf32>
        %304 = tensor.empty() : tensor<15x9xf32>
        %305 = linalg.matmul ins(%2, %alloc_44 : tensor<15x1xf32>, memref<1x9xf32>) outs(%304 : tensor<15x9xf32>) -> tensor<15x9xf32>
        %306 = math.log1p %2 : tensor<15x1xf32>
        %307 = math.exp %10 : tensor<8x1x15xf32>
        %c1093934280_i64 = arith.constant 1093934280 : i64
        %alloca_45 = memref.alloca() : memref<8x1x15xi32>
        %308 = index.divu %c12, %c6
        %309 = arith.ceildivsi %false_43, %true_23 : i1
        %310 = vector.insertelement %c1647736072_i64, %36[%c10 : index] : vector<1xi64>
        %311 = index.sizeof
        %312 = math.round %21 : tensor<f32>
        %313 = tensor.empty() : tensor<1x15xf16>
        %314 = tensor.empty() : tensor<15x15xf16>
        %315 = linalg.matmul ins(%15, %313 : tensor<15x1xf16>, tensor<1x15xf16>) outs(%314 : tensor<15x15xf16>) -> tensor<15x15xf16>
        %316 = tensor.empty() : tensor<1x8xf16>
        %317 = tensor.empty() : tensor<15x8xf16>
        %318 = linalg.matmul ins(%15, %316 : tensor<15x1xf16>, tensor<1x8xf16>) outs(%317 : tensor<15x8xf16>) -> tensor<15x8xf16>
        %319 = vector.create_mask %c12, %c2 : vector<15x1xi1>
        %320 = arith.addf %cst, %cst : f32
        %321 = bufferization.clone %alloc_8 : memref<15x1xi1> to memref<15x1xi1>
        %322 = index.casts %c0 : index to i32
        %323 = math.log2 %314 : tensor<15x15xf16>
        %324 = arith.shrsi %true_23, %true_23 : i1
        %325 = math.exp %304 : tensor<15x9xf32>
        %326 = math.log1p %11 : tensor<8x15x9xf16>
        %alloc_46 = memref.alloc() : memref<15x1xi64>
        memref.copy %alloc, %alloc_46 : memref<15x1xi64> to memref<15x1xi64>
        %327 = index.casts %c1069903657_i32 : i32 to index
        %328 = index.mul %c13, %c0
        %329 = bufferization.clone %alloc_22 : memref<15x1xf16> to memref<15x1xf16>
        %330 = bufferization.to_tensor %alloc_9 : memref<9x15x8xf16>
        %331 = vector.broadcast %c6 : index to vector<8xindex>
        %332 = vector.broadcast %true_23 : i1 to vector<8xi1>
        %333 = vector.broadcast %c1647736072_i64 : i64 to vector<8xi64>
        vector.scatter %alloc_6[%c4, %c0, %c2] [%331], %332, %333 : memref<8x1x15xi64>, vector<8xindex>, vector<8xi1>, vector<8xi64>
        %334 = vector.insertelement %c1284375718_i64, %36[%c13 : index] : vector<1xi64>
        %expanded = tensor.expand_shape %0 [[0], [1], [2, 3]] : tensor<9x15x8xi32> into tensor<9x15x8x1xi32>
        %335 = vector.bitcast %47 : vector<8x1x15xi32> to vector<8x1x15xi32>
        %336 = vector.shuffle %19, %36 [0] : vector<1xi64>, vector<1xi64>
        %337 = bufferization.clone %alloc_20 : memref<1x15xi32> to memref<1x15xi32>
        %338 = arith.subi %c23984_i16, %c27427_i16 : i16
        %alloc_47 = memref.alloc() : memref<9x15x8xi1>
        memref.alloca_scope.return %alloc_47 : memref<9x15x8xi1>
      }
      %284 = arith.divsi %true, %true_23 : i1
      vector.print %73 : vector<15x1xi64>
      %285 = vector.insertelement %c564459480_i64, %70[%c5 : index] : vector<1xi64>
      %286 = vector.reduction <add>, %36 : vector<1xi64> into i64
      %287 = arith.shli %true, %true_41 : i1
      %288 = math.exp2 %cst_0 : f16
      %c1_i16 = arith.constant 1 : i16
      %c0_i16 = arith.constant 0 : i16
      %289 = vector.transfer_read %9[%89, %89, %c15], %c0_i16 : tensor<8x1x15xi16>, vector<i16>
      %290 = vector.transpose %40, [0] : vector<1xi64> to vector<1xi64>
      %c1_i32 = arith.constant 1 : i32
      %291 = vector.transfer_read %alloc_15[%c12, %274], %c1_i32 : memref<15x1xi32>, vector<i32>
      %292 = math.atan %cst_1 : f32
      %293 = arith.maxui %c1284375718_i64, %c1908153259_i64 : i64
      %294 = vector.extract %47[6, 0] : vector<8x1x15xi32>
      %295 = arith.shrui %c23984_i16, %c23984_i16 : i16
      %296 = bufferization.clone %alloc_18 : memref<8x1x15xi1> to memref<8x1x15xi1>
      %297 = vector.bitcast %48 : vector<8x1x15xi64> to vector<8x1x15xi64>
      %298 = vector.broadcast %cst_2 : f32 to vector<9x15x8xf32>
      %299 = vector.fma %298, %298, %298 : vector<9x15x8xf32>
      %300 = arith.addi %true_41, %true : i1
      %301 = math.log10 %cst_4 : f16
      %302 = arith.remf %cst_2, %cst_2 : f32
      %303 = index.floordivs %89, %89
      memref.alloca_scope.return %alloc_19 : memref<15x1xi1>
    }
    %114 = index.maxs %c11, %c2
    %115 = math.log2 %12 : tensor<8x1x15xf32>
    %116 = tensor.empty() : tensor<15x1xi32>
    %117 = vector.gather %116[%c1, %c15] [%47], %94, %47 : tensor<15x1xi32>, vector<8x1x15xi32>, vector<8x1x15xi1>, vector<8x1x15xi32> into vector<8x1x15xi32>
    %118 = math.round %2 : tensor<15x1xf32>
    %119 = bufferization.clone %alloc_5 : memref<8x15x9xf32> to memref<8x15x9xf32>
    %120 = vector.matrix_multiply %70, %19 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
    %121 = math.fpowi %cst, %c606377018_i32 : f32, i32
    %collapsed = tensor.collapse_shape %from_elements [[0, 1], [2]] : tensor<8x1x15xi1> into tensor<8x15xi1>
    vector.print %46 : vector<8x1x15xi1>
    %122 = math.tanh %2 : tensor<15x1xf32>
    %123 = math.sqrt %20 : tensor<8xf32>
    %cast_25 = tensor.cast %6 : tensor<8x1x15xf16> to tensor<?x?x?xf16>
    %124 = math.round %12 : tensor<8x1x15xf32>
    memref.store %false, %alloc_16[%c14, %c0] : memref<15x1xi1>
    %125 = math.absi %true_23 : i1
    %126 = vector.create_mask %c14, %93, %89 : vector<9x15x8xi1>
    %127 = math.absi %38 : tensor<9x15x8xi16>
    %128 = arith.negf %cst : f32
    vector.print %47 : vector<8x1x15xi32>
    %129 = math.exp %cst_0 : f16
    %alloc_26 = memref.alloc() : memref<15x1xi16>
    %130 = math.log %cst_2 : f32
    %131 = index.add %c0, %c4
    %false_27 = arith.constant false
    %132 = vector.insertelement %c1647736072_i64, %40[%131 : index] : vector<1xi64>
    %133 = arith.remf %cst_3, %cst_0 : f16
    %134 = math.log10 %2 : tensor<15x1xf32>
    %135 = index.maxs %114, %c6
    %136 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>, affine_map<(d0, d1, d2) -> (d2, d1, d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%3, %8 : tensor<9x15x8xi16>, tensor<8x15x9xi16>) outs(%3 : tensor<9x15x8xi16>) {
    ^bb0(%in: i16, %in_41: i16, %out: i16):
      %273 = affine.apply affine_map<(d0, d1) -> ((d0 - 128) * 2)>(%c8, %135)
      %274 = arith.divsi %c1908153259_i64, %c564459480_i64 : i64
      %275 = math.log10 %reduced : tensor<8xf32>
      %276 = math.rsqrt %6 : tensor<8x1x15xf16>
      %277 = arith.remsi %98, %c1908153259_i64 : i64
      %278 = math.copysign %2, %2 : tensor<15x1xf32>
      %alloc_42 = memref.alloc() : memref<8x15x9xf16>
      memref.tensor_store %11, %alloc_42 : memref<8x15x9xf16>
      %279 = vector.broadcast %in_41 : i16 to vector<15x1xi16>
      memref.store %true, %alloc_8[%c8, %c0] : memref<15x1xi1>
      %280 = index.floordivs %c8, %c8
      %281 = index.maxs %c7, %c0
      %282 = math.log1p %cst_2 : f32
      %283 = vector.transpose %72, [1, 0] : vector<15x1xi64> to vector<1x15xi64>
      %284 = affine.for %arg1 = 0 to 58 iter_args(%arg2 = %5) -> (tensor<8x15x9xf32>) {
        affine.yield %5 : tensor<8x15x9xf32>
      }
      %expanded = tensor.expand_shape %11 [[0], [1], [2, 3]] : tensor<8x15x9xf16> into tensor<8x15x9x1xf16>
      %285 = arith.shli %c1284375718_i64, %c1284375718_i64 : i64
      %286 = arith.floordivsi %c1647736072_i64, %c564459480_i64 : i64
      %287 = arith.negf %cst_3 : f16
      %288 = arith.xori %98, %c1647736072_i64 : i64
      vector.print %40 : vector<1xi64>
      %289 = index.maxs %c1, %c2
      %290 = vector.matrix_multiply %35, %40 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
      %291 = arith.addi %c1647736072_i64, %c1908153259_i64 : i64
      %292 = vector.create_mask %c2, %281, %c8 : vector<8x1x15xi1>
      %293 = vector.splat %c13 : vector<8x15x9xindex>
      %294 = vector.broadcast %c4 : index to vector<8xindex>
      %295 = vector.broadcast %true : i1 to vector<8xi1>
      %296 = vector.broadcast %c564459480_i64 : i64 to vector<8xi64>
      vector.scatter %alloc[%c9, %c0] [%294], %295, %296 : memref<15x1xi64>, vector<8xindex>, vector<8xi1>, vector<8xi64>
      %297 = vector.broadcast %131 : index to vector<15xindex>
      %298 = vector.broadcast %true : i1 to vector<15xi1>
      vector.scatter %alloc_16[%c13, %c0] [%297], %298, %298 : memref<15x1xi1>, vector<15xindex>, vector<15xi1>, vector<15xi1>
      %alloc_43 = memref.alloc() : memref<1x9xf16>
      %299 = tensor.empty() : tensor<15x9xf16>
      %300 = linalg.matmul ins(%15, %alloc_43 : tensor<15x1xf16>, memref<1x9xf16>) outs(%299 : tensor<15x9xf16>) -> tensor<15x9xf16>
      %301 = index.casts %c9 : index to i32
      %302 = vector.extract %45[6] : vector<8x1x15xi64>
      %303 = tensor.empty(%c13, %c3) : tensor<8x?x?xi32>
      %304 = bufferization.clone %103 : memref<8x15x9xi32> to memref<8x15x9xi32>
      linalg.yield %c23984_i16 : i16
    } -> tensor<9x15x8xi16>
    %137 = index.castu %c4 : index to i32
    %138 = vector.create_mask %c6, %c15, %c0 : vector<8x1x15xi1>
    %139 = affine.if affine_set<(d0, d1, d2, d3) : (-((d1 + d2) mod 32) == 0, d1 - d0 == 0, d2 * 2 >= 0, d3 mod 32 == 0)>(%c7, %c4, %c8, %c0) -> memref<8x1x15xi1> {
      %273 = math.copysign %2, %2 : tensor<15x1xf32>
      %274 = math.absf %5 : tensor<8x15x9xf32>
      %275 = arith.addi %true, %true : i1
      %276 = math.rsqrt %cst_4 : f16
      %277 = arith.xori %c1647736072_i64, %98 : i64
      %278 = arith.cmpf ogt, %cst_2, %cst_1 : f32
      %279 = affine.apply affine_map<(d0, d1) -> ((d0 - 128) * 2)>(%c2, %c4)
      %alloc_41 = memref.alloc() : memref<1xi16>
      %alloc_42 = memref.alloc() : memref<8xi16>
      %280 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1)>, affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_41, %alloc_42 : memref<1xi16>, memref<8xi16>) outs(%9 : tensor<8x1x15xi16>) {
      ^bb0(%in: i16, %in_43: i16, %out: i16):
        bufferization.dealloc_tensor %generated : tensor<?x?x9xi64>
        %281 = bufferization.clone %alloc : memref<15x1xi64> to memref<15x1xi64>
        %282 = index.casts %c14 : index to i32
        %283 = vector.flat_transpose %36 {columns = 1 : i32, rows = 1 : i32} : vector<1xi64> -> vector<1xi64>
        %284 = vector.reduction <and>, %40 : vector<1xi64> into i64
        %285 = affine.load %113[%c1, %c7] : memref<15x1xi1>
        %286 = index.divu %c11, %131
        %287 = math.powf %cst, %cst : f32
        %288 = arith.cmpf ogt, %cst_1, %cst_2 : f32
        %289 = bufferization.clone %alloc_20 : memref<1x15xi32> to memref<1x15xi32>
        %290 = math.powf %5, %5 : tensor<8x15x9xf32>
        %rank = tensor.rank %14 : tensor<15x1xi64>
        %291 = vector.broadcast %c2 : index to vector<15xindex>
        %292 = vector.broadcast %285 : i1 to vector<15xi1>
        %293 = vector.broadcast %cst_1 : f32 to vector<15xf32>
        vector.scatter %119[%c4, %c10, %c0] [%291], %292, %293 : memref<8x15x9xf32>, vector<15xindex>, vector<15xi1>, vector<15xf32>
        %294 = memref.load %alloc_5[%c7, %c0, %c7] : memref<8x15x9xf32>
        %295 = arith.andi %c27427_i16, %out : i16
        %expanded = tensor.expand_shape %20 [[0, 1]] : tensor<8xf32> into tensor<8x1xf32>
        %296 = math.exp %6 : tensor<8x1x15xf16>
        %297 = arith.maxui %c1647736072_i64, %c1647736072_i64 : i64
        %298 = bufferization.to_tensor %alloc_7 : memref<8x1x15xf32>
        %299 = math.rsqrt %cst_1 : f32
        %300 = arith.shrsi %98, %c1908153259_i64 : i64
        %301 = bufferization.clone %112 : memref<15x1xi32> to memref<15x1xi32>
        %302 = vector.create_mask %c14, %c6, %c3 : vector<9x15x8xi1>
        %303 = vector.multi_reduction <maxui>, %40, %70 [] : vector<1xi64> to vector<1xi64>
        %304 = math.atan %cst : f32
        %false_44 = index.bool.constant false
        %305 = arith.shli %c27427_i16, %c27427_i16 : i16
        %306 = vector.broadcast %cst : f32 to vector<8x15x9xf32>
        %307 = vector.fma %306, %306, %306 : vector<8x15x9xf32>
        %308 = vector.bitcast %73 : vector<15x1xi64> to vector<15x1xi64>
        %309 = vector.splat %c1069903657_i32 : vector<8x15x9xi32>
        %310 = math.absf %12 : tensor<8x1x15xf32>
        %311 = arith.cmpf uno, %cst, %cst_1 : f32
        linalg.yield %out : i16
      } -> tensor<8x1x15xi16>
      affine.yield %alloc_18 : memref<8x1x15xi1>
    } else {
      %273 = vector.broadcast %97 : i64 to vector<8x15x9xi64>
      %274 = math.absf %6 : tensor<8x1x15xf16>
      %275 = vector.load %alloc_9[%c4, %c1, %c4] : memref<9x15x8xf16>, vector<8x1x15xf16>
      %276 = index.add %c7, %c11
      memref.store %true, %alloc_16[%c13, %c0] : memref<15x1xi1>
      %generated_41 = tensor.generate %131, %c11 {
      ^bb0(%arg1: index, %arg2: index, %arg3: index):
        %279 = math.round %10 : tensor<8x1x15xf32>
        %280 = vector.create_mask %c11, %c1, %c2 : vector<8x15x9xi1>
        %expanded = tensor.expand_shape %8 [[0], [1], [2, 3]] : tensor<8x15x9xi16> into tensor<8x15x9x1xi16>
        %281 = math.log10 %6 : tensor<8x1x15xf16>
        tensor.yield %cst_4 : f16
      } : tensor<?x?x9xf16>
      %277 = bufferization.clone %alloc_17 : memref<9x15x8xi32> to memref<9x15x8xi32>
      %278 = index.casts %c11 : index to i32
      affine.yield %alloc_18 : memref<8x1x15xi1>
    }
    %140 = index.casts %c0 : index to i32
    %141 = arith.shli %true_23, %false : i1
    %142 = arith.remsi %true, %true : i1
    scf.index_switch %93 
    case 1 {
      vector.print %61 : vector<15x1xi1>
      %273 = affine.for %arg1 = 0 to 65 iter_args(%arg2 = %c15) -> (index) {
        affine.yield %c12 : index
      }
      %274 = vector.splat %97 : vector<15x1xi64>
      %275 = arith.maxui %c27427_i16, %c23984_i16 : i16
      %276 = math.tan %10 : tensor<8x1x15xf32>
      %277 = math.copysign %12, %12 : tensor<8x1x15xf32>
      %278 = vector.broadcast %cst : f32 to vector<9x15x8xf32>
      %279 = vector.broadcast %c1069903657_i32 : i32 to vector<9x15x8xi32>
      %280 = vector.gather %10[%c2, %c11, %c12] [%279], %126, %278 : tensor<8x1x15xf32>, vector<9x15x8xi32>, vector<9x15x8xi1>, vector<9x15x8xf32> into vector<9x15x8xf32>
      %281 = index.divu %c15, %c14
      %282 = vector.broadcast %c1284375718_i64 : i64 to vector<1x1xi64>
      %283 = vector.outerproduct %120, %70, %282 {kind = #vector.kind<and>} : vector<1xi64>, vector<1xi64>
      %splat = tensor.splat %cst_1 : tensor<15x1xf32>
      %rank = tensor.rank %11 : tensor<8x15x9xf16>
      %284 = tensor.empty(%c9) : tensor<?x15x8xi64>
      %cast_41 = tensor.cast %59 : tensor<9x15x8xf16> to tensor<?x?x?xf16>
      %285 = vector.bitcast %73 : vector<15x1xi64> to vector<15x1xi64>
      %286 = arith.subi %false, %false : i1
      %287 = math.cos %2 : tensor<15x1xf32>
      scf.yield
    }
    case 2 {
      %273 = arith.shli %97, %c564459480_i64 : i64
      %274 = math.exp %10 : tensor<8x1x15xf32>
      %275 = vector.splat %c9 : vector<9x15x8xindex>
      %276 = vector.reduction <xor>, %19 : vector<1xi64> into i64
      %277 = arith.remsi %98, %c1647736072_i64 : i64
      %generated_41 = tensor.generate %c14 {
      ^bb0(%arg1: index, %arg2: index, %arg3: index):
        %287 = arith.addf %cst_3, %cst_4 : f16
        vector.print %117 : vector<8x1x15xi32>
        memref.store %c606377018_i32, %alloc_15[%c12, %c0] : memref<15x1xi32>
        %288 = index.add %c0, %c6
        tensor.yield %cst : f32
      } : tensor<?x1x15xf32>
      %278 = vector.create_mask %c14, %c14 : vector<15x1xi1>
      %279 = vector.broadcast %cst_2 : f32 to vector<f32>
      vector.transfer_write %279, %119[%c12, %c8, %131] : vector<f32>, memref<8x15x9xf32>
      %280 = index.maxu %93, %c15
      %281 = affine.min affine_map<(d0, d1) -> (d1 + d0, -(d1 + 2))>(%c5, %c2)
      %generated_42 = tensor.generate %93, %c10 {
      ^bb0(%arg1: index, %arg2: index):
        %287 = tensor.empty() : tensor<15x1xi1>
        %288 = vector.broadcast %c1069903657_i32 : i32 to vector<9x15x8xi32>
        %289 = vector.gather %287[%280, %280] [%288], %126, %126 : tensor<15x1xi1>, vector<9x15x8xi32>, vector<9x15x8xi1>, vector<9x15x8xi1> into vector<9x15x8xi1>
        %290 = math.log10 %cst : f32
        %291 = arith.addf %cst_3, %cst_0 : f16
        %alloc_44 = memref.alloc() : memref<1x9xf16>
        %292 = tensor.empty() : tensor<15x9xf16>
        %293 = linalg.matmul ins(%15, %alloc_44 : tensor<15x1xf16>, memref<1x9xf16>) outs(%292 : tensor<15x9xf16>) -> tensor<15x9xf16>
        tensor.yield %c1908153259_i64 : i64
      } : tensor<?x?xi64>
      %282 = math.ctlz %c606377018_i32 : i32
      %alloc_43 = memref.alloc() : memref<8xi16>
      %283 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_43 : memref<8xi16>) outs(%3 : tensor<9x15x8xi16>) {
      ^bb0(%in: i16, %out: i16):
        %287 = arith.minf %cst_3, %cst_3 : f16
        %288 = math.exp %cst_2 : f32
        %289 = arith.shli %98, %c1284375718_i64 : i64
        %290 = math.log2 %11 : tensor<8x15x9xf16>
        %291 = index.floordivs %135, %c4
        %292 = math.exp2 %59 : tensor<9x15x8xf16>
        %293 = bufferization.to_tensor %112 : memref<15x1xi32>
        %294 = math.log2 %6 : tensor<8x1x15xf16>
        %295 = arith.shli %c1069903657_i32, %c606377018_i32 : i32
        %296 = math.exp2 %cst_1 : f32
        affine.store %98, %alloc[%c7, %c4] : memref<15x1xi64>
        %297 = tensor.empty() : tensor<8xi32>
        %298 = math.fpowi %reduced, %297 : tensor<8xf32>, tensor<8xi32>
        %299 = math.floor %2 : tensor<15x1xf32>
        %300 = vector.gather %1[%c1, %89, %135] [%117], %138, %117 : tensor<8x15x9xi32>, vector<8x1x15xi32>, vector<8x1x15xi1>, vector<8x1x15xi32> into vector<8x1x15xi32>
        %301 = vector.broadcast %c11 : index to vector<15xindex>
        %302 = vector.broadcast %true_23 : i1 to vector<15xi1>
        %303 = vector.broadcast %cst_3 : f16 to vector<15xf16>
        vector.scatter %alloc_9[%c0, %c3, %c0] [%301], %302, %303 : memref<9x15x8xf16>, vector<15xindex>, vector<15xi1>, vector<15xf16>
        %304 = arith.shli %c606377018_i32, %c606377018_i32 : i32
        %305 = vector.multi_reduction <xor>, %126, %126 [] : vector<9x15x8xi1> to vector<9x15x8xi1>
        %306 = arith.shli %false, %false : i1
        %cast_44 = tensor.cast %22 : tensor<f32> to tensor<f32>
        %307 = bufferization.to_tensor %alloc_6 : memref<8x1x15xi64>
        %308 = affine.apply affine_map<(d0) -> (d0 - 20)>(%131)
        %309 = math.absi %c564459480_i64 : i64
        %310 = index.maxu %c15, %114
        %cast_45 = tensor.cast %11 : tensor<8x15x9xf16> to tensor<?x?x?xf16>
        %311 = index.maxu %c0, %c10
        affine.store %in, %alloc_11[%c0, %c0] : memref<15x1xi16>
        %312 = vector.insertelement %c1647736072_i64, %40[%c6 : index] : vector<1xi64>
        %313 = math.round %20 : tensor<8xf32>
        %314 = math.atan2 %10, %10 : tensor<8x1x15xf32>
        %315 = arith.maxui %c564459480_i64, %c1908153259_i64 : i64
        %alloc_46 = memref.alloc() : memref<8x15x9xi1>
        %alloca_47 = memref.alloca() : memref<8x1x15xf32>
        linalg.yield %c27427_i16 : i16
      } -> tensor<9x15x8xi16>
      %284 = vector.shuffle %40, %19 [0, 1] : vector<1xi64>, vector<1xi64>
      %285 = vector.matrix_multiply %36, %70 {lhs_columns = 1 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<1xi64>, vector<1xi64>) -> vector<1xi64>
      %286 = math.round %12 : tensor<8x1x15xf32>
      scf.yield
    }
    default {
      %273 = index.add %c7, %c0
      %274 = arith.divui %c1284375718_i64, %97 : i64
