module {
  func.func @func1(%arg0: memref<5x12x9xi32>, %arg1: vector<12xi64>, %arg2: f16) {
    %cst = arith.constant 1.48165606E+9 : f32
    %c11230_i16 = arith.constant 11230 : i16
    %cst_0 = arith.constant 1.92137126E+9 : f32
    %c1776638744_i64 = arith.constant 1776638744 : i64
    %true = arith.constant true
    %c630031197_i64 = arith.constant 630031197 : i64
    %c-31995_i16 = arith.constant -31995 : i16
    %c1187419239_i64 = arith.constant 1187419239 : i64
    %c1688055617_i64 = arith.constant 1688055617 : i64
    %c637244042_i64 = arith.constant 637244042 : i64
    %false = arith.constant false
    %c175706005_i64 = arith.constant 175706005 : i64
    %true_1 = arith.constant true
    %c1152786613_i32 = arith.constant 1152786613 : i32
    %cst_2 = arith.constant 5.801600e+04 : f16
    %c298900548_i64 = arith.constant 298900548 : i64
    %0 = tensor.empty() : tensor<5x5x5xi16>
    %1 = tensor.empty() : tensor<5x5x5xf32>
    %2 = tensor.empty() : tensor<10xi64>
    %3 = tensor.empty() : tensor<10xi32>
    %4 = tensor.empty() : tensor<10xf16>
    %5 = tensor.empty() : tensor<5x5x5xi16>
    %6 = tensor.empty() : tensor<5x12x9xi64>
    %7 = tensor.empty() : tensor<5x5x5xi16>
    %8 = tensor.empty() : tensor<5x5x5xi1>
    %9 = tensor.empty() : tensor<5x5x5xi1>
    %10 = tensor.empty() : tensor<10xi1>
    %11 = tensor.empty() : tensor<10xi1>
    %12 = tensor.empty() : tensor<5x12x9xf16>
    %13 = tensor.empty() : tensor<5x12x9xi16>
    %14 = tensor.empty() : tensor<10xi16>
    %15 = tensor.empty() : tensor<5x12x9xi64>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<5x5x5xf32>
    %alloc_3 = memref.alloc() : memref<5x12x9xi32>
    %alloc_4 = memref.alloc() : memref<12xf32>
    %alloc_5 = memref.alloc() : memref<5x12x9xf32>
    %alloc_6 = memref.alloc() : memref<12xi16>
    %alloc_7 = memref.alloc() : memref<5x12x9xi64>
    %alloc_8 = memref.alloc() : memref<12xi64>
    %alloc_9 = memref.alloc() : memref<5x12x9xf32>
    %alloc_10 = memref.alloc() : memref<5x12x9xi1>
    %alloc_11 = memref.alloc() : memref<12xf32>
    %alloc_12 = memref.alloc() : memref<5x12x9xf16>
    %alloc_13 = memref.alloc() : memref<5x5x5xf16>
    %alloc_14 = memref.alloc() : memref<10xi64>
    %alloc_15 = memref.alloc() : memref<5x5x5xf32>
    %alloc_16 = memref.alloc() : memref<12xi1>
    %alloc_17 = memref.alloc() : memref<5x12x9xi16>
    %16 = tensor.empty() : tensor<5x5x5xf32>
    %17 = linalg.copy ins(%1 : tensor<5x5x5xf32>) outs(%16 : tensor<5x5x5xf32>) -> tensor<5x5x5xf32>
    %alloc_18 = memref.alloc() : memref<9x5x12xf16>
    linalg.transpose ins(%alloc_12 : memref<5x12x9xf16>) outs(%alloc_18 : memref<9x5x12xf16>) permutation = [2, 0, 1] 
    %alloc_19 = memref.alloc() : memref<9xi16>
    linalg.reduce ins(%13 : tensor<5x12x9xi16>) outs(%alloc_19 : memref<9xi16>) dimensions = [0, 1] 
      (%in: i16, %init: i16) {
        %268 = math.roundeven %cst : f32
        %269 = index.sub %c11, %c0
        %270 = arith.remf %cst_2, %cst_2 : f16
        %271 = memref.atomic_rmw muli %c175706005_i64, %alloc_8[%c10] : (i64, memref<12xi64>) -> i64
        %272 = arith.addf %cst_0, %cst : f32
        %collapsed_48 = tensor.collapse_shape %13 [[0, 1], [2]] : tensor<5x12x9xi16> into tensor<60x9xi16>
        %273 = math.ceil %12 : tensor<5x12x9xf16>
        %274 = arith.mulf %cst, %cst_0 : f32
        %c1_i16 = arith.constant 1 : i16
        linalg.yield %c1_i16 : i16
      }
    %18 = scf.parallel (%arg3, %arg4) = (%c15, %c6) to (%c4, %c15) step (%c2, %c6) init (%c630031197_i64) -> i64 {
      %268 = math.fma %cst_2, %cst_2, %cst_2 : f16
      %269 = memref.load %alloc_15[%c2, %c0, %c1] : memref<5x5x5xf32>
      memref.copy %alloc_5, %alloc_9 : memref<5x12x9xf32> to memref<5x12x9xf32>
      %270 = math.roundeven %4 : tensor<10xf16>
      %271 = vector.broadcast %cst : f32 to vector<9xf32>
      %272 = vector.flat_transpose %271 {columns = 3 : i32, rows = 3 : i32} : vector<9xf32> -> vector<9xf32>
      %273 = index.ceildivs %arg3, %c2
      %274 = arith.maxsi %c637244042_i64, %c298900548_i64 : i64
      bufferization.dealloc_tensor %15 : tensor<5x12x9xi64>
      %275 = arith.maxui %c11230_i16, %c11230_i16 : i16
      %276 = vector.extract_strided_slice %271 {offsets = [5], sizes = [4], strides = [1]} : vector<9xf32> to vector<4xf32>
      %277 = math.round %1 : tensor<5x5x5xf32>
      %278 = arith.remf %cst_2, %cst_2 : f16
      %cst_48 = arith.constant 8.180000e+03 : f16
      %279 = math.log10 %12 : tensor<5x12x9xf16>
      %280 = vector.multi_reduction <mul>, %272, %272 [] : vector<9xf32> to vector<9xf32>
      %281 = math.exp2 %1 : tensor<5x5x5xf32>
      %c0_i64 = arith.constant 0 : i64
      scf.reduce(%c0_i64)  : i64 {
      ^bb0(%arg5: i64, %arg6: i64):
        %282 = arith.remui %c1776638744_i64, %c0_i64 : i64
        %283 = vector.transpose %272, [0] : vector<9xf32> to vector<9xf32>
        %284 = arith.cmpi sle, %arg5, %arg5 : i64
        %285 = vector.broadcast %true_1 : i1 to vector<i1>
        %286 = vector.transfer_write %285, %10[%c7] : vector<i1>, tensor<10xi1>
        %287 = math.log10 %1 : tensor<5x5x5xf32>
        %288 = vector.broadcast %cst_0 : f32 to vector<10xf32>
        %289 = index.ceildivu %c3, %c2
        %290 = arith.maxsi %c-31995_i16, %c11230_i16 : i16
        %c0_i64_49 = arith.constant 0 : i64
        scf.reduce.return %c0_i64_49 : i64
      }
      scf.yield
    }
    %19 = affine.vector_load %alloc_7[%c10, %c8, %c10] : memref<5x12x9xi64>, vector<9xi64>
    affine.vector_store %19, %alloc_14[%c12] : memref<10xi64>, vector<9xi64>
    %alloc_20 = memref.alloc() : memref<12xi64>
    %20 = tensor.empty() : tensor<i64>
    %21 = linalg.dot ins(%alloc_8, %alloc_20 : memref<12xi64>, memref<12xi64>) outs(%20 : tensor<i64>) -> tensor<i64>
    %22 = vector.broadcast %c637244042_i64 : i64 to vector<9x9xi64>
    %23 = vector.outerproduct %19, %19, %22 {kind = #vector.kind<add>} : vector<9xi64>, vector<9xi64>
    %24 = index.maxs %c2, %c13
    %25 = tensor.empty() : tensor<5x5x5xf16>
    %26 = index.ceildivu %c7, %c15
    %27 = arith.mulf %cst, %cst_0 : f32
    %28 = arith.divsi %c-31995_i16, %c-31995_i16 : i16
    %29 = vector.broadcast %c1688055617_i64 : i64 to vector<9x9xi64>
    %30 = vector.outerproduct %19, %19, %29 {kind = #vector.kind<or>} : vector<9xi64>, vector<9xi64>
    %31 = arith.minui %c630031197_i64, %c1187419239_i64 : i64
    %32 = index.floordivs %c15, %c12
    %33 = memref.atomic_rmw ori %c637244042_i64, %alloc_8[%c9] : (i64, memref<12xi64>) -> i64
    %34 = vector.load %alloc_15[%c3, %c1, %c4] : memref<5x5x5xf32>, vector<10xf32>
    %35 = index.floordivs %c1, %c10
    %36 = index.add %c14, %c2
    %37 = index.ceildivu %c11, %35
    %38 = math.exp2 %cst_0 : f32
    %39 = vector.multi_reduction <minsi>, %19, %19 [] : vector<9xi64> to vector<9xi64>
    %40 = arith.minui %c637244042_i64, %c175706005_i64 : i64
    %41 = math.sqrt %25 : tensor<5x5x5xf16>
    %42 = arith.divsi %c637244042_i64, %c630031197_i64 : i64
    %43 = vector.reduction <add>, %34 : vector<10xf32> into f32
    %44 = affine.min affine_map<(d0, d1, d2) -> ((d2 floordiv 64) mod 64, d2 floordiv 64, d2 - 16, (d2 floordiv 64) mod 64)>(%c3, %26, %35)
    %45 = vector.broadcast %c3 : index to vector<12xindex>
    %46 = vector.broadcast %true_1 : i1 to vector<12xi1>
    %47 = vector.broadcast %c-31995_i16 : i16 to vector<12xi16>
    vector.scatter %alloc_19[%c5] [%45], %46, %47 : memref<9xi16>, vector<12xindex>, vector<12xi1>, vector<12xi16>
    %48 = math.atan2 %1, %16 : tensor<5x5x5xf32>
    %alloc_21 = memref.alloc() : memref<5x12x9xi16>
    memref.copy %alloc_17, %alloc_21 : memref<5x12x9xi16> to memref<5x12x9xi16>
    %49 = arith.remf %cst_0, %cst_0 : f32
    %50 = math.atan %17 : tensor<5x5x5xf32>
    %extracted = tensor.extract %16[%c4, %c1, %c2] : tensor<5x5x5xf32>
    %51 = math.log10 %25 : tensor<5x5x5xf16>
    %52 = scf.while (%arg3 = %alloc_14) : (memref<10xi64>) -> memref<10xi64> {
      %268 = arith.minui %true_1, %false : i1
      %expanded_48 = tensor.expand_shape %6 [[0], [1], [2, 3]] : tensor<5x12x9xi64> into tensor<5x12x9x1xi64>
      %269 = index.divs %c0, %c6
      affine.store %c-31995_i16, %alloc_17[%c6, %c11, %c6] : memref<5x12x9xi16>
      %270 = arith.minui %c1152786613_i32, %c1152786613_i32 : i32
      %271 = arith.shli %c11230_i16, %c11230_i16 : i16
      %272 = math.roundeven %1 : tensor<5x5x5xf32>
      %273 = math.tanh %4 : tensor<10xf16>
      scf.condition(%true) %alloc_14 : memref<10xi64>
    } do {
    ^bb0(%arg3: memref<10xi64>):
      %268 = arith.addf %cst_2, %cst_2 : f16
      %cast_48 = tensor.cast %20 : tensor<i64> to tensor<i64>
      %269 = arith.remui %true_1, %true : i1
      %270 = arith.remui %c11230_i16, %c11230_i16 : i16
      %271 = index.divs %c9, %35
      %272 = tensor.empty() : tensor<5x12x9xf16>
      %273 = arith.shli %c-31995_i16, %c-31995_i16 : i16
      %274 = arith.muli %c11230_i16, %c-31995_i16 : i16
      %275 = memref.realloc %alloc_19 : memref<9xi16> to memref<9xi16>
      %rank_49 = tensor.rank %9 : tensor<5x5x5xi1>
      %276 = vector.load %alloc_10[%c4, %c2, %c1] : memref<5x12x9xi1>, vector<10xi1>
      %277 = arith.remf %cst_2, %cst_2 : f16
      %extracted_50 = tensor.extract %8[%c4, %c1, %c1] : tensor<5x5x5xi1>
      %278 = arith.remf %cst_0, %extracted : f32
      %alloc_51 = memref.alloc() : memref<10x9xf16>
      %279 = tensor.empty() : tensor<9x5xf16>
      %280 = tensor.empty() : tensor<10x5xf16>
      %281 = linalg.matmul ins(%alloc_51, %279 : memref<10x9xf16>, tensor<9x5xf16>) outs(%280 : tensor<10x5xf16>) -> tensor<10x5xf16>
      %282 = vector.multi_reduction <maxf>, %34, %extracted [0] : vector<10xf32> to f32
      scf.yield %arg3 : memref<10xi64>
    }
    %alloc_22 = memref.alloc() : memref<10xi16>
    %53 = vector.broadcast %c11230_i16 : i16 to vector<5x12x9xi16>
    %54 = vector.broadcast %true : i1 to vector<5x12x9xi1>
    %55 = vector.broadcast %c1152786613_i32 : i32 to vector<5x12x9xi32>
    %56 = vector.gather %alloc_22[%c10] [%55], %54, %53 : memref<10xi16>, vector<5x12x9xi32>, vector<5x12x9xi1>, vector<5x12x9xi16> into vector<5x12x9xi16>
    %57 = index.maxu %c8, %c12
    %58 = tensor.empty() : tensor<5x5x5xi16>
    %59 = arith.minsi %c175706005_i64, %c1688055617_i64 : i64
    %60 = math.exp2 %12 : tensor<5x12x9xf16>
    %61 = arith.remsi %c637244042_i64, %c1776638744_i64 : i64
    %62 = affine.load %alloc_22[%c5] : memref<10xi16>
    %63 = math.exp %cst_2 : f16
    %64 = index.floordivs %37, %c3
    %65 = vector.broadcast %c11230_i16 : i16 to vector<5xi16>
    %66 = vector.multi_reduction <maxsi>, %56, %65 [1, 2] : vector<5x12x9xi16> to vector<5xi16>
    %67 = scf.execute_region -> f32 {
      %268 = arith.remf %cst, %cst : f32
      %269 = arith.addi %true_1, %false : i1
      %270 = arith.floordivsi %c637244042_i64, %c298900548_i64 : i64
      %271 = math.atan %cst : f32
      %272 = math.absi %14 : tensor<10xi16>
      %generated = tensor.generate %c12 {
      ^bb0(%arg3: index, %arg4: index, %arg5: index):
        %cst_49 = arith.constant 4.790400e+04 : f16
        %281 = vector.splat %cst_2 : vector<5x5x5xf16>
        %282 = math.rsqrt %cst : f32
        %283 = arith.cmpf true, %cst, %extracted : f32
        tensor.yield %c-31995_i16 : i16
      } : tensor<?x5x5xi16>
      %extracted_48 = tensor.extract %11[%c7] : tensor<10xi1>
      %273 = index.divs %26, %64
      %274 = index.add %c14, %35
      %275 = arith.muli %extracted_48, %true : i1
      %276 = bufferization.to_memref %4 : memref<10xf16>
      scf.if %false {
        %281 = index.ceildivu %c12, %c1
        %282 = vector.broadcast %extracted : f32 to vector<5x5x5xf32>
        %283 = vector.fma %282, %282, %282 : vector<5x5x5xf32>
        %284 = arith.remf %cst, %cst : f32
        %alloc_49 = memref.alloc() : memref<9x5xi16>
        %285 = tensor.empty() : tensor<5x9xi16>
        %286 = tensor.empty() : tensor<9x9xi16>
        %287 = linalg.matmul ins(%alloc_49, %285 : memref<9x5xi16>, tensor<5x9xi16>) outs(%286 : tensor<9x9xi16>) -> tensor<9x9xi16>
        %false_50 = index.bool.constant false
        %alloca_51 = memref.alloca() : memref<5x5x5xi16>
        %288 = math.tan %1 : tensor<5x5x5xf32>
        %289 = affine.min affine_map<(d0) -> (d0 ceildiv 16 + d0 + 5, -d0 + d0 ceildiv 16 - (d0 + 5))>(%36)
      } else {
        %281 = index.ceildivu %c0, %24
        %282 = math.atan2 %cst_0, %cst : f32
        %283 = math.atan %17 : tensor<5x5x5xf32>
        %284 = vector.broadcast %c11230_i16 : i16 to vector<10xi16>
        %285 = vector.transfer_write %284, %58[%c12, %c11, %c12] {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : vector<10xi16>, tensor<5x5x5xi16>
        %286 = memref.realloc %alloc_20 : memref<12xi64> to memref<9xi64>
        %287 = math.ceil %12 : tensor<5x12x9xf16>
        %288 = math.copysign %cst, %cst_0 : f32
        %289 = index.maxu %36, %c1
      }
      %277 = arith.cmpi ule, %c1688055617_i64, %c298900548_i64 : i64
      %278 = arith.remf %cst_0, %extracted : f32
      %279 = arith.remf %cst, %extracted : f32
      %280 = affine.max affine_map<(d0, d1) -> (d0)>(%c7, %c6)
      scf.yield %extracted : f32
    }
    %68 = arith.ori %c298900548_i64, %c298900548_i64 : i64
    %69 = math.ctpop %5 : tensor<5x5x5xi16>
    %70 = index.divs %36, %c1
    bufferization.dealloc_tensor %14 : tensor<10xi16>
    %71 = scf.index_switch %c1 -> memref<12xi64> 
    case 1 {
      %268 = arith.xori %62, %c11230_i16 : i16
      %269 = vector.reduction <or>, %65 : vector<5xi16> into i16
      %270 = vector.extract_strided_slice %56 {offsets = [1], sizes = [4], strides = [1]} : vector<5x12x9xi16> to vector<4x12x9xi16>
      %271 = arith.remsi %62, %c-31995_i16 : i16
      %272 = arith.remf %cst_2, %cst_2 : f16
      %273 = index.add %35, %c7
      %274 = vector.load %alloc_5[%c1, %c10, %c5] : memref<5x12x9xf32>, vector<12xf32>
      %collapsed_48 = tensor.collapse_shape %9 [[0, 1], [2]] : tensor<5x5x5xi1> into tensor<25x5xi1>
      %275 = arith.remf %extracted, %cst_0 : f32
      %276 = bufferization.to_tensor %alloc_14 : memref<10xi64>
      %277 = vector.load %alloc_11[%c6] : memref<12xf32>, vector<10xf32>
      %278 = math.exp %25 : tensor<5x5x5xf16>
      %279 = math.roundeven %25 : tensor<5x5x5xf16>
      %280 = arith.ori %c1688055617_i64, %c1187419239_i64 : i64
      %281 = math.absf %extracted : f32
      %282 = vector.broadcast %c637244042_i64 : i64 to vector<12xi64>
      %283 = vector.broadcast %false : i1 to vector<12xi1>
      %284 = vector.broadcast %c1152786613_i32 : i32 to vector<12xi32>
      %285 = vector.gather %6[%35, %c5, %c9] [%284], %283, %282 : tensor<5x12x9xi64>, vector<12xi32>, vector<12xi1>, vector<12xi64> into vector<12xi64>
      scf.yield %alloc_20 : memref<12xi64>
    }
    case 2 {
      %268 = affine.max affine_map<(d0) -> (-d0, d0 * 2, d0 * 2)>(%c6)
      %269 = math.log10 %4 : tensor<10xf16>
      %270 = math.copysign %1, %1 : tensor<5x5x5xf32>
      %271 = memref.realloc %alloc_14 : memref<10xi64> to memref<5xi64>
      %272 = vector.extract %65[1] : vector<5xi16>
      %false_48 = index.bool.constant false
      %273 = arith.xori %c630031197_i64, %c630031197_i64 : i64
      %274 = index.add %36, %c5
      %275 = math.roundeven %1 : tensor<5x5x5xf32>
      %276 = vector.transpose %56, [1, 2, 0] : vector<5x12x9xi16> to vector<12x9x5xi16>
      %277 = bufferization.to_memref %1 : memref<5x5x5xf32>
      bufferization.dealloc_tensor %7 : tensor<5x5x5xi16>
      %278 = arith.divsi %false_48, %false_48 : i1
      scf.if %false_48 {
        %281 = arith.maxf %cst_0, %cst_0 : f32
        bufferization.dealloc_tensor %10 : tensor<10xi1>
        %282 = math.round %12 : tensor<5x12x9xf16>
        %283 = math.floor %17 : tensor<5x5x5xf32>
        %collapsed_49 = tensor.collapse_shape %1 [[0, 1], [2]] : tensor<5x5x5xf32> into tensor<25x5xf32>
        %284 = arith.muli %false_48, %false : i1
        %285 = arith.shrsi %c1187419239_i64, %c637244042_i64 : i64
        bufferization.dealloc_tensor %10 : tensor<10xi1>
      }
      %279 = math.powf %25, %25 : tensor<5x5x5xf16>
      %280 = math.round %25 : tensor<5x5x5xf16>
      scf.yield %alloc_8 : memref<12xi64>
    }
    case 3 {
      %from_elements_48 = tensor.from_elements %c11230_i16, %62, %62, %c11230_i16, %c11230_i16, %62, %c-31995_i16, %62, %62, %62, %c11230_i16, %62, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %62, %c-31995_i16, %c-31995_i16, %62, %c-31995_i16, %62, %c-31995_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %62, %62, %62, %62, %62, %c11230_i16, %c-31995_i16, %62, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %62, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %62, %62, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %62, %62, %c11230_i16, %c-31995_i16, %62, %62, %c-31995_i16, %c11230_i16, %62, %62, %62, %c-31995_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %62, %62, %62, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %62, %62, %62, %c11230_i16, %c11230_i16, %62, %c11230_i16, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %62, %c11230_i16, %c-31995_i16, %62, %c-31995_i16, %c11230_i16, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %62, %62, %62, %62, %62, %c-31995_i16, %62, %62, %c11230_i16, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c11230_i16, %62, %c11230_i16, %c11230_i16, %62, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %62, %62, %c11230_i16, %62, %c-31995_i16, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %62, %62, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %62, %c-31995_i16, %62, %62, %62, %c-31995_i16, %62, %62, %c11230_i16, %62, %c-31995_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %62, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %62, %62, %c-31995_i16, %62, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %62, %c11230_i16, %62, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %62, %62, %c-31995_i16, %c11230_i16, %62, %c-31995_i16, %62, %62, %c11230_i16, %c-31995_i16, %62, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %62, %62, %62, %c11230_i16, %62, %c-31995_i16, %62, %c11230_i16, %62, %c-31995_i16, %62, %c-31995_i16, %c11230_i16, %c11230_i16, %c11230_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %62, %62, %c11230_i16, %c11230_i16, %62, %c11230_i16, %c11230_i16, %62, %c-31995_i16, %62, %c-31995_i16, %c-31995_i16, %c-31995_i16, %62, %62, %c-31995_i16, %c11230_i16, %c11230_i16, %62, %c11230_i16, %62, %c-31995_i16, %62, %62, %c-31995_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %62, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %62, %62, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %62, %62, %62, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %62, %c-31995_i16, %62, %c11230_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %62, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %c11230_i16, %c11230_i16, %62, %62, %62, %62, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %62, %c-31995_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c11230_i16, %c11230_i16, %62, %62, %62, %62, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %62, %c-31995_i16, %62, %c11230_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c11230_i16, %62, %62, %c-31995_i16, %c-31995_i16, %62, %c11230_i16, %62, %62, %62, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %62, %62, %c11230_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %62, %c-31995_i16, %62, %62, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %62, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c11230_i16, %c11230_i16, %62, %c-31995_i16, %c11230_i16, %62, %62, %c-31995_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %62, %62, %62, %c11230_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %62, %c-31995_i16, %c-31995_i16, %62, %c-31995_i16, %62, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %62, %c-31995_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %62, %c11230_i16, %62, %c-31995_i16, %62, %c-31995_i16, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %62, %c11230_i16, %62, %c-31995_i16, %62, %c-31995_i16, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %62, %c-31995_i16, %62, %c-31995_i16, %62, %c11230_i16, %c11230_i16, %c-31995_i16, %62, %c-31995_i16, %62, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %62, %62, %62, %c11230_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %62, %c11230_i16, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %62, %c11230_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %c-31995_i16, %62, %62, %62, %c11230_i16, %c-31995_i16, %62, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16, %c11230_i16, %62, %c11230_i16, %62, %c-31995_i16, %c-31995_i16, %62, %62, %62, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %62, %c11230_i16, %c-31995_i16, %c11230_i16, %c-31995_i16, %c11230_i16 : tensor<5x12x9xi16>
      %268 = memref.realloc %alloc_6 : memref<12xi16> to memref<10xi16>
      %269 = math.ctpop %c630031197_i64 : i64
      %270 = index.maxu %c1, %32
      %271 = arith.addf %cst_0, %67 : f32
      %272 = vector.broadcast %false : i1 to vector<5x12x9xi1>
      %273 = arith.divf %cst_2, %cst_2 : f16
      %274 = vector.broadcast %cst_0 : f32 to vector<5x12x9xf32>
      %275 = vector.fma %274, %274, %274 : vector<5x12x9xf32>
      %276 = arith.maxf %cst_0, %cst_0 : f32
      %277 = math.copysign %4, %4 : tensor<10xf16>
      %278 = vector.shuffle %19, %19 [0, 1, 3, 4, 5, 7, 13, 16] : vector<9xi64>, vector<9xi64>
      %279 = index.sizeof
      %280 = math.sqrt %16 : tensor<5x5x5xf32>
      %281 = math.exp2 %cst : f32
      %282 = arith.remf %cst_0, %67 : f32
      %283 = tensor.empty() : tensor<10xf16>
      scf.yield %alloc_20 : memref<12xi64>
    }
    case 4 {
      %extracted_48 = tensor.extract %3[%c2] : tensor<10xi32>
      %268 = tensor.empty() : tensor<12x9xi16>
      %alloc_49 = memref.alloc() : memref<9x12xi16>
      %269 = tensor.empty() : tensor<12x12xi16>
      %270 = linalg.matmul ins(%268, %alloc_49 : tensor<12x9xi16>, memref<9x12xi16>) outs(%269 : tensor<12x12xi16>) -> tensor<12x12xi16>
      affine.store %false, %alloc_16[%c9] : memref<12xi1>
      %271 = vector.broadcast %c-31995_i16 : i16 to vector<12x9x12x9xi16>
      %272 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2, d3, d4) -> (d4, d0, d1)>, affine_map<(d0, d1, d2, d3, d4) -> (d4, d2, d3)>, affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3)>], iterator_types = ["parallel", "parallel", "parallel", "parallel", "reduction"], kind = #vector.kind<minui>} %53, %56, %271 : vector<5x12x9xi16>, vector<5x12x9xi16> into vector<12x9x12x9xi16>
      %273 = arith.cmpf ule, %cst_2, %cst_2 : f16
      %274 = vector.broadcast %extracted_48 : i32 to vector<12x9x12x9xi32>
      %275 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2, d3, d4) -> (d4, d0, d1)>, affine_map<(d0, d1, d2, d3, d4) -> (d4, d2, d3)>, affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3)>], iterator_types = ["parallel", "parallel", "parallel", "parallel", "reduction"], kind = #vector.kind<maxui>} %55, %55, %274 : vector<5x12x9xi32>, vector<5x12x9xi32> into vector<12x9x12x9xi32>
      %276 = arith.divf %67, %cst_0 : f32
      %alloc_50 = memref.alloc() : memref<12xf32>
      %277 = arith.remf %extracted, %cst : f32
      %278 = index.castu %c1776638744_i64 : i64 to index
      %279 = index.ceildivu %26, %57
      %280 = arith.floordivsi %false, %true_1 : i1
      %281 = affine.max affine_map<(d0, d1, d2, d3) -> (d0, d0 + (d2 * 8) floordiv 16, (d0 + (d2 * 8) floordiv 16) * 128)>(%37, %c6, %279, %70)
      memref.store %62, %alloc_19[%c0] : memref<9xi16>
      %282 = bufferization.to_tensor %alloc_11 : memref<12xf32>
      %283 = memref.realloc %alloc_11 : memref<12xf32> to memref<9xf32>
      scf.yield %alloc_8 : memref<12xi64>
    }
    default {
      %268 = arith.minf %cst_0, %cst : f32
      %269 = scf.if %false -> (i1) {
        %288 = math.tanh %17 : tensor<5x5x5xf32>
        %289 = math.atan2 %4, %4 : tensor<10xf16>
        %expanded_48 = tensor.expand_shape %8 [[0], [1], [2, 3]] : tensor<5x5x5xi1> into tensor<5x5x5x1xi1>
        %290 = vector.shuffle %55, %55 [0, 2, 3, 4, 6, 7] : vector<5x12x9xi32>, vector<5x12x9xi32>
        %291 = arith.remf %67, %cst : f32
        %292 = bufferization.clone %alloc_22 : memref<10xi16> to memref<10xi16>
        %293 = math.ctpop %13 : tensor<5x12x9xi16>
        %alloc_49 = memref.alloc() : memref<10xf16>
        memref.tensor_store %4, %alloc_49 : memref<10xf16>
        scf.yield %true_1 : i1
      } else {
        %288 = affine.max affine_map<(d0, d1, d2, d3) -> (-d3, d3 - d1 * 32 + 1)>(%c13, %c3, %26, %c1)
        %289 = math.tan %4 : tensor<10xf16>
        %290 = bufferization.to_tensor %alloc_22 : memref<10xi16>
        %291 = index.divu %c1, %64
        %292 = math.atan %16 : tensor<5x5x5xf32>
        %293 = math.expm1 %extracted : f32
        %294 = vector.load %alloc_12[%c3, %c9, %c0] : memref<5x12x9xf16>, vector<12xf16>
        %extracted_48 = tensor.extract %9[%c4, %c1, %c0] : tensor<5x5x5xi1>
        scf.yield %false : i1
      }
      %270 = vector.extract %54[1] : vector<5x12x9xi1>
      %271 = math.log10 %extracted : f32
      %272 = math.roundeven %cst_2 : f16
      %273 = arith.divsi %c298900548_i64, %c1688055617_i64 : i64
      %274 = vector.broadcast %c1152786613_i32 : i32 to vector<5x9xi32>
      %dest, %accumulated_value = vector.scan <minui>, %55, %274 {inclusive = true, reduction_dim = 1 : i64} : vector<5x12x9xi32>, vector<5x9xi32>
      %275 = arith.xori %c1187419239_i64, %c298900548_i64 : i64
      %276 = arith.addf %extracted, %67 : f32
      %277 = arith.maxsi %true, %false : i1
      %278 = arith.mulf %cst_2, %cst_2 : f16
      %279 = arith.remui %269, %269 : i1
      %280 = vector.broadcast %c6 : index to vector<5xindex>
      %281 = vector.broadcast %true : i1 to vector<5xi1>
      %282 = vector.broadcast %cst : f32 to vector<5xf32>
      vector.scatter %alloc_15[%c1, %c3, %c2] [%280], %281, %282 : memref<5x5x5xf32>, vector<5xindex>, vector<5xi1>, vector<5xf32>
      %283 = vector.broadcast %37 : index to vector<12xindex>
      %284 = vector.broadcast %false : i1 to vector<12xi1>
      %285 = vector.broadcast %c1688055617_i64 : i64 to vector<12xi64>
      vector.scatter %alloc_7[%c4, %c5, %c0] [%283], %284, %285 : memref<5x12x9xi64>, vector<12xindex>, vector<12xi1>, vector<12xi64>
      %286 = math.expm1 %cst : f32
      %287 = memref.atomic_rmw addf %cst, %alloc[%c0, %c3, %c1] : (f32, memref<5x5x5xf32>) -> f32
      scf.yield %alloc_8 : memref<12xi64>
    }
    %72 = math.sqrt %67 : f32
    %73 = vector.multi_reduction <xor>, %19, %19 [] : vector<9xi64> to vector<9xi64>
    %74 = index.castu %false : i1 to index
    %75 = arith.ori %62, %c11230_i16 : i16
    %76 = arith.remf %cst_2, %cst_2 : f16
    %77 = math.exp %cst : f32
    %78 = math.log10 %4 : tensor<10xf16>
    %79 = arith.floordivsi %true_1, %true : i1
    %80 = index.mul %c0, %c14
    %81 = index.ceildivu %c15, %c9
    memref.tensor_store %6, %alloc_7 : memref<5x12x9xi64>
    %82 = math.absi %14 : tensor<10xi16>
    %83 = vector.broadcast %c1776638744_i64 : i64 to vector<5x12x9xi64>
    %84 = vector.broadcast %c1152786613_i32 : i32 to vector<12x9x12x9xi32>
    %85 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2, d3, d4) -> (d4, d0, d1)>, affine_map<(d0, d1, d2, d3, d4) -> (d4, d2, d3)>, affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3)>], iterator_types = ["parallel", "parallel", "parallel", "parallel", "reduction"], kind = #vector.kind<or>} %55, %55, %84 : vector<5x12x9xi32>, vector<5x12x9xi32> into vector<12x9x12x9xi32>
    %86 = arith.ori %c298900548_i64, %c1187419239_i64 : i64
    %87 = math.fma %cst_2, %cst_2, %cst_2 : f16
    %88 = affine.apply affine_map<(d0, d1, d2, d3) -> (d3)>(%c2, %80, %c13, %26)
    bufferization.dealloc_tensor %25 : tensor<5x5x5xf16>
    %89 = arith.divsi %false, %true_1 : i1
    %90 = math.absi %3 : tensor<10xi32>
    %false_23 = index.bool.constant false
    %91 = vector.broadcast %80 : index to vector<9xindex>
    %92 = vector.broadcast %false : i1 to vector<9xi1>
    %93 = vector.broadcast %c11230_i16 : i16 to vector<9xi16>
    vector.scatter %alloc_17[%c1, %c10, %c6] [%91], %92, %93 : memref<5x12x9xi16>, vector<9xindex>, vector<9xi1>, vector<9xi16>
    %94 = math.ctpop %true_1 : i1
    %95 = index.ceildivs %c13, %24
    %collapsed = tensor.collapse_shape %5 [[0, 1], [2]] : tensor<5x5x5xi16> into tensor<25x5xi16>
    %96 = memref.atomic_rmw maxu %62, %alloc_19[%c2] : (i16, memref<9xi16>) -> i16
    %97 = index.maxu %80, %70
    %alloca = memref.alloca() : memref<5x5x5xi32>
    %98 = math.sqrt %4 : tensor<10xf16>
    %99 = arith.remui %c175706005_i64, %c630031197_i64 : i64
    memref.store %extracted, %alloc[%c3, %c0, %c2] : memref<5x5x5xf32>
    %100 = vector.flat_transpose %34 {columns = 5 : i32, rows = 2 : i32} : vector<10xf32> -> vector<10xf32>
    %101 = index.divu %c1, %44
    %102 = vector.broadcast %c637244042_i64 : i64 to vector<10xi64>
    %103 = arith.shli %false, %true_1 : i1
    %alloc_24 = memref.alloc() : memref<9x5x12xf16>
    memref.copy %alloc_18, %alloc_24 : memref<9x5x12xf16> to memref<9x5x12xf16>
    %104 = arith.xori %c637244042_i64, %c1776638744_i64 : i64
    %from_elements = tensor.from_elements %false, %false_23, %true_1, %true_1, %true_1, %true, %true, %false_23, %false_23, %true_1 : tensor<10xi1>
    %true_25 = index.bool.constant true
    %105 = memref.atomic_rmw assign %cst, %alloc_15[%c3, %c1, %c0] : (f32, memref<5x5x5xf32>) -> f32
    %106 = arith.minsi %c1688055617_i64, %c298900548_i64 : i64
    %107 = index.sizeof
    %alloc_26 = memref.alloc() : memref<5x10xi16>
    %108 = tensor.empty() : tensor<25x10xi16>
    %109 = linalg.matmul ins(%collapsed, %alloc_26 : tensor<25x5xi16>, memref<5x10xi16>) outs(%108 : tensor<25x10xi16>) -> tensor<25x10xi16>
    %expanded = tensor.expand_shape %25 [[0], [1], [2, 3]] : tensor<5x5x5xf16> into tensor<5x5x5x1xf16>
    %110 = affine.apply affine_map<(d0) -> (d0 * -2)>(%88)
    %111 = affine.max affine_map<(d0, d1) -> (((d1 + 8) ceildiv 8) floordiv 8 - (d1 + 8))>(%c1, %26)
    scf.if %true {
      %268 = math.round %extracted : f32
      %269 = arith.remui %c11230_i16, %c-31995_i16 : i16
      %270 = math.atan %cst_0 : f32
      %271 = arith.maxui %c1688055617_i64, %c175706005_i64 : i64
      %272 = vector.insertelement %extracted, %34[%32 : index] : vector<10xf32>
      %273 = vector.broadcast %c14 : index to vector<12xindex>
      %274 = vector.broadcast %false_23 : i1 to vector<12xi1>
      %275 = vector.broadcast %cst : f32 to vector<12xf32>
      vector.scatter %alloc_11[%c10] [%273], %274, %275 : memref<12xf32>, vector<12xindex>, vector<12xi1>, vector<12xf32>
      %276 = index.casts %57 : index to i32
      %277 = math.atan2 %12, %12 : tensor<5x12x9xf16>
    }
    %112 = vector.broadcast %107 : index to vector<5xindex>
    %113 = vector.broadcast %true : i1 to vector<5xi1>
    vector.scatter %alloc_19[%c6] [%112], %113, %65 : memref<9xi16>, vector<5xindex>, vector<5xi1>, vector<5xi16>
    %114 = arith.maxf %cst, %67 : f32
    %115 = arith.maxui %c1152786613_i32, %c1152786613_i32 : i32
    %116 = index.divs %c12, %c11
    %117 = vector.load %alloc_11[%c10] : memref<12xf32>, vector<5x12x9xf32>
    %true_27 = index.bool.constant true
    bufferization.dealloc_tensor %13 : tensor<5x12x9xi16>
    %collapsed_28 = tensor.collapse_shape %collapsed [[0, 1]] : tensor<25x5xi16> into tensor<125xi16>
    %118 = index.sub %35, %74
    %119 = math.round %cst_0 : f32
    %120 = math.atan %4 : tensor<10xf16>
    %from_elements_29 = tensor.from_elements %c1152786613_i32, %c1152786613_i32, %c1152786613_i32, %c1152786613_i32, %c1152786613_i32, %c1152786613_i32, %c1152786613_i32, %c1152786613_i32, %c1152786613_i32, %c1152786613_i32 : tensor<10xi32>
    %splat = tensor.splat %cst_0 : tensor<10xf32>
    %121 = math.atan2 %67, %extracted : f32
    %122 = index.ceildivu %c12, %116
    %123 = index.castu %107 : index to i32
    %124 = tensor.empty() : tensor<5x12x9xf32>
    scf.if %true_1 {
      %268 = index.sub %c8, %111
      %269 = math.tan %cst_0 : f32
      %cst_48 = arith.constant 0x4E66FE21 : f32
      %270 = math.rsqrt %124 : tensor<5x12x9xf32>
      %271 = arith.divsi %c630031197_i64, %c1688055617_i64 : i64
      %272 = math.rsqrt %cst_0 : f32
      affine.store %true_25, %alloc_16[%c2] : memref<12xi1>
      %273 = math.fpowi %4, %3 : tensor<10xf16>, tensor<10xi32>
    }
    %125 = arith.maxsi %c175706005_i64, %c1776638744_i64 : i64
    %126 = vector.reduction <add>, %19 : vector<9xi64> into i64
    %127 = bufferization.to_tensor %alloc_22 : memref<10xi16>
    %128 = vector.broadcast %cst_0 : f32 to vector<12xf32>
    %129 = vector.fma %128, %128, %128 : vector<12xf32>
    %130 = arith.remui %true_1, %true_1 : i1
    %131 = math.atan %17 : tensor<5x5x5xf32>
    %132 = math.round %1 : tensor<5x5x5xf32>
    %133 = vector.broadcast %116 : index to vector<12xindex>
    %134 = vector.broadcast %false : i1 to vector<12xi1>
    %135 = vector.broadcast %cst_2 : f16 to vector<12xf16>
    vector.scatter %alloc_18[%c8, %c4, %c0] [%133], %134, %135 : memref<9x5x12xf16>, vector<12xindex>, vector<12xi1>, vector<12xf16>
    bufferization.dealloc_tensor %58 : tensor<5x5x5xi16>
    %136 = arith.minf %cst_0, %cst_0 : f32
    %137 = index.mul %c10, %88
    %138 = memref.atomic_rmw muli %c-31995_i16, %alloc_22[%c1] : (i16, memref<10xi16>) -> i16
    %inserted = tensor.insert %c11230_i16 into %127[%c1] : tensor<10xi16>
    %139 = index.castu %c1 : index to i32
    %140 = arith.remf %cst, %67 : f32
    %141 = math.copysign %67, %67 : f32
    %142 = math.round %4 : tensor<10xf16>
    %143 = bufferization.to_tensor %alloc_13 : memref<5x5x5xf16>
    %extracted_30 = tensor.extract %13[%c1, %c8, %c1] : tensor<5x12x9xi16>
    %144 = memref.load %alloc_22[%c3] : memref<10xi16>
    %145 = math.absi %collapsed_28 : tensor<125xi16>
    %146 = arith.muli %c175706005_i64, %c1688055617_i64 : i64
    %alloc_31 = memref.alloc() : memref<5x5x5xf16>
    %147 = index.sizeof
    %rank = tensor.rank %25 : tensor<5x5x5xf16>
    %148 = math.log10 %12 : tensor<5x12x9xf16>
    %149 = math.expm1 %124 : tensor<5x12x9xf32>
    %150 = math.round %12 : tensor<5x12x9xf16>
    %151 = index.mul %24, %c3
    %152 = scf.execute_region -> i1 {
      %268 = arith.maxui %c-31995_i16, %c-31995_i16 : i16
      %269 = bufferization.to_memref %3 : memref<10xi32>
      %270 = vector.flat_transpose %65 {columns = 5 : i32, rows = 1 : i32} : vector<5xi16> -> vector<5xi16>
      %271 = math.log1p %1 : tensor<5x5x5xf32>
      %272 = arith.cmpi ule, %c1187419239_i64, %c1187419239_i64 : i64
      %273 = vector.broadcast %cst_2 : f16 to vector<12xf16>
      %274 = vector.broadcast %false_23 : i1 to vector<12xi1>
      %275 = vector.maskedload %alloc_18[%c4, %c3, %c9], %274, %273 : memref<9x5x12xf16>, vector<12xi1>, vector<12xf16> into vector<12xf16>
      %276 = index.maxs %95, %36
      %277 = index.casts %c2 : index to i32
      %278 = arith.cmpi sgt, %true_25, %true_1 : i1
      %279 = math.copysign %67, %67 : f32
      %280 = vector.matrix_multiply %273, %273 {lhs_columns = 12 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<12xf16>, vector<12xf16>) -> vector<1xf16>
      %281 = vector.load %alloc_7[%c3, %c11, %c2] : memref<5x12x9xi64>, vector<5x5x5xi64>
      %282 = vector.broadcast %c1152786613_i32 : i32 to vector<5x5x5xi32>
      %from_elements_48 = tensor.from_elements %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2 : tensor<5x5x5xf16>
      %283 = arith.minui %c630031197_i64, %c1776638744_i64 : i64
      %284 = vector.flat_transpose %102 {columns = 5 : i32, rows = 2 : i32} : vector<10xi64> -> vector<10xi64>
      scf.yield %false_23 : i1
    }
    %cast = tensor.cast %8 : tensor<5x5x5xi1> to tensor<?x?x?xi1>
    %153 = arith.mulf %67, %cst_0 : f32
    %154 = math.exp2 %1 : tensor<5x5x5xf32>
    %155 = arith.shli %false_23, %true_1 : i1
    %156 = arith.maxf %extracted, %extracted : f32
    %157 = vector.broadcast %95 : index to vector<12xindex>
    %158 = vector.broadcast %false : i1 to vector<12xi1>
    vector.scatter %alloc_11[%c6] [%157], %158, %129 : memref<12xf32>, vector<12xindex>, vector<12xi1>, vector<12xf32>
    %159 = arith.maxsi %c298900548_i64, %c1688055617_i64 : i64
    %160 = vector.broadcast %c630031197_i64 : i64 to vector<10x10xi64>
    %161 = vector.outerproduct %102, %102, %160 {kind = #vector.kind<xor>} : vector<10xi64>, vector<10xi64>
    %162 = index.divs %74, %57
    %163 = index.add %88, %c4
    %164 = arith.minsi %c175706005_i64, %c1776638744_i64 : i64
    %165 = vector.broadcast %62 : i16 to vector<i16>
    vector.transfer_write %165, %alloc_6[%57] : vector<i16>, memref<12xi16>
    %166 = index.divs %80, %111
    %alloca_32 = memref.alloca() : memref<5x12x9xi16>
    %167 = affine.max affine_map<(d0, d1, d2) -> (-(d2 + 128), d2, d2 + 128)>(%101, %36, %111)
    %168 = math.ctpop %21 : tensor<i64>
    %169 = vector.broadcast %c637244042_i64 : i64 to vector<5x12xi64>
    %170 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>, affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = ["parallel", "parallel", "reduction"], kind = #vector.kind<add>} %83, %19, %169 : vector<5x12x9xi64>, vector<9xi64> into vector<5x12xi64>
    %171 = arith.addf %extracted, %extracted : f32
    %172 = math.exp2 %4 : tensor<10xf16>
    %alloca_33 = memref.alloca() : memref<5x5x5xf32>
    scf.if %false {
      %alloc_48 = memref.alloc() : memref<10xi32>
      %268 = arith.xori %extracted_30, %c11230_i16 : i16
      %269 = arith.mulf %67, %cst : f32
      %270 = affine.if affine_set<(d0, d1, d2) : (-d1 == 0, (d1 * 2 - 64) ceildiv 64 == 0, (d1 * 2 - 64) ceildiv 64 >= 0, -d1 >= 0)>(%c9, %c3, %c2) -> i64 {
        %274 = math.tanh %25 : tensor<5x5x5xf16>
        %275 = index.sizeof
        bufferization.dealloc_tensor %6 : tensor<5x12x9xi64>
        %276 = math.log1p %cst_0 : f32
        %277 = arith.minf %cst_2, %cst_2 : f16
        %278 = math.floor %67 : f32
        %279 = memref.realloc %alloc_20 : memref<12xi64> to memref<10xi64>
        %280 = math.rsqrt %16 : tensor<5x5x5xf32>
        affine.yield %c175706005_i64 : i64
      } else {
        %274 = index.sub %c1, %122
        %275 = arith.xori %true_25, %false : i1
        %276 = memref.realloc %alloc_19 : memref<9xi16> to memref<5xi16>
        %277 = math.exp %67 : f32
        %extracted_50 = tensor.extract %124[%c4, %c6, %c6] : tensor<5x12x9xf32>
        %278 = arith.addf %extracted, %cst : f32
        %279 = arith.remui %extracted_30, %extracted_30 : i16
        %280 = vector.reduction <minf>, %129 : vector<12xf32> into f32
        affine.yield %c1776638744_i64 : i64
      }
      %from_elements_49 = tensor.from_elements %c637244042_i64, %c1776638744_i64, %c1688055617_i64, %c637244042_i64, %c1688055617_i64, %c630031197_i64, %c1187419239_i64, %c298900548_i64, %c1776638744_i64, %c1187419239_i64, %c1187419239_i64, %c298900548_i64, %c637244042_i64, %c630031197_i64, %c1688055617_i64, %c1776638744_i64, %c637244042_i64, %c298900548_i64, %c637244042_i64, %c1688055617_i64, %c637244042_i64, %c1688055617_i64, %c1187419239_i64, %c298900548_i64, %c630031197_i64, %c1776638744_i64, %c175706005_i64, %c175706005_i64, %c1688055617_i64, %c1187419239_i64, %c1776638744_i64, %c1187419239_i64, %c1776638744_i64, %c298900548_i64, %c1688055617_i64, %c1688055617_i64, %c1187419239_i64, %c1688055617_i64, %c637244042_i64, %c1776638744_i64, %c1776638744_i64, %c1187419239_i64, %c1187419239_i64, %c298900548_i64, %c1187419239_i64, %c630031197_i64, %c637244042_i64, %c1776638744_i64, %c637244042_i64, %c1688055617_i64, %c1688055617_i64, %c1187419239_i64, %c175706005_i64, %c1187419239_i64, %c637244042_i64, %c630031197_i64, %c298900548_i64, %c298900548_i64, %c637244042_i64, %c1688055617_i64, %c298900548_i64, %c175706005_i64, %c630031197_i64, %c630031197_i64, %c637244042_i64, %c637244042_i64, %c298900548_i64, %c1187419239_i64, %c637244042_i64, %c1688055617_i64, %c630031197_i64, %c175706005_i64, %c1776638744_i64, %c175706005_i64, %c1187419239_i64, %c1776638744_i64, %c1776638744_i64, %c637244042_i64, %c1776638744_i64, %c1688055617_i64, %c298900548_i64, %c298900548_i64, %c637244042_i64, %c175706005_i64, %c630031197_i64, %c175706005_i64, %c298900548_i64, %c637244042_i64, %c1187419239_i64, %c1776638744_i64, %c1688055617_i64, %c637244042_i64, %c1688055617_i64, %c1776638744_i64, %c630031197_i64, %c1187419239_i64, %c175706005_i64, %c630031197_i64, %c1688055617_i64, %c1688055617_i64, %c637244042_i64, %c1776638744_i64, %c298900548_i64, %c1688055617_i64, %c630031197_i64, %c175706005_i64, %c1776638744_i64, %c298900548_i64, %c1187419239_i64, %c630031197_i64, %c1776638744_i64, %c637244042_i64, %c1688055617_i64, %c1776638744_i64, %c1776638744_i64, %c1776638744_i64, %c298900548_i64, %c175706005_i64, %c630031197_i64, %c298900548_i64, %c175706005_i64, %c1187419239_i64, %c175706005_i64, %c1187419239_i64, %c630031197_i64 : tensor<5x5x5xi64>
      %271 = affine.if affine_set<(d0, d1, d2, d3) : (d1 == 0, d2 - d1 + 16 == 0, d0 * -16 >= 0, d0 == 0)>(%c5, %c4, %c5, %c15) -> memref<5x5x5xi64> {
        %splat_50 = tensor.splat %c298900548_i64 : tensor<12xi64>
        %274 = arith.cmpf ord, %extracted, %cst : f32
        %275 = arith.maxf %cst, %extracted : f32
        %276 = vector.extract %54[0, 0] : vector<5x12x9xi1>
        %alloca_51 = memref.alloca() : memref<5x12x9xi64>
        %277 = arith.remf %cst_2, %cst_2 : f16
        %278 = index.castu %true : i1 to index
        %279 = index.add %c7, %118
        %alloc_52 = memref.alloc() : memref<5x5x5xi64>
        affine.yield %alloc_52 : memref<5x5x5xi64>
      } else {
        %274 = memref.realloc %alloc_4 : memref<12xf32> to memref<12xf32>
        %275 = memref.realloc %alloc_22 : memref<10xi16> to memref<10xi16>
        %276 = arith.minsi %true_1, %true_27 : i1
        %277 = arith.xori %c1776638744_i64, %c1776638744_i64 : i64
        %278 = arith.mulf %cst_2, %cst_2 : f16
        %279 = index.mul %c12, %97
        %280 = arith.remui %c1187419239_i64, %c1187419239_i64 : i64
        %281 = math.log10 %1 : tensor<5x5x5xf32>
        %alloc_50 = memref.alloc() : memref<5x5x5xi64>
        affine.yield %alloc_50 : memref<5x5x5xi64>
      }
      %272 = math.atan %1 : tensor<5x5x5xf32>
      %273 = arith.remsi %c1776638744_i64, %c1776638744_i64 : i64
    } else {
      %splat_48 = tensor.splat %c1776638744_i64 : tensor<5x5x5xi64>
      %268 = scf.index_switch %c10 -> vector<5x12x9xf32> 
      case 1 {
        %275 = vector.broadcast %c-31995_i16 : i16 to vector<12x9xi16>
        %276 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2) -> (d2)>, affine_map<(d0, d1, d2) -> (d2, d0, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = ["parallel", "parallel", "reduction"], kind = #vector.kind<or>} %65, %53, %275 : vector<5xi16>, vector<5x12x9xi16> into vector<12x9xi16>
        %c432727567_i32 = arith.constant 432727567 : i32
        %277 = arith.divsi %c1152786613_i32, %c1152786613_i32 : i32
        %278 = index.divs %c14, %95
        %alloc_49 = memref.alloc() : memref<5x12x9xi64>
        memref.copy %alloc_7, %alloc_49 : memref<5x12x9xi64> to memref<5x12x9xi64>
        %279 = index.maxu %35, %116
        %inserted_50 = tensor.insert %cst_2 into %143[%c2, %c4, %c4] : tensor<5x5x5xf16>
        %extracted_51 = tensor.extract %4[%c2] : tensor<10xf16>
        %280 = arith.cmpi ule, %true, %152 : i1
        %281 = vector.broadcast %true_1 : i1 to vector<12x5xi1>
        %282 = vector.transfer_write %281, %8[%151, %c6, %c4] {permutation_map = affine_map<(d0, d1, d2) -> (d0, d1)>} : vector<12x5xi1>, tensor<5x5x5xi1>
        %283 = arith.xori %c637244042_i64, %c175706005_i64 : i64
        %284 = arith.maxsi %62, %extracted_30 : i16
        %extracted_52 = tensor.extract %6[%c3, %c8, %c2] : tensor<5x12x9xi64>
        memref.tensor_store %25, %alloc_13 : memref<5x5x5xf16>
        %alloca_53 = memref.alloca() : memref<12xi32>
        %285 = math.exp %cst_0 : f32
        scf.yield %117 : vector<5x12x9xf32>
      }
      case 2 {
        %275 = math.exp %cst_2 : f16
        %276 = math.round %67 : f32
        %277 = arith.maxui %c630031197_i64, %c175706005_i64 : i64
        %278 = arith.muli %c1688055617_i64, %c637244042_i64 : i64
        %279 = index.divu %111, %c9
        %280 = index.ceildivs %163, %24
        %281 = bufferization.to_memref %from_elements : memref<10xi1>
        %282 = math.fpowi %extracted, %c1152786613_i32 : f32, i32
        %283 = arith.maxf %67, %cst_0 : f32
        %284 = index.castu %111 : index to i32
        %285 = arith.minsi %c1152786613_i32, %c1152786613_i32 : i32
        %286 = math.atan2 %extracted, %cst_0 : f32
        %287 = index.ceildivu %110, %137
        %288 = arith.minsi %extracted_30, %extracted_30 : i16
        %289 = bufferization.to_memref %11 : memref<10xi1>
        %290 = math.atan2 %cst_2, %cst_2 : f16
        scf.yield %117 : vector<5x12x9xf32>
      }
      default {
        %expanded_49 = tensor.expand_shape %11 [[0, 1]] : tensor<10xi1> into tensor<10x1xi1>
        %275 = math.ipowi %6, %6 : tensor<5x12x9xi64>
        %276 = arith.mulf %cst_0, %cst : f32
        %277 = arith.remsi %extracted_30, %62 : i16
        %278 = math.sqrt %12 : tensor<5x12x9xf16>
        %279 = vector.transpose %100, [0] : vector<10xf32> to vector<10xf32>
        %280 = math.fma %cst_2, %cst_2, %cst_2 : f16
        %281 = arith.addf %cst, %extracted : f32
        %282 = math.sqrt %1 : tensor<5x5x5xf32>
        %283 = math.expm1 %143 : tensor<5x5x5xf16>
        bufferization.dealloc_tensor %15 : tensor<5x12x9xi64>
        %284 = index.sub %101, %162
        %285 = vector.reduction <maxui>, %102 : vector<10xi64> into i64
        %cast_50 = tensor.cast %1 : tensor<5x5x5xf32> to tensor<?x?x?xf32>
        %286 = vector.splat %88 : vector<10xindex>
        %287 = index.sizeof
        scf.yield %117 : vector<5x12x9xf32>
      }
      %269 = math.exp2 %1 : tensor<5x5x5xf32>
      %270 = vector.load %alloc_16[%c3] : memref<12xi1>, vector<12xi1>
      %271 = arith.remsi %c1152786613_i32, %c1152786613_i32 : i32
      %272 = math.atan %cst_2 : f16
      %273 = index.add %95, %64
      %274 = bufferization.to_memref %8 : memref<5x5x5xi1>
    }
    %173 = arith.remf %67, %cst : f32
    vector.print %56 : vector<5x12x9xi16>
    %174 = vector.extract %19[4] : vector<9xi64>
    %175 = math.exp2 %124 : tensor<5x12x9xf32>
    %176 = math.atan2 %16, %16 : tensor<5x5x5xf32>
    %177 = index.maxu %c3, %24
    %178 = math.log1p %17 : tensor<5x5x5xf32>
