module {
  func.func nested @func1(%arg0: tensor<2xi32>) -> memref<3x15xi16> {
    %cst = arith.constant 0x4DA42FB3 : f32
    %true = arith.constant true
    %c744113698_i64 = arith.constant 744113698 : i64
    %cst_0 = arith.constant 2.08930483E+9 : f32
    %c-20430_i16 = arith.constant -20430 : i16
    %cst_1 = arith.constant 3.195200e+04 : f16
    %c355370246_i64 = arith.constant 355370246 : i64
    %false = arith.constant false
    %cst_2 = arith.constant 5.404800e+04 : f16
    %cst_3 = arith.constant 4.956800e+04 : f16
    %c156345344_i64 = arith.constant 156345344 : i64
    %false_4 = arith.constant false
    %c3052_i16 = arith.constant 3052 : i16
    %c366308732_i64 = arith.constant 366308732 : i64
    %c-2423_i16 = arith.constant -2423 : i16
    %c1563714217_i64 = arith.constant 1563714217 : i64
    %0 = tensor.empty() : tensor<16x16x2xf32>
    %1 = tensor.empty() : tensor<16x16x2xi32>
    %2 = tensor.empty() : tensor<2xi1>
    %3 = tensor.empty() : tensor<2x15xi1>
    %4 = tensor.empty() : tensor<16x16x2xi32>
    %5 = tensor.empty() : tensor<16x16x2xf32>
    %6 = tensor.empty() : tensor<2x15xi32>
    %7 = tensor.empty() : tensor<2x15xi32>
    %8 = tensor.empty() : tensor<16x16x2xi64>
    %9 = tensor.empty() : tensor<3x15xf16>
    %10 = tensor.empty() : tensor<3x15xi64>
    %11 = tensor.empty() : tensor<2xf32>
    %12 = tensor.empty() : tensor<16x16x2xi16>
    %13 = tensor.empty() : tensor<3x15xi16>
    %14 = tensor.empty() : tensor<2x15xi16>
    %15 = tensor.empty() : tensor<3x15xi64>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<2x15xi64>
    %alloc_5 = memref.alloc() : memref<2xf16>
    %alloc_6 = memref.alloc() : memref<3x15xi32>
    %alloc_7 = memref.alloc() : memref<2xf32>
    %alloc_8 = memref.alloc() : memref<2xi64>
    %alloc_9 = memref.alloc() : memref<3x15xi1>
    %alloc_10 = memref.alloc() : memref<16x16x2xf32>
    %alloc_11 = memref.alloc() : memref<2xi64>
    %alloc_12 = memref.alloc() : memref<3x15xi32>
    %alloc_13 = memref.alloc() : memref<3x15xf32>
    %alloc_14 = memref.alloc() : memref<2xf16>
    %alloc_15 = memref.alloc() : memref<2xi1>
    %alloc_16 = memref.alloc() : memref<3x15xi64>
    %alloc_17 = memref.alloc() : memref<3x15xi1>
    %alloc_18 = memref.alloc() : memref<16x16x2xi64>
    %alloc_19 = memref.alloc() : memref<2x15xi1>
    %16 = tensor.empty() : tensor<2x15xi16>
    %17 = linalg.copy ins(%14 : tensor<2x15xi16>) outs(%16 : tensor<2x15xi16>) -> tensor<2x15xi16>
    %alloc_20 = memref.alloc() : memref<2xi1>
    linalg.transpose ins(%alloc_15 : memref<2xi1>) outs(%alloc_20 : memref<2xi1>) permutation = [0] 
    %18 = tensor.empty() : tensor<i64>
    %reduced = linalg.reduce ins(%alloc_11 : memref<2xi64>) outs(%18 : tensor<i64>) dimensions = [0] 
      (%in: i64, %init: i64) {
        %243 = affine.min affine_map<(d0) -> ((((d0 - 16) floordiv 32) ceildiv 4) floordiv 8 - 128)>(%c12)
        %244 = index.sub %c5, %c1
        %245 = vector.broadcast %cst_0 : f32 to vector<16xf32>
        %246 = vector.matrix_multiply %245, %245 {lhs_columns = 16 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<16xf32>, vector<16xf32>) -> vector<1xf32>
        %247 = index.casts %c2 : index to i32
        %248 = arith.minsi %c355370246_i64, %c1563714217_i64 : i64
        scf.if %false {
          %251 = math.floor %5 : tensor<16x16x2xf32>
          %252 = vector.broadcast %c10 : index to vector<3xindex>
          %253 = vector.broadcast %false : i1 to vector<3xi1>
          vector.scatter %alloc_19[%c1, %c12] [%252], %253, %253 : memref<2x15xi1>, vector<3xindex>, vector<3xi1>, vector<3xi1>
          %254 = bufferization.to_tensor %alloc_10 : memref<16x16x2xf32>
          memref.store %true, %alloc_17[%c1, %c9] : memref<3x15xi1>
          vector.print %246 : vector<1xf32>
          %255 = math.absi %13 : tensor<3x15xi16>
          %256 = arith.maxf %cst_2, %cst_1 : f16
          %257 = math.absi %13 : tensor<3x15xi16>
        }
        %249 = math.fpowi %0, %4 : tensor<16x16x2xf32>, tensor<16x16x2xi32>
        %250 = math.tanh %cst_0 : f32
        %c0_i64 = arith.constant 0 : i64
        linalg.yield %c0_i64 : i64
      }
    %19 = scf.parallel (%arg1, %arg2) = (%c12, %c10) to (%c10, %c0) step (%c14, %c11) init (%12) -> tensor<16x16x2xi16> {
      %243 = bufferization.to_tensor %alloc_16 : memref<3x15xi64>
      %244 = math.log10 %9 : tensor<3x15xf16>
      %245 = affine.if affine_set<(d0, d1, d2, d3) : (((-d3) ceildiv 16) ceildiv 32 == 0, d0 >= 0, (-d3) ceildiv 16 >= 0)>(%c2, %c7, %c0, %c13) -> memref<3x15xi1> {
        %255 = math.log %11 : tensor<2xf32>
        %expanded_56 = tensor.expand_shape %16 [[0], [1, 2]] : tensor<2x15xi16> into tensor<2x15x1xi16>
        %256 = affine.max affine_map<(d0, d1) -> ((d0 + 1) * 2, d1 floordiv 64 - d1, d1 mod 32 - (d1 + d1 floordiv 64 - d1 + 2) ceildiv 128)>(%c7, %arg2)
        %257 = index.floordivs %c13, %c5
        %258 = math.log10 %5 : tensor<16x16x2xf32>
        %collapsed_57 = tensor.collapse_shape %16 [[0, 1]] : tensor<2x15xi16> into tensor<30xi16>
        %alloc_58 = memref.alloc() : memref<3x15xi16>
        %259 = tensor.empty() : tensor<3x15xi32>
        %260 = math.fpowi %9, %259 : tensor<3x15xf16>, tensor<3x15xi32>
        affine.yield %alloc_17 : memref<3x15xi1>
      } else {
        %255 = math.roundeven %cst : f32
        %splat_56 = tensor.splat %false_4 : tensor<16x16x2xi1>
        %256 = math.absf %cst : f32
        %257 = math.log %5 : tensor<16x16x2xf32>
        %258 = index.divu %c5, %c5
        %259 = vector.broadcast %c744113698_i64 : i64 to vector<2x15xi64>
        %260 = vector.transpose %259, [1, 0] : vector<2x15xi64> to vector<15x2xi64>
        %261 = vector.broadcast %cst : f32 to vector<2x15xf32>
        %262 = vector.fma %261, %261, %261 : vector<2x15xf32>
        %263 = math.round %9 : tensor<3x15xf16>
        affine.yield %alloc_17 : memref<3x15xi1>
      }
      memref.store %cst_2, %alloc_14[%c0] : memref<2xf16>
      %246 = vector.broadcast %c355370246_i64 : i64 to vector<1xi64>
      %247 = vector.extract_strided_slice %246 {offsets = [0], sizes = [1], strides = [1]} : vector<1xi64> to vector<1xi64>
      memref.store %c156345344_i64, %alloc_8[%c0] : memref<2xi64>
      %collapsed_52 = tensor.collapse_shape %13 [[0, 1]] : tensor<3x15xi16> into tensor<45xi16>
      %248 = scf.index_switch %c1 -> i64 
      case 1 {
        %255 = arith.minf %cst_3, %cst_3 : f16
        %256 = math.log10 %cst_0 : f32
        %257 = vector.broadcast %cst : f32 to vector<2x15xf32>
        %258 = vector.fma %257, %257, %257 : vector<2x15xf32>
        %259 = math.round %cst_0 : f32
        %260 = math.cttz %12 : tensor<16x16x2xi16>
        %261 = tensor.empty(%c11, %c9) : tensor<?x16x?xi64>
        %from_elements_56 = tensor.from_elements %cst, %cst_0 : tensor<2xf32>
        %262 = math.log10 %cst : f32
        %263 = index.ceildivs %arg1, %c0
        %264 = index.ceildivu %263, %c13
        %265 = index.mul %264, %arg1
        %266 = arith.ceildivsi %c3052_i16, %c-2423_i16 : i16
        %267 = arith.maxf %cst_1, %cst_3 : f16
        %collapsed_57 = tensor.collapse_shape %8 [[0, 1], [2]] : tensor<16x16x2xi64> into tensor<256x2xi64>
        %268 = arith.subi %c156345344_i64, %c156345344_i64 : i64
        %alloc_58 = memref.alloc() : memref<3x15xf32>
        memref.copy %alloc_13, %alloc_58 : memref<3x15xf32> to memref<3x15xf32>
        scf.yield %c366308732_i64 : i64
      }
      case 2 {
        %255 = vector.shuffle %247, %246 [1] : vector<1xi64>, vector<1xi64>
        %alloca_56 = memref.alloca() : memref<3x15xi16>
        %256 = math.log1p %9 : tensor<3x15xf16>
        %257 = math.rsqrt %cst : f32
        %258 = affine.min affine_map<(d0, d1, d2) -> (d0 - 1, d1 floordiv 8 - (d2 floordiv 2 + d0), d1 ceildiv 32 + d1 + 4, d1 - d1 ceildiv 32 + 8)>(%c7, %c1, %c13)
        %259 = vector.insertelement %c156345344_i64, %247[%c3 : index] : vector<1xi64>
        %260 = vector.broadcast %c744113698_i64 : i64 to vector<1x1xi64>
        %261 = vector.outerproduct %247, %246, %260 {kind = #vector.kind<mul>} : vector<1xi64>, vector<1xi64>
        %262 = arith.minui %c3052_i16, %c-2423_i16 : i16
        %263 = vector.splat %c355370246_i64 : vector<2x15xi64>
        %264 = arith.xori %c744113698_i64, %c156345344_i64 : i64
        %265 = index.mul %c13, %c13
        %266 = affine.max affine_map<(d0) -> (d0 ceildiv 128, -d0, d0 * -3, (d0 * -2) mod 8)>(%c1)
        %267 = math.log2 %9 : tensor<3x15xf16>
        %268 = index.mul %c2, %c1
        %c1_i32_57 = arith.constant 1 : i32
        %269 = vector.broadcast %c1_i32_57 : i32 to vector<3x16x16xi32>
        %270 = vector.broadcast %c1_i32_57 : i32 to vector<3x16xi32>
        %dest_58, %accumulated_value_59 = vector.scan <minui>, %269, %270 {inclusive = false, reduction_dim = 2 : i64} : vector<3x16x16xi32>, vector<3x16xi32>
        memref.store %cst, %alloc_10[%c12, %c11, %c0] : memref<16x16x2xf32>
        scf.yield %c744113698_i64 : i64
      }
      default {
        %255 = affine.min affine_map<(d0) -> ((-d0) floordiv 128)>(%c13)
        %256 = math.rsqrt %9 : tensor<3x15xf16>
        %257 = math.round %5 : tensor<16x16x2xf32>
        %258 = arith.maxf %cst_0, %cst_0 : f32
        %259 = math.sqrt %11 : tensor<2xf32>
        %260 = vector.broadcast %c156345344_i64 : i64 to vector<16xi64>
        %261 = vector.broadcast %true : i1 to vector<16xi1>
        %262 = vector.maskedload %alloc_8[%c0], %261, %260 : memref<2xi64>, vector<16xi1>, vector<16xi64> into vector<16xi64>
        %263 = tensor.empty() : tensor<15x15xi1>
        %264 = tensor.empty() : tensor<2x15xi1>
        %265 = linalg.matmul ins(%3, %263 : tensor<2x15xi1>, tensor<15x15xi1>) outs(%264 : tensor<2x15xi1>) -> tensor<2x15xi1>
        %266 = arith.shrui %c-2423_i16, %c-20430_i16 : i16
        %267 = arith.maxf %cst_1, %cst_1 : f16
        %268 = vector.broadcast %cst : f32 to vector<16xf32>
        %269 = vector.maskedload %alloc_10[%c3, %c8, %c1], %261, %268 : memref<16x16x2xf32>, vector<16xi1>, vector<16xf32> into vector<16xf32>
        %270 = vector.multi_reduction <minsi>, %261, %261 [] : vector<16xi1> to vector<16xi1>
        %271 = arith.ori %true, %true : i1
        %272 = arith.remui %c156345344_i64, %c156345344_i64 : i64
        %273 = arith.minf %cst_2, %cst_2 : f16
        %274 = math.log2 %11 : tensor<2xf32>
        %275 = vector.broadcast %c10 : index to vector<3xindex>
        %276 = vector.broadcast %false : i1 to vector<3xi1>
        vector.scatter %alloc_15[%c1] [%275], %276, %276 : memref<2xi1>, vector<3xindex>, vector<3xi1>, vector<3xi1>
        scf.yield %c1563714217_i64 : i64
      }
      %collapsed_53 = tensor.collapse_shape %10 [[0, 1]] : tensor<3x15xi64> into tensor<45xi64>
      %249 = affine.max affine_map<(d0, d1, d2) -> (d1 ceildiv 8 - 16, d0, d0 + 2)>(%c13, %c15, %c14)
      %collapsed_54 = tensor.collapse_shape %13 [[0, 1]] : tensor<3x15xi16> into tensor<45xi16>
      %250 = arith.addf %cst_2, %cst_3 : f16
      %251 = affine.min affine_map<(d0) -> (64, d0 mod 128, d0 mod 128)>(%c6)
      %252 = arith.minui %false, %false_4 : i1
      %253 = arith.shrsi %c3052_i16, %c3052_i16 : i16
      %alloc_55 = memref.alloc() : memref<3x15xf16>
      memref.tensor_store %9, %alloc_55 : memref<3x15xf16>
      %254 = tensor.empty() : tensor<16x16x2xi16>
      scf.reduce(%254)  : tensor<16x16x2xi16> {
      ^bb0(%arg3: tensor<16x16x2xi16>, %arg4: tensor<16x16x2xi16>):
        bufferization.dealloc_tensor %7 : tensor<2x15xi32>
        %255 = math.powf %0, %5 : tensor<16x16x2xf32>
        %true_56 = index.bool.constant true
        %256 = arith.remf %cst_1, %cst_1 : f16
        %splat_57 = tensor.splat %c-2423_i16 : tensor<2xi16>
        %257 = index.mul %c11, %c11
        bufferization.dealloc_tensor %collapsed_52 : tensor<45xi16>
        %expanded_58 = tensor.expand_shape %2 [[0, 1]] : tensor<2xi1> into tensor<2x1xi1>
        %258 = tensor.empty() : tensor<16x16x2xi16>
        scf.reduce.return %258 : tensor<16x16x2xi16>
      }
      scf.yield
    }
    %20 = affine.vector_load %alloc_5[%c5] : memref<2xf16>, vector<15xf16>
    affine.vector_store %20, %alloc_14[%c6] : memref<2xf16>, vector<15xf16>
    %alloc_21 = memref.alloc() : memref<2xi1>
    %21 = tensor.empty() : tensor<i1>
    %22 = linalg.dot ins(%2, %alloc_21 : tensor<2xi1>, memref<2xi1>) outs(%21 : tensor<i1>) -> tensor<i1>
    %23 = math.cttz %c1563714217_i64 : i64
    %24 = math.rsqrt %0 : tensor<16x16x2xf32>
    %alloc_22 = memref.alloc() : memref<3x15xi64>
    memref.copy %alloc_16, %alloc_22 : memref<3x15xi64> to memref<3x15xi64>
    %25 = math.atan2 %cst_2, %cst_2 : f16
    %false_23 = arith.constant false
    %26 = vector.transpose %20, [0] : vector<15xf16> to vector<15xf16>
    scf.index_switch %c7 
    case 1 {
      %c-11160_i16 = arith.constant -11160 : i16
      %243 = affine.max affine_map<(d0, d1) -> (d0 + 64, d0, -(d1 - 64), -64)>(%c14, %c15)
      %c0_i32_52 = arith.constant 0 : i32
      memref.store %c0_i32_52, %alloc_6[%c0, %c13] : memref<3x15xi32>
      scf.execute_region {
        %254 = math.log10 %cst : f32
        %255 = math.log2 %0 : tensor<16x16x2xf32>
        %256 = vector.reduction <maxf>, %20 : vector<15xf16> into f16
        %alloc_54 = memref.alloc() : memref<3x15xf32>
        memref.copy %alloc_13, %alloc_54 : memref<3x15xf32> to memref<3x15xf32>
        %alloc_55 = memref.alloc() : memref<3x15xf32>
        %257 = arith.shrsi %c1563714217_i64, %c156345344_i64 : i64
        memref.store %false, %alloc_21[%c1] : memref<2xi1>
        %258 = vector.broadcast %c744113698_i64 : i64 to vector<15x2x16xi64>
        %259 = vector.broadcast %c366308732_i64 : i64 to vector<15x2xi64>
        %dest_56, %accumulated_value_57 = vector.scan <mul>, %258, %259 {inclusive = true, reduction_dim = 2 : i64} : vector<15x2x16xi64>, vector<15x2xi64>
        %260 = bufferization.clone %alloc_19 : memref<2x15xi1> to memref<2x15xi1>
        %261 = math.tanh %11 : tensor<2xf32>
        %262 = vector.insertelement %cst_3, %20[%c0 : index] : vector<15xf16>
        %263 = vector.splat %cst_2 : vector<2x15xf16>
        %264 = vector.extract_strided_slice %20 {offsets = [9], sizes = [6], strides = [1]} : vector<15xf16> to vector<6xf16>
        %265 = vector.broadcast %cst_2 : f16 to vector<6x6xf16>
        %266 = vector.outerproduct %264, %264, %265 {kind = #vector.kind<mul>} : vector<6xf16>, vector<6xf16>
        %267 = bufferization.clone %alloc_8 : memref<2xi64> to memref<2xi64>
        %268 = index.ceildivu %c6, %c0
        scf.yield
      }
      %244 = math.round %11 : tensor<2xf32>
      memref.store %false_4, %alloc_21[%c0] : memref<2xi1>
      %245 = math.fpowi %0, %1 : tensor<16x16x2xf32>, tensor<16x16x2xi32>
      %246 = arith.remui %c3052_i16, %c3052_i16 : i16
      %247 = math.fma %cst_3, %cst_3, %cst_3 : f16
      %248 = scf.if %true -> (memref<3x15xi32>) {
        %254 = affine.load %alloc_13[%c8, %c5] : memref<3x15xf32>
        %collapsed_54 = tensor.collapse_shape %9 [[0, 1]] : tensor<3x15xf16> into tensor<45xf16>
        %255 = vector.broadcast %c3 : index to vector<16xindex>
        %256 = vector.broadcast %true : i1 to vector<16xi1>
        %257 = vector.broadcast %c1563714217_i64 : i64 to vector<16xi64>
        vector.scatter %alloc[%c1, %c9] [%255], %256, %257 : memref<2x15xi64>, vector<16xindex>, vector<16xi1>, vector<16xi64>
        %258 = index.sub %c6, %c2
        %259 = arith.remf %cst, %254 : f32
        %260 = math.fma %cst_3, %cst_1, %cst_1 : f16
        %261 = index.maxs %c13, %c13
        memref.store %c355370246_i64, %alloc_11[%c0] : memref<2xi64>
        scf.yield %alloc_6 : memref<3x15xi32>
      } else {
        %254 = index.sub %243, %c13
        %255 = index.maxu %c15, %c12
        %256 = arith.minsi %c1563714217_i64, %c744113698_i64 : i64
        %257 = bufferization.clone %alloc_14 : memref<2xf16> to memref<2xf16>
        memref.store %false_4, %alloc_20[%c1] : memref<2xi1>
        %258 = index.mul %255, %c10
        %259 = arith.shrsi %c156345344_i64, %c156345344_i64 : i64
        %260 = arith.ceildivsi %c366308732_i64, %c355370246_i64 : i64
        scf.yield %alloc_12 : memref<3x15xi32>
      }
      %249 = math.log %cst_3 : f16
      %250 = math.ceil %cst_0 : f32
      %generated_53 = tensor.generate %243 {
      ^bb0(%arg1: index):
        %254 = vector.reduction <mul>, %20 : vector<15xf16> into f16
        %255 = vector.bitcast %20 : vector<15xf16> to vector<15xf16>
        %cast_54 = tensor.cast %0 : tensor<16x16x2xf32> to tensor<?x?x?xf32>
        %256 = vector.insertelement %cst_1, %20[%c8 : index] : vector<15xf16>
        tensor.yield %c3052_i16 : i16
      } : tensor<?xi16>
      %251 = math.roundeven %cst_2 : f16
      %252 = scf.execute_region -> index {
        %254 = arith.minf %cst_1, %cst_3 : f16
        %255 = math.rsqrt %9 : tensor<3x15xf16>
        %256 = vector.reduction <maxf>, %20 : vector<15xf16> into f16
        %257 = vector.multi_reduction <maxf>, %20, %20 [] : vector<15xf16> to vector<15xf16>
        %258 = math.exp2 %cst_3 : f16
        %259 = vector.broadcast %c744113698_i64 : i64 to vector<3xi64>
        %260 = vector.broadcast %false_4 : i1 to vector<3xi1>
        %261 = vector.maskedload %alloc_8[%c0], %260, %259 : memref<2xi64>, vector<3xi1>, vector<3xi64> into vector<3xi64>
        %cst_54 = arith.constant 8.816000e+03 : f16
        %262 = math.fma %5, %5, %0 : tensor<16x16x2xf32>
        %263 = vector.broadcast %cst_0 : f32 to vector<3x16x3xf32>
        %264 = vector.broadcast %cst_0 : f32 to vector<3x3xf32>
        %dest_55, %accumulated_value_56 = vector.scan <add>, %263, %264 {inclusive = true, reduction_dim = 1 : i64} : vector<3x16x3xf32>, vector<3x3xf32>
        %265 = vector.extract_strided_slice %260 {offsets = [0], sizes = [1], strides = [1]} : vector<3xi1> to vector<1xi1>
        %266 = bufferization.clone %alloc_8 : memref<2xi64> to memref<2xi64>
        %267 = math.tanh %0 : tensor<16x16x2xf32>
        %268 = index.mul %c1, %c13
        %269 = arith.ori %false_4, %true : i1
        %270 = arith.xori %false, %false : i1
        %271 = arith.remsi %c366308732_i64, %c156345344_i64 : i64
        scf.yield %c11 : index
      }
      %253 = vector.reduction <minf>, %20 : vector<15xf16> into f16
      scf.yield
    }
    case 2 {
      %243 = index.sizeof
      %244 = math.log10 %cst_0 : f32
      %245 = index.floordivs %c13, %c4
      %generated_52 = tensor.generate %c7 {
      ^bb0(%arg1: index):
        %259 = vector.multi_reduction <maxf>, %20, %20 [] : vector<15xf16> to vector<15xf16>
        %from_elements_59 = tensor.from_elements %cst_0, %cst_0 : tensor<2xf32>
        memref.copy %alloc_6, %alloc_12 : memref<3x15xi32> to memref<3x15xi32>
        %260 = math.log %11 : tensor<2xf32>
        tensor.yield %cst_1 : f16
      } : tensor<?xf16>
      memref.store %cst_2, %alloc_14[%c1] : memref<2xf16>
      %splat_53 = tensor.splat %c355370246_i64 : tensor<16x16x2xi64>
      %246 = arith.ceildivsi %c-2423_i16, %c-20430_i16 : i16
      %247 = math.round %5 : tensor<16x16x2xf32>
      %248 = affine.if affine_set<(d0) : (d0 ceildiv 8 - d0 == 0, d0 ceildiv 8 - d0 >= 0, -d0 == 0, ((-d0) ceildiv 128) * 4 - (d0 ceildiv 128 + d0 ceildiv 8) - (d0 ceildiv 8 - d0) == 0)>(%c14) -> memref<2xi64> {
        %259 = arith.maxf %cst_3, %cst_1 : f16
        %260 = math.exp %5 : tensor<16x16x2xf32>
        %261 = arith.shrui %c1563714217_i64, %c744113698_i64 : i64
        %262 = vector.shuffle %20, %20 [0, 2, 3, 5, 9, 12, 13, 20, 21, 23, 28] : vector<15xf16>, vector<15xf16>
        %263 = math.log %cst_1 : f16
        %264 = math.cttz %8 : tensor<16x16x2xi64>
        %265 = arith.ori %c355370246_i64, %c156345344_i64 : i64
        %collapsed_59 = tensor.collapse_shape %4 [[0, 1], [2]] : tensor<16x16x2xi32> into tensor<256x2xi32>
        affine.yield %alloc_11 : memref<2xi64>
      } else {
        %259 = affine.apply affine_map<(d0, d1, d2) -> ((d0 - 16) * 2 - d1)>(%c13, %c0, %c7)
        %260 = arith.addf %cst, %cst_0 : f32
        %261 = vector.broadcast %c3 : index to vector<15xindex>
        %262 = vector.broadcast %false : i1 to vector<15xi1>
        vector.scatter %alloc_20[%c0] [%261], %262, %262 : memref<2xi1>, vector<15xindex>, vector<15xi1>, vector<15xi1>
        %263 = math.absi %18 : tensor<i64>
        %264 = vector.extract_strided_slice %20 {offsets = [3], sizes = [1], strides = [1]} : vector<15xf16> to vector<1xf16>
        %alloc_59 = memref.alloc() : memref<2x15xi1>
        memref.copy %alloc_19, %alloc_59 : memref<2x15xi1> to memref<2x15xi1>
        %265 = arith.remui %false_4, %true : i1
        %266 = memref.load %alloc_11[%c0] : memref<2xi64>
        affine.yield %alloc_8 : memref<2xi64>
      }
      %249 = math.log %11 : tensor<2xf32>
      %c0_i32_54 = arith.constant 0 : i32
      %250 = vector.broadcast %c0_i32_54 : i32 to vector<2x16xi32>
      %251 = vector.broadcast %c0_i32_54 : i32 to vector<16xi32>
      %dest_55, %accumulated_value_56 = vector.scan <minsi>, %250, %251 {inclusive = true, reduction_dim = 0 : i64} : vector<2x16xi32>, vector<16xi32>
      %252 = arith.xori %c-2423_i16, %c-2423_i16 : i16
      %253 = math.roundeven %0 : tensor<16x16x2xf32>
      %254 = vector.broadcast %cst_3 : f16 to vector<16x15xf16>
      %dest_57, %accumulated_value_58 = vector.scan <maxf>, %254, %20 {inclusive = true, reduction_dim = 0 : i64} : vector<16x15xf16>, vector<15xf16>
      %255 = math.copysign %cst_1, %cst_3 : f16
      %256 = tensor.empty() : tensor<15x2xi1>
      %257 = tensor.empty() : tensor<2x2xi1>
      %258 = linalg.matmul ins(%3, %256 : tensor<2x15xi1>, tensor<15x2xi1>) outs(%257 : tensor<2x2xi1>) -> tensor<2x2xi1>
      scf.yield
    }
    case 3 {
      %243 = math.log10 %cst : f32
      %244 = math.cttz %4 : tensor<16x16x2xi32>
      %splat_52 = tensor.splat %cst_0 : tensor<16x16x2xf32>
      %splat_53 = tensor.splat %false_4 : tensor<16x16x2xi1>
      %245 = affine.max affine_map<(d0, d1) -> (d1 mod 2, d1 mod 2)>(%c15, %c2)
      %246 = vector.broadcast %cst_2 : f16 to vector<15x15xf16>
      %247 = vector.outerproduct %20, %20, %246 {kind = #vector.kind<mul>} : vector<15xf16>, vector<15xf16>
      %248 = math.atan2 %11, %11 : tensor<2xf32>
      %249 = affine.min affine_map<(d0, d1) -> ((d0 - 48) floordiv 128, d0 - 56)>(%c0, %245)
      memref.copy %alloc_17, %alloc_9 : memref<3x15xi1> to memref<3x15xi1>
      %250 = bufferization.clone %alloc_9 : memref<3x15xi1> to memref<3x15xi1>
      %251 = math.cttz %17 : tensor<2x15xi16>
      %252 = arith.remf %cst_0, %cst : f32
      %253 = vector.reduction <mul>, %20 : vector<15xf16> into f16
      %254 = arith.maxsi %c1563714217_i64, %c1563714217_i64 : i64
      %255 = index.add %c15, %c3
      %256 = math.round %11 : tensor<2xf32>
      scf.yield
    }
    case 4 {
      bufferization.dealloc_tensor %6 : tensor<2x15xi32>
      memref.copy %alloc_21, %alloc_20 : memref<2xi1> to memref<2xi1>
      memref.store %cst, %alloc_10[%c15, %c2, %c0] : memref<16x16x2xf32>
      %243 = arith.muli %false, %false : i1
      %244 = index.castu %c14 : index to i32
      %245 = arith.ceildivsi %true, %false : i1
      %246 = arith.addi %c366308732_i64, %c156345344_i64 : i64
      %247 = tensor.empty(%c13) : tensor<?xi64>
      %248 = arith.ori %c-20430_i16, %c3052_i16 : i16
      %249 = bufferization.to_tensor %alloc_5 : memref<2xf16>
      %250 = math.atan %9 : tensor<3x15xf16>
      %251 = index.divu %c10, %c2
      %alloc_52 = memref.alloc() : memref<16x16x2xi32>
      %252 = arith.ori %c156345344_i64, %c1563714217_i64 : i64
      %253 = math.absi %12 : tensor<16x16x2xi16>
      %254 = arith.shrsi %c-20430_i16, %c3052_i16 : i16
      scf.yield
    }
    default {
      %243 = arith.subi %c-20430_i16, %c-20430_i16 : i16
      %244 = math.round %cst_2 : f16
      %from_elements_52 = tensor.from_elements %false, %false, %false_4, %false_4, %true, %false, %false_4, %false_4, %false, %false, %true, %true, %false, %false_4, %false_4, %false, %false, %false, %false, %false_4, %true, %true, %false_4, %false_4, %false_4, %false, %false, %true, %false_4, %true : tensor<2x15xi1>
      %245 = arith.remf %cst_0, %cst_0 : f32
      %246 = tensor.empty(%c4, %c12, %c10) : tensor<?x?x?xf16>
      %247 = bufferization.clone %alloc_12 : memref<3x15xi32> to memref<3x15xi32>
      %248 = arith.remui %true, %false_4 : i1
      %249 = index.mul %c15, %c3
      bufferization.dealloc_tensor %18 : tensor<i64>
      %250 = bufferization.to_tensor %alloc_16 : memref<3x15xi64>
      %alloc_53 = memref.alloc() : memref<2x15xi32>
      memref.tensor_store %6, %alloc_53 : memref<2x15xi32>
      %251 = index.floordivs %c2, %c0
      %252 = math.roundeven %11 : tensor<2xf32>
      %253 = math.exp %9 : tensor<3x15xf16>
      %254 = affine.min affine_map<(d0, d1, d2) -> (d0 * 2048 + 8, d0 * 2048)>(%c11, %c15, %c7)
      %255 = math.log10 %9 : tensor<3x15xf16>
    }
    %27 = affine.max affine_map<(d0, d1) -> (d1, d1 mod 128, d1 mod 128 - 2)>(%c2, %c10)
    %28 = arith.divf %cst_2, %cst_2 : f16
    %29 = scf.execute_region -> index {
      %243 = index.ceildivs %c11, %c2
      %244 = index.divu %c15, %27
      memref.store %c156345344_i64, %alloc[%c1, %c5] : memref<2x15xi64>
      %245 = math.atan2 %9, %9 : tensor<3x15xf16>
      %246 = arith.remsi %c-2423_i16, %c-2423_i16 : i16
      %247 = index.mul %c4, %c5
      %248 = affine.min affine_map<(d0, d1, d2) -> (d2 ceildiv 16, (d1 - (d0 + 64)) ceildiv 64, d1)>(%c11, %c12, %c2)
      %false_52 = index.bool.constant false
      %c0_i32_53 = arith.constant 0 : i32
      %249 = vector.broadcast %c0_i32_53 : i32 to vector<3xi32>
      %250 = vector.transfer_write %249, %7[%243, %243] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<3xi32>, tensor<2x15xi32>
      %251 = vector.multi_reduction <minsi>, %249, %c0_i32_53 [0] : vector<3xi32> to i32
      %252 = arith.shli %c366308732_i64, %c156345344_i64 : i64
      %253 = vector.transpose %20, [0] : vector<15xf16> to vector<15xf16>
      %254 = index.ceildivs %c4, %c11
      %true_54 = index.bool.constant true
      %255 = tensor.empty() : tensor<3x15xi1>
      %mapped_55 = linalg.map ins(%alloc_9, %alloc_9 : memref<3x15xi1>, memref<3x15xi1>) outs(%255 : tensor<3x15xi1>)
        (%in: i1, %in_56: i1) {
          %257 = math.roundeven %cst_2 : f16
          %258 = arith.ceildivsi %c0_i32_53, %251 : i32
          %259 = math.round %11 : tensor<2xf32>
          %260 = tensor.empty() : tensor<2xi32>
          %261 = math.fpowi %11, %260 : tensor<2xf32>, tensor<2xi32>
          %262 = arith.remf %cst_2, %cst_3 : f16
          bufferization.dealloc_tensor %8 : tensor<16x16x2xi64>
          %263 = math.cttz %4 : tensor<16x16x2xi32>
          %264 = math.fma %9, %9, %9 : tensor<3x15xf16>
          %265 = math.copysign %0, %5 : tensor<16x16x2xf32>
          %266 = arith.maxf %cst_2, %cst_3 : f16
          %267 = arith.remf %cst_0, %cst_0 : f32
          %268 = math.ceil %cst_2 : f16
          %269 = vector.multi_reduction <minf>, %20, %20 [] : vector<15xf16> to vector<15xf16>
          %270 = math.round %cst_2 : f16
          %271 = vector.transpose %249, [0] : vector<3xi32> to vector<3xi32>
          %272 = arith.cmpi eq, %c366308732_i64, %c366308732_i64 : i64
          %273 = index.sub %c1, %c5
          %274 = arith.minui %true_54, %true_54 : i1
          %275 = arith.ori %c744113698_i64, %c744113698_i64 : i64
          %276 = bufferization.clone %alloc_7 : memref<2xf32> to memref<2xf32>
          %277 = arith.maxf %cst_1, %cst_3 : f16
          %278 = math.absf %5 : tensor<16x16x2xf32>
          %279 = arith.maxsi %c0_i32_53, %251 : i32
          %280 = math.roundeven %5 : tensor<16x16x2xf32>
          %281 = math.sqrt %9 : tensor<3x15xf16>
          %inserted_57 = tensor.insert %c-2423_i16 into %13[%c0, %c10] : tensor<3x15xi16>
          %rank_58 = tensor.rank %2 : tensor<2xi1>
          %282 = bufferization.clone %alloc_9 : memref<3x15xi1> to memref<3x15xi1>
          %283 = arith.remf %cst_3, %cst_1 : f16
          %284 = index.sub %c11, %247
          %from_elements_59 = tensor.from_elements %c3052_i16, %c-2423_i16, %c3052_i16, %c-2423_i16, %c3052_i16, %c3052_i16, %c-20430_i16, %c-20430_i16, %c-2423_i16, %c-2423_i16, %c-2423_i16, %c3052_i16, %c-2423_i16, %c-20430_i16, %c-2423_i16, %c-20430_i16, %c3052_i16, %c3052_i16, %c-20430_i16, %c-2423_i16, %c-20430_i16, %c-2423_i16, %c-2423_i16, %c-20430_i16, %c-20430_i16, %c3052_i16, %c3052_i16, %c-20430_i16, %c3052_i16, %c-2423_i16, %c-2423_i16, %c3052_i16, %c3052_i16, %c-20430_i16, %c-20430_i16, %c-20430_i16, %c3052_i16, %c-20430_i16, %c-20430_i16, %c3052_i16, %c-20430_i16, %c-2423_i16, %c3052_i16, %c-2423_i16, %c3052_i16 : tensor<3x15xi16>
          %285 = math.exp %9 : tensor<3x15xf16>
          %true_60 = arith.constant true
          linalg.yield %true_60 : i1
        }
      %256 = math.fpowi %cst_3, %c0_i32_53 : f16, i32
      scf.yield %244 : index
    }
    memref.copy %alloc_12, %alloc_6 : memref<3x15xi32> to memref<3x15xi32>
    %30 = arith.shrsi %c1563714217_i64, %c156345344_i64 : i64
    %31 = math.floor %cst_1 : f16
    vector.print %20 : vector<15xf16>
    %32 = arith.remf %cst, %cst : f32
    %33 = math.absi %7 : tensor<2x15xi32>
    %34 = arith.subi %c1563714217_i64, %c355370246_i64 : i64
    %35 = memref.atomic_rmw minf %cst, %alloc_7[%c1] : (f32, memref<2xf32>) -> f32
    %36 = arith.minf %cst_1, %cst_1 : f16
    %37 = index.mul %c5, %c1
    %splat = tensor.splat %c366308732_i64 : tensor<2xi64>
    %38 = arith.remui %c1563714217_i64, %c156345344_i64 : i64
    %39 = math.log %9 : tensor<3x15xf16>
    %40 = affine.apply affine_map<(d0, d1, d2) -> (d0 ceildiv 128 + d1)>(%c4, %c14, %c10)
    %alloc_24 = memref.alloc() : memref<16xf32>
    %41 = tensor.empty() : tensor<16x16xf32>
    %42 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1)>, affine_map<(d0, d1, d2) -> (d1, d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_24, %41 : memref<16xf32>, tensor<16x16xf32>) outs(%0 : tensor<16x16x2xf32>) {
    ^bb0(%in: f32, %in_52: f32, %out: f32):
      %243 = math.exp2 %9 : tensor<3x15xf16>
      %244 = arith.ori %c-20430_i16, %c-20430_i16 : i16
      %245 = arith.remf %in, %out : f32
      %246 = index.divu %40, %c6
      %247 = memref.atomic_rmw maxf %in, %alloc_7[%c1] : (f32, memref<2xf32>) -> f32
      %splat_53 = tensor.splat %cst_0 : tensor<2xf32>
      memref.alloca_scope  {
        %267 = bufferization.to_tensor %alloc_10 : memref<16x16x2xf32>
        %c0_i32_58 = arith.constant 0 : i32
        %268 = math.fpowi %in, %c0_i32_58 : f32, i32
        %269 = vector.broadcast %cst_0 : f32 to vector<f32>
        %270 = vector.transfer_write %269, %5[%c15, %c8, %c5] : vector<f32>, tensor<16x16x2xf32>
        %271 = math.roundeven %0 : tensor<16x16x2xf32>
        %272 = math.fma %11, %splat_53, %11 : tensor<2xf32>
        %273 = math.floor %9 : tensor<3x15xf16>
        %274 = math.roundeven %cst : f32
        %275 = arith.minf %cst_1, %cst_2 : f16
        memref.copy %alloc_11, %alloc_8 : memref<2xi64> to memref<2xi64>
        %276 = vector.broadcast %cst : f32 to vector<15x15xf32>
        %277 = vector.broadcast %out : f32 to vector<15xf32>
        %dest_59, %accumulated_value_60 = vector.scan <minf>, %276, %277 {inclusive = false, reduction_dim = 0 : i64} : vector<15x15xf32>, vector<15xf32>
        %278 = arith.remui %c-2423_i16, %c-20430_i16 : i16
        %279 = index.ceildivu %c14, %c15
        %alloc_61 = memref.alloc() : memref<16x16x2xf32>
        memref.copy %alloc_10, %alloc_61 : memref<16x16x2xf32> to memref<16x16x2xf32>
        %280 = math.rsqrt %cst_3 : f16
        %281 = math.fma %cst_0, %cst, %in_52 : f32
        %282 = arith.ori %c3052_i16, %c-2423_i16 : i16
        %283 = math.expm1 %5 : tensor<16x16x2xf32>
        %284 = math.log %0 : tensor<16x16x2xf32>
        %285 = affine.max affine_map<(d0, d1) -> (((d1 floordiv 4) floordiv 2) ceildiv 16, d1 floordiv 4, (d1 floordiv 4) mod 32, 0)>(%c14, %c4)
        %286 = arith.negf %in_52 : f32
        %287 = arith.muli %false_4, %false_4 : i1
        %288 = vector.broadcast %c0_i32_58 : i32 to vector<2xi32>
        %289 = vector.broadcast %false_4 : i1 to vector<2xi1>
        %290 = vector.maskedload %alloc_12[%c2, %c11], %289, %288 : memref<3x15xi32>, vector<2xi1>, vector<2xi32> into vector<2xi32>
        %291 = math.roundeven %cst : f32
        %292 = arith.remf %in_52, %cst : f32
        %293 = math.floor %5 : tensor<16x16x2xf32>
        %294 = arith.remf %cst_3, %cst_3 : f16
        %295 = arith.remsi %c366308732_i64, %c1563714217_i64 : i64
        %296 = arith.remf %cst_0, %in : f32
        %297 = arith.maxsi %c366308732_i64, %c355370246_i64 : i64
        %298 = vector.broadcast %true : i1 to vector<2xi1>
        %299 = vector.broadcast %c0_i32_58 : i32 to vector<i32>
        %300 = vector.transfer_write %299, %4[%c8, %c9, %c14] : vector<i32>, tensor<16x16x2xi32>
        %301 = bufferization.clone %alloc_18 : memref<16x16x2xi64> to memref<16x16x2xi64>
      }
      %248 = arith.mulf %cst_3, %cst_2 : f16
      %249 = bufferization.clone %alloc : memref<2x15xi64> to memref<2x15xi64>
      %inserted_54 = tensor.insert %out into %0[%c13, %c0, %c0] : tensor<16x16x2xf32>
      %250 = vector.broadcast %c-20430_i16 : i16 to vector<2xi16>
      %251 = vector.bitcast %20 : vector<15xf16> to vector<15xf16>
      %inserted_55 = tensor.insert %cst_1 into %9[%c2, %c10] : tensor<3x15xf16>
      scf.index_switch %c13 
      case 1 {
        %267 = arith.remf %cst_2, %cst_1 : f16
        %268 = math.absf %11 : tensor<2xf32>
        %269 = math.exp %cst : f32
        %270 = vector.shuffle %20, %20 [2, 3, 7, 9, 11, 14, 17, 19, 22, 23, 24, 27] : vector<15xf16>, vector<15xf16>
        %271 = vector.broadcast %c8 : index to vector<15xindex>
        %272 = vector.broadcast %false : i1 to vector<15xi1>
        vector.scatter %alloc_15[%c1] [%271], %272, %272 : memref<2xi1>, vector<15xindex>, vector<15xi1>, vector<15xi1>
        %273 = vector.insert %cst_1, %251 [11] : f16 into vector<15xf16>
        %274 = vector.broadcast %cst_3 : f16 to vector<15x15xf16>
        %275 = vector.outerproduct %251, %20, %274 {kind = #vector.kind<mul>} : vector<15xf16>, vector<15xf16>
        %276 = math.log1p %splat_53 : tensor<2xf32>
        %277 = index.casts %c355370246_i64 : i64 to index
        %278 = math.fma %0, %5, %0 : tensor<16x16x2xf32>
        %279 = math.tan %11 : tensor<2xf32>
        %280 = vector.reduction <add>, %251 : vector<15xf16> into f16
        %281 = arith.maxsi %false_4, %false : i1
        %282 = arith.remf %in, %out : f32
        %283 = math.exp2 %out : f32
        %284 = vector.reduction <minf>, %20 : vector<15xf16> into f16
        scf.yield
      }
      case 2 {
        %267 = arith.xori %c156345344_i64, %c156345344_i64 : i64
        %268 = math.copysign %11, %11 : tensor<2xf32>
        %269 = arith.floordivsi %c355370246_i64, %c355370246_i64 : i64
        %270 = arith.cmpi sgt, %c3052_i16, %c-2423_i16 : i16
        vector.print %250 : vector<2xi16>
        %271 = arith.shli %false_4, %false : i1
        %272 = arith.muli %c744113698_i64, %c156345344_i64 : i64
        %273 = vector.transpose %20, [0] : vector<15xf16> to vector<15xf16>
        %c57212100_i64 = arith.constant 57212100 : i64
        %274 = arith.remf %cst, %out : f32
        %275 = vector.bitcast %20 : vector<15xf16> to vector<15xf16>
        %276 = bufferization.clone %alloc_18 : memref<16x16x2xi64> to memref<16x16x2xi64>
        %277 = math.copysign %11, %11 : tensor<2xf32>
        %278 = arith.remf %cst, %cst : f32
        %279 = math.exp %9 : tensor<3x15xf16>
        %280 = arith.remui %c366308732_i64, %c355370246_i64 : i64
        scf.yield
      }
      default {
        %267 = math.atan %5 : tensor<16x16x2xf32>
        %268 = math.exp %9 : tensor<3x15xf16>
        %269 = vector.extract_strided_slice %20 {offsets = [2], sizes = [9], strides = [1]} : vector<15xf16> to vector<9xf16>
        %270 = math.exp %5 : tensor<16x16x2xf32>
        %271 = affine.max affine_map<(d0) -> ((d0 ceildiv 32 + 32) ceildiv 4, ((d0 ceildiv 32 + 32) ceildiv 4) mod 16, ((d0 ceildiv 32) mod 8) * 128)>(%27)
        %272 = math.exp %cst_1 : f16
        %273 = arith.cmpf oge, %cst_0, %in_52 : f32
        %274 = affine.load %alloc_9[%c8, %c11] : memref<3x15xi1>
        %275 = arith.ceildivsi %c366308732_i64, %c1563714217_i64 : i64
        %276 = math.sqrt %5 : tensor<16x16x2xf32>
        %277 = math.fma %splat_53, %splat_53, %splat_53 : tensor<2xf32>
        %278 = vector.broadcast %27 : index to vector<3xindex>
        %279 = vector.broadcast %274 : i1 to vector<3xi1>
        %280 = vector.broadcast %c156345344_i64 : i64 to vector<3xi64>
        vector.scatter %alloc_18[%c10, %c12, %c1] [%278], %279, %280 : memref<16x16x2xi64>, vector<3xindex>, vector<3xi1>, vector<3xi64>
        %281 = arith.muli %274, %true : i1
        memref.store %true, %alloc_17[%c1, %c8] : memref<3x15xi1>
        %282 = vector.transpose %250, [0] : vector<2xi16> to vector<2xi16>
        %c0_i32_58 = arith.constant 0 : i32
        memref.store %c0_i32_58, %alloc_12[%c1, %c9] : memref<3x15xi32>
      }
      %252 = arith.cmpi uge, %c156345344_i64, %c366308732_i64 : i64
      %253 = arith.minsi %false, %false : i1
      %254 = arith.shrui %c3052_i16, %c-20430_i16 : i16
      %255 = math.log1p %out : f32
      %256 = arith.shli %true, %true : i1
      %257 = vector.broadcast %c3052_i16 : i16 to vector<16x16x2xi16>
      memref.tensor_store %5, %alloc_10 : memref<16x16x2xf32>
      %258 = math.copysign %out, %in_52 : f32
      %259 = memref.load %alloc_15[%c1] : memref<2xi1>
      %260 = math.rsqrt %9 : tensor<3x15xf16>
      %inserted_56 = tensor.insert %c3052_i16 into %14[%c1, %c4] : tensor<2x15xi16>
      %261 = arith.maxf %out, %out : f32
      %262 = vector.broadcast %c1563714217_i64 : i64 to vector<15xi64>
      %263 = vector.transfer_write %262, %10[%c11, %c7] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<15xi64>, tensor<3x15xi64>
      memref.store %cst_0, %alloc_13[%c1, %c3] : memref<3x15xf32>
      %264 = scf.index_switch %c13 -> f16 
      case 1 {
        %true_58 = arith.constant true
        %267 = arith.remsi %c366308732_i64, %c1563714217_i64 : i64
        %268 = arith.maxsi %c1563714217_i64, %c744113698_i64 : i64
        bufferization.dealloc_tensor %14 : tensor<2x15xi16>
        %269 = arith.remui %false_4, %false_4 : i1
        %270 = vector.transpose %20, [0] : vector<15xf16> to vector<15xf16>
        %c1050306870_i64 = arith.constant 1050306870 : i64
        %271 = math.tanh %cst_0 : f32
        %272 = math.absi %false_4 : i1
        %alloca_59 = memref.alloca() : memref<2x15xi16>
        %273 = index.sub %27, %c7
        %alloc_60 = memref.alloc() : memref<2xi32>
        %274 = arith.shrsi %c156345344_i64, %c1563714217_i64 : i64
        %275 = arith.ori %false, %false_4 : i1
        %c1100031683_i64 = arith.constant 1100031683 : i64
        %276 = tensor.empty() : tensor<2xi32>
        %277 = math.fpowi %11, %276 : tensor<2xf32>, tensor<2xi32>
        scf.yield %cst_3 : f16
      }
      case 2 {
        %267 = math.copysign %0, %0 : tensor<16x16x2xf32>
        memref.store %c1563714217_i64, %249[%c1, %c10] : memref<2x15xi64>
        %268 = math.absi %12 : tensor<16x16x2xi16>
        %269 = arith.ceildivsi %c744113698_i64, %c156345344_i64 : i64
        %270 = math.absi %c1563714217_i64 : i64
        %271 = vector.broadcast %cst_3 : f16 to vector<3x15xf16>
        %272 = vector.broadcast %true : i1 to vector<3x15xi1>
        %c0_i32_58 = arith.constant 0 : i32
        %273 = vector.broadcast %c0_i32_58 : i32 to vector<3x15xi32>
        %274 = vector.gather %alloc_14[%40] [%273], %272, %271 : memref<2xf16>, vector<3x15xi32>, vector<3x15xi1>, vector<3x15xf16> into vector<3x15xf16>
        %275 = math.ceil %cst : f32
        %276 = vector.multi_reduction <xor>, %262, %262 [] : vector<15xi64> to vector<15xi64>
        %277 = arith.ori %c1563714217_i64, %c366308732_i64 : i64
        %278 = math.ctpop %2 : tensor<2xi1>
        bufferization.dealloc_tensor %2 : tensor<2xi1>
        %279 = vector.load %alloc_17[%c0, %c8] : memref<3x15xi1>, vector<3x15xi1>
        %280 = affine.min affine_map<(d0) -> ((d0 floordiv 128) ceildiv 8)>(%40)
        %alloc_59 = memref.alloc() : memref<2x15xi16>
        memref.tensor_store %14, %alloc_59 : memref<2x15xi16>
        %alloc_60 = memref.alloc() : memref<16x16x2xf32>
        memref.copy %alloc_10, %alloc_60 : memref<16x16x2xf32> to memref<16x16x2xf32>
        %281 = math.ipowi %17, %17 : tensor<2x15xi16>
        scf.yield %cst_1 : f16
      }
      case 3 {
        %267 = vector.matrix_multiply %251, %20 {lhs_columns = 15 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<15xf16>, vector<15xf16>) -> vector<1xf16>
        %268 = tensor.empty() : tensor<2xi32>
        %269 = index.casts %c366308732_i64 : i64 to index
        %270 = arith.xori %c1563714217_i64, %c1563714217_i64 : i64
        %271 = affine.min affine_map<(d0) -> (d0 * 2, (-((d0 * 2) mod 64)) mod 8, (d0 * 2) mod 64, d0 floordiv 8)>(%c9)
        %272 = affine.max affine_map<(d0, d1, d2) -> ((d0 - d2) mod 64, d2 + 8, ((d0 - d2) mod 64) * 2)>(%269, %37, %c5)
        %273 = arith.ceildivsi %c156345344_i64, %c366308732_i64 : i64
        %274 = vector.bitcast %262 : vector<15xi64> to vector<15xi64>
        %alloca_58 = memref.alloca() : memref<2x15xi64>
        %splat_59 = tensor.splat %false_4 : tensor<2xi1>
        %275 = index.mul %246, %271
        vector.print %250 : vector<2xi16>
        %276 = math.cttz %6 : tensor<2x15xi32>
        %277 = arith.andi %false, %true : i1
        %278 = tensor.empty() : tensor<2xi32>
        %279 = arith.ceildivsi %c366308732_i64, %c1563714217_i64 : i64
        scf.yield %cst_3 : f16
      }
      default {
        %267 = math.log %5 : tensor<16x16x2xf32>
        %268 = vector.broadcast %cst_0 : f32 to vector<2x3xf32>
        %269 = vector.transfer_write %268, %5[%c14, %27, %c14] {permutation_map = affine_map<(d0, d1, d2) -> (d0, d1)>} : vector<2x3xf32>, tensor<16x16x2xf32>
        %270 = arith.remsi %c366308732_i64, %c156345344_i64 : i64
        %271 = arith.subi %true, %false_4 : i1
        %272 = arith.ori %false, %true : i1
        %273 = vector.extract %20[11] : vector<15xf16>
        %274 = vector.broadcast %false : i1 to vector<3xi1>
        %275 = vector.maskedload %alloc_9[%c2, %c7], %274, %274 : memref<3x15xi1>, vector<3xi1>, vector<3xi1> into vector<3xi1>
        %276 = math.rsqrt %5 : tensor<16x16x2xf32>
        %277 = vector.multi_reduction <minui>, %274, %275 [] : vector<3xi1> to vector<3xi1>
        %278 = math.round %11 : tensor<2xf32>
        %279 = math.ctpop %22 : tensor<i1>
        %280 = math.floor %9 : tensor<3x15xf16>
        %281 = vector.shuffle %275, %274 [2, 5] : vector<3xi1>, vector<3xi1>
        %282 = vector.broadcast %c-20430_i16 : i16 to vector<16x2xi16>
        %dest_58, %accumulated_value_59 = vector.scan <xor>, %257, %282 {inclusive = false, reduction_dim = 1 : i64} : vector<16x16x2xi16>, vector<16x2xi16>
        vector.print %262 : vector<15xi64>
        %inserted_60 = tensor.insert %in_52 into %5[%c7, %c4, %c1] : tensor<16x16x2xf32>
        scf.yield %cst_2 : f16
      }
      %265 = arith.minsi %c3052_i16, %c-20430_i16 : i16
      %false_57 = index.bool.constant false
      %266 = bufferization.clone %alloc_19 : memref<2x15xi1> to memref<2x15xi1>
      linalg.yield %out : f32
    } -> tensor<16x16x2xf32>
    %43 = math.log10 %cst_3 : f16
    %44 = math.atan2 %0, %5 : tensor<16x16x2xf32>
    %45 = math.log2 %9 : tensor<3x15xf16>
    %46 = math.floor %11 : tensor<2xf32>
    %47 = index.floordivs %c1, %c8
    %48 = vector.broadcast %cst_0 : f32 to vector<15xf32>
    %49 = vector.transfer_write %48, %0[%40, %47, %c8] {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : vector<15xf32>, tensor<16x16x2xf32>
    memref.copy %alloc_8, %alloc_11 : memref<2xi64> to memref<2xi64>
    %50 = vector.multi_reduction <mul>, %20, %cst_1 [0] : vector<15xf16> to f16
    %51 = memref.load %alloc_8[%c1] : memref<2xi64>
    %52 = vector.broadcast %cst : f32 to vector<2x15xf32>
    %53 = vector.fma %52, %52, %52 : vector<2x15xf32>
    %54 = math.log %9 : tensor<3x15xf16>
    %generated = tensor.generate %37 {
    ^bb0(%arg1: index, %arg2: index):
      %243 = math.fma %11, %11, %11 : tensor<2xf32>
      %244 = arith.ori %c355370246_i64, %c366308732_i64 : i64
      %245 = math.log %5 : tensor<16x16x2xf32>
      %false_52 = index.bool.constant false
      tensor.yield %cst : f32
    } : tensor<?x15xf32>
    affine.store %false, %alloc_19[%c14, %c0] : memref<2x15xi1>
    %55 = index.ceildivs %c15, %c3
    %56 = scf.index_switch %40 -> index 
    case 1 {
      %243 = affine.for %arg1 = 0 to 22 iter_args(%arg2 = %17) -> (tensor<2x15xi16>) {
        affine.yield %14 : tensor<2x15xi16>
      }
      %cst_52 = arith.constant 1.99293338E+9 : f32
      %244 = math.round %cst_3 : f16
      %245 = arith.xori %false, %false_4 : i1
      %from_elements_53 = tensor.from_elements %false_4, %true : tensor<2xi1>
      %246 = vector.extract %53[1] : vector<2x15xf32>
      %247 = index.sub %c5, %c8
      scf.index_switch %27 
      case 1 {
        %254 = arith.shli %c1563714217_i64, %c366308732_i64 : i64
        %255 = vector.broadcast %cst : f32 to vector<3x15xf32>
        %256 = vector.fma %255, %255, %255 : vector<3x15xf32>
        %257 = index.ceildivu %c8, %c11
        %258 = math.expm1 %50 : f16
        %259 = index.maxs %c13, %c9
        %alloc_55 = memref.alloc() : memref<3x15xf16>
        memref.tensor_store %9, %alloc_55 : memref<3x15xf16>
        %260 = arith.maxf %cst, %cst : f32
        %261 = affine.max affine_map<(d0, d1) -> (d0, d0 + 2, d0 * 128, d0 * 128)>(%c7, %55)
        memref.store %c744113698_i64, %alloc_8[%c1] : memref<2xi64>
        %262 = index.sizeof
        %263 = arith.remf %cst_0, %cst_0 : f32
        %264 = vector.splat %50 : vector<2x15xf16>
        %265 = bufferization.to_tensor %alloc_15 : memref<2xi1>
        %splat_56 = tensor.splat %c-2423_i16 : tensor<2xi16>
        %266 = arith.remsi %true, %false : i1
        %267 = math.tanh %5 : tensor<16x16x2xf32>
        scf.yield
      }
      case 2 {
        %254 = vector.broadcast %cst : f32 to vector<3xf32>
        %255 = vector.broadcast %false_4 : i1 to vector<3xi1>
        %256 = vector.maskedload %alloc_7[%c0], %255, %254 : memref<2xf32>, vector<3xi1>, vector<3xf32> into vector<3xf32>
        %257 = arith.negf %cst_3 : f16
        %258 = arith.addf %cst_2, %cst_2 : f16
        %259 = arith.ori %c3052_i16, %c3052_i16 : i16
        %260 = arith.divsi %c1563714217_i64, %c744113698_i64 : i64
        %261 = arith.cmpf ult, %cst_1, %cst_1 : f16
        %262 = arith.maxf %cst_1, %cst_1 : f16
        %263 = vector.broadcast %c355370246_i64 : i64 to vector<15xi64>
        %264 = vector.broadcast %true : i1 to vector<15xi1>
        %265 = vector.maskedload %alloc_18[%c4, %c2, %c1], %264, %263 : memref<16x16x2xi64>, vector<15xi1>, vector<15xi64> into vector<15xi64>
        %collapsed_55 = tensor.collapse_shape %12 [[0, 1], [2]] : tensor<16x16x2xi16> into tensor<256x2xi16>
        %266 = math.sqrt %11 : tensor<2xf32>
        %267 = arith.shrsi %c156345344_i64, %c1563714217_i64 : i64
        %268 = math.absf %9 : tensor<3x15xf16>
        %269 = math.log %9 : tensor<3x15xf16>
        %270 = vector.splat %c11 : vector<3x15xindex>
        %from_elements_56 = tensor.from_elements %c3052_i16, %c-2423_i16, %c-20430_i16, %c-20430_i16, %c-20430_i16, %c-20430_i16, %c-20430_i16, %c-20430_i16, %c-2423_i16, %c3052_i16, %c-2423_i16, %c-2423_i16, %c-2423_i16, %c-2423_i16, %c-20430_i16, %c-2423_i16, %c-20430_i16, %c-2423_i16, %c-20430_i16, %c3052_i16, %c3052_i16, %c-2423_i16, %c-2423_i16, %c3052_i16, %c-2423_i16, %c3052_i16, %c3052_i16, %c-2423_i16, %c-20430_i16, %c-2423_i16 : tensor<2x15xi16>
        %271 = index.casts %40 : index to i32
        scf.yield
      }
      case 3 {
        %254 = arith.cmpf uge, %cst_3, %cst_3 : f16
        %255 = vector.broadcast %cst_0 : f32 to vector<15x15xf32>
        %256 = vector.outerproduct %246, %246, %255 {kind = #vector.kind<maxf>} : vector<15xf32>, vector<15xf32>
        %257 = arith.remsi %c-20430_i16, %c-20430_i16 : i16
        %258 = bufferization.clone %alloc_16 : memref<3x15xi64> to memref<3x15xi64>
        %splat_55 = tensor.splat %cst_0 : tensor<16x16x2xf32>
        %259 = memref.realloc %alloc_20 : memref<2xi1> to memref<3xi1>
        %260 = math.cttz %18 : tensor<i64>
        %261 = arith.maxf %cst_3, %50 : f16
        %262 = bufferization.clone %alloc_13 : memref<3x15xf32> to memref<3x15xf32>
        %263 = index.mul %37, %47
        %264 = arith.addi %c355370246_i64, %c744113698_i64 : i64
        %265 = math.exp %11 : tensor<2xf32>
        %cst_56 = arith.constant 0x4E103E8D : f32
        %266 = math.ctpop %13 : tensor<3x15xi16>
        %inserted_57 = tensor.insert %false_4 into %3[%c0, %c5] : tensor<2x15xi1>
        %267 = vector.multi_reduction <mul>, %20, %20 [] : vector<15xf16> to vector<15xf16>
        scf.yield
      }
      default {
        %254 = math.exp %11 : tensor<2xf32>
        %255 = index.castu %false : i1 to index
        %256 = index.ceildivs %c3, %c15
        %257 = arith.shrsi %false, %true : i1
        %258 = math.sqrt %11 : tensor<2xf32>
        %259 = arith.minf %cst_1, %cst_3 : f16
        memref.copy %alloc_17, %alloc_9 : memref<3x15xi1> to memref<3x15xi1>
        %260 = math.tan %cst_2 : f16
