module {
  func.func nested @func1(%arg0: i16) -> vector<8xi1> {
    %true = arith.constant true
    %cst = arith.constant 0x4D9EA88B : f32
    %cst_0 = arith.constant 8.092000e+03 : f16
    %c243339535_i32 = arith.constant 243339535 : i32
    %c844_i16 = arith.constant 844 : i16
    %c1173614337_i32 = arith.constant 1173614337 : i32
    %c147688179_i64 = arith.constant 147688179 : i64
    %cst_1 = arith.constant 0x4DF31BB1 : f32
    %false = arith.constant false
    %c1768117351_i32 = arith.constant 1768117351 : i32
    %cst_2 = arith.constant 1.256800e+04 : f16
    %cst_3 = arith.constant 8.494590e+08 : f32
    %c425051238_i64 = arith.constant 425051238 : i64
    %c7995_i16 = arith.constant 7995 : i16
    %cst_4 = arith.constant 3.272000e+04 : f16
    %cst_5 = arith.constant 2.05943462E+9 : f32
    %0 = tensor.empty() : tensor<4x4x4xf16>
    %1 = tensor.empty() : tensor<8xi64>
    %2 = tensor.empty() : tensor<4x4xi64>
    %3 = tensor.empty() : tensor<4x4xi1>
    %4 = tensor.empty() : tensor<8xi1>
    %5 = tensor.empty() : tensor<8xi64>
    %6 = tensor.empty() : tensor<4x4xf16>
    %7 = tensor.empty() : tensor<8xi32>
    %8 = tensor.empty() : tensor<4x4x4xi64>
    %9 = tensor.empty() : tensor<8xi16>
    %10 = tensor.empty() : tensor<4x4xi16>
    %11 = tensor.empty() : tensor<8xi16>
    %12 = tensor.empty() : tensor<8xi32>
    %13 = tensor.empty() : tensor<8xf16>
    %14 = tensor.empty() : tensor<4x4x4xf16>
    %15 = tensor.empty() : tensor<8xf32>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<4x4x4xi64>
    %alloc_6 = memref.alloc() : memref<4x4xi16>
    %alloc_7 = memref.alloc() : memref<4x4x4xi32>
    %alloc_8 = memref.alloc() : memref<4x4xi64>
    %alloc_9 = memref.alloc() : memref<4x4xi64>
    %alloc_10 = memref.alloc() : memref<8xf16>
    %alloc_11 = memref.alloc() : memref<4x4x4xi16>
    %alloc_12 = memref.alloc() : memref<8xi32>
    %alloc_13 = memref.alloc() : memref<8xi1>
    %alloc_14 = memref.alloc() : memref<8xi16>
    %alloc_15 = memref.alloc() : memref<8xf16>
    %alloc_16 = memref.alloc() : memref<4x4xf16>
    %alloc_17 = memref.alloc() : memref<8xi64>
    %alloc_18 = memref.alloc() : memref<4x4xf32>
    %alloc_19 = memref.alloc() : memref<4x4xi16>
    %alloc_20 = memref.alloc() : memref<8xf32>
    %16 = tensor.empty() : tensor<4x4x4xf16>
    %17 = linalg.copy ins(%14 : tensor<4x4x4xf16>) outs(%16 : tensor<4x4x4xf16>) -> tensor<4x4x4xf16>
    %18 = tensor.empty() : tensor<8xi16>
    %transposed = linalg.transpose ins(%9 : tensor<8xi16>) outs(%18 : tensor<8xi16>) permutation = [0] 
    %alloc_21 = memref.alloc() : memref<i64>
    linalg.reduce ins(%5 : tensor<8xi64>) outs(%alloc_21 : memref<i64>) dimensions = [0] 
      (%in: i64, %init: i64) {
        %263 = vector.broadcast %c7995_i16 : i16 to vector<11xi16>
        %264 = vector.transfer_write %263, %10[%c9, %c1] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<11xi16>, tensor<4x4xi16>
        %alloc_53 = memref.alloc() : memref<4xf16>
        %265 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%alloc_53 : memref<4xf16>) outs(%0 : tensor<4x4x4xf16>) {
        ^bb0(%in_56: f16, %out: f16):
          %false_57 = index.bool.constant false
          %269 = vector.broadcast %cst_4 : f16 to vector<f16>
          %270 = vector.transfer_write %269, %14[%c3, %c0, %c1] : vector<f16>, tensor<4x4x4xf16>
          %false_58 = arith.constant false
          %false_59 = arith.constant false
          %271 = vector.transfer_read %alloc_13[%c12], %false_59 : memref<8xi1>, vector<i1>
          %272 = vector.extract_strided_slice %263 {offsets = [0], sizes = [9], strides = [1]} : vector<11xi16> to vector<9xi16>
          %alloca_60 = memref.alloca() : memref<4x4x4xf32>
          %273 = math.powf %cst_2, %cst_2 : f16
          %274 = index.sizeof
          %275 = index.castu %c1 : index to i32
          %276 = vector.broadcast %c844_i16 : i16 to vector<11x11xi16>
          %277 = vector.outerproduct %263, %263, %276 {kind = #vector.kind<xor>} : vector<11xi16>, vector<11xi16>
          %278 = index.ceildivu %274, %c14
          %279 = vector.create_mask %c1 : vector<8xi1>
          %inserted_61 = tensor.insert %c844_i16 into %9[%c0] : tensor<8xi16>
          memref.copy %alloc_10, %alloc_15 : memref<8xf16> to memref<8xf16>
          %280 = index.divs %c11, %278
          %281 = affine.load %alloc_14[%c12] : memref<8xi16>
          %282 = index.maxu %c4, %c12
          %283 = index.add %c4, %c8
          %284 = math.cttz %2 : tensor<4x4xi64>
          %285 = math.ctpop %11 : tensor<8xi16>
          %286 = index.add %c14, %280
          %287 = tensor.empty() : tensor<4x4xi1>
          %288 = linalg.matmul ins(%3, %3 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%287 : tensor<4x4xi1>) -> tensor<4x4xi1>
          %289 = tensor.empty() : tensor<4x4x4xi32>
          %290 = vector.broadcast %c1173614337_i32 : i32 to vector<4x4x4xi32>
          %291 = vector.broadcast %false_58 : i1 to vector<4x4x4xi1>
          %292 = vector.gather %289[%274, %278, %c12] [%290], %291, %290 : tensor<4x4x4xi32>, vector<4x4x4xi32>, vector<4x4x4xi1>, vector<4x4x4xi32> into vector<4x4x4xi32>
          %293 = math.log10 %cst_3 : f32
          %294 = math.tan %15 : tensor<8xf32>
          %295 = index.castu %c8 : index to i32
          %296 = math.fpowi %cst_2, %c1173614337_i32 : f16, i32
          %297 = math.log %15 : tensor<8xf32>
          %298 = vector.broadcast %cst_3 : f32 to vector<4x4x4xf32>
          %299 = vector.gather %15[%c9] [%290], %291, %298 : tensor<8xf32>, vector<4x4x4xi32>, vector<4x4x4xi1>, vector<4x4x4xf32> into vector<4x4x4xf32>
          %300 = math.exp2 %cst : f32
          %301 = math.atan2 %6, %6 : tensor<4x4xf16>
          %302 = bufferization.clone %alloc_15 : memref<8xf16> to memref<8xf16>
          %303 = bufferization.clone %alloc_19 : memref<4x4xi16> to memref<4x4xi16>
          linalg.yield %cst_2 : f16
        } -> tensor<4x4x4xf16>
        %266 = vector.extract %263[0] : vector<11xi16>
        %267 = math.powf %15, %15 : tensor<8xf32>
        %expanded_54 = tensor.expand_shape %8 [[0], [1], [2, 3]] : tensor<4x4x4xi64> into tensor<4x4x4x1xi64>
        %rank_55 = tensor.rank %1 : tensor<8xi64>
        memref.store %cst, %alloc_18[%c3, %c1] : memref<4x4xf32>
        %268 = arith.addi %c425051238_i64, %init : i64
        %c0_i64 = arith.constant 0 : i64
        linalg.yield %c0_i64 : i64
      }
    scf.parallel (%arg1) = (%c3) to (%c14) step (%c12) {
      %263 = math.round %14 : tensor<4x4x4xf16>
      %264 = math.absi %5 : tensor<8xi64>
      %265 = arith.maxf %cst_0, %cst_0 : f16
      %266 = index.sizeof
      %267 = math.cttz %c844_i16 : i16
      %268 = index.maxu %c5, %c8
      %269 = arith.maxf %cst_1, %cst_5 : f32
      %270 = bufferization.to_tensor %alloc_13 : memref<8xi1>
      %271 = arith.mulf %cst_0, %cst_4 : f16
      %272 = math.log %14 : tensor<4x4x4xf16>
      %extracted_53 = tensor.extract %1[%c7] : tensor<8xi64>
      bufferization.dealloc_tensor %3 : tensor<4x4xi1>
      %273 = vector.broadcast %c844_i16 : i16 to vector<1xi16>
      %274 = vector.extract %273[0] : vector<1xi16>
      memref.tensor_store %transposed, %alloc_14 : memref<8xi16>
      %275 = vector.splat %c11 : vector<8xindex>
      %276 = arith.divsi %c844_i16, %c844_i16 : i16
      scf.yield
    }
    %19 = affine.vector_load %alloc_8[%c1, %c6] : memref<4x4xi64>, vector<4xi64>
    affine.vector_store %19, %alloc_8[%c0, %c4] : memref<4x4xi64>, vector<4xi64>
    %alloc_22 = memref.alloc() : memref<8xi32>
    %20 = tensor.empty() : tensor<i32>
    %21 = linalg.dot ins(%alloc_12, %alloc_22 : memref<8xi32>, memref<8xi32>) outs(%20 : tensor<i32>) -> tensor<i32>
    %22 = arith.negf %cst_0 : f16
    %23 = index.ceildivs %c10, %c0
    %24 = scf.index_switch %c5 -> vector<8xi1> 
    case 1 {
      %263 = arith.remsi %c844_i16, %c7995_i16 : i16
      %inserted_53 = tensor.insert %c1173614337_i32 into %7[%c3] : tensor<8xi32>
      %264 = math.tanh %13 : tensor<8xf16>
      %265 = arith.divui %true, %false : i1
      %inserted_54 = tensor.insert %c1173614337_i32 into %12[%c6] : tensor<8xi32>
      %266 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<mul>} %19, %19, %c425051238_i64 : vector<4xi64>, vector<4xi64> into i64
      %267 = arith.ori %false, %false : i1
      %268 = vector.flat_transpose %19 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
      %269 = math.ceil %13 : tensor<8xf16>
      %270 = arith.divf %cst_1, %cst_3 : f32
      %271 = index.casts %c13 : index to i32
      %272 = index.castu %c1173614337_i32 : i32 to index
      %rank_55 = tensor.rank %14 : tensor<4x4x4xf16>
      %273 = arith.mulf %cst_4, %cst_4 : f16
      %extracted_56 = tensor.extract %4[%c1] : tensor<8xi1>
      %274 = arith.maxui %extracted_56, %extracted_56 : i1
      %275 = vector.broadcast %true : i1 to vector<8xi1>
      scf.yield %275 : vector<8xi1>
    }
    case 2 {
      %263 = math.absi %3 : tensor<4x4xi1>
      %264 = math.round %15 : tensor<8xf32>
      %265 = vector.broadcast %cst_5 : f32 to vector<4x4x4xf32>
      %266 = vector.fma %265, %265, %265 : vector<4x4x4xf32>
      %267 = arith.shrsi %true, %true : i1
      %268 = math.tan %13 : tensor<8xf16>
      %269 = index.divu %c2, %c1
      %270 = tensor.empty() : tensor<4x4xi64>
      %271 = linalg.matmul ins(%2, %2 : tensor<4x4xi64>, tensor<4x4xi64>) outs(%270 : tensor<4x4xi64>) -> tensor<4x4xi64>
      %272 = math.fma %14, %0, %0 : tensor<4x4x4xf16>
      %273 = arith.maxui %true, %true : i1
      %274 = index.floordivs %c11, %269
      %generated_53 = tensor.generate %c2, %c14 {
      ^bb0(%arg1: index, %arg2: index, %arg3: index):
        %280 = math.ipowi %11, %9 : tensor<8xi16>
        %281 = index.divu %c10, %23
        %282 = arith.minsi %true, %false : i1
        %283 = math.round %cst_0 : f16
        tensor.yield %c1173614337_i32 : i32
      } : tensor<?x?x4xi32>
      %275 = math.absi %9 : tensor<8xi16>
      %276 = math.powf %cst_5, %cst_5 : f32
      memref.copy %alloc_12, %alloc_22 : memref<8xi32> to memref<8xi32>
      %277 = index.sizeof
      %278 = arith.mulf %cst, %cst_1 : f32
      %279 = vector.broadcast %true : i1 to vector<8xi1>
      scf.yield %279 : vector<8xi1>
    }
    case 3 {
      %263 = arith.divui %c844_i16, %c844_i16 : i16
      %264 = math.ipowi %12, %12 : tensor<8xi32>
      %265 = index.divu %c7, %c0
      %generated_53 = tensor.generate %c1 {
      ^bb0(%arg1: index):
        %280 = affine.load %alloc_15[%c11] : memref<8xf16>
        %281 = arith.negf %cst_0 : f16
        %282 = arith.shrsi %true, %true : i1
        %283 = affine.apply affine_map<(d0, d1) -> (d0 + 128)>(%c14, %c11)
        tensor.yield %false : i1
      } : tensor<?xi1>
      %266 = arith.negf %cst_4 : f16
      %267 = arith.remf %cst_4, %cst_4 : f16
      %268 = vector.splat %cst_1 : vector<4x4xf32>
      %269 = math.exp %14 : tensor<4x4x4xf16>
      %270 = math.tanh %15 : tensor<8xf32>
      %271 = vector.broadcast %cst_0 : f16 to vector<8xf16>
      %272 = vector.broadcast %true : i1 to vector<8xi1>
      %273 = vector.broadcast %c1173614337_i32 : i32 to vector<8xi32>
      %274 = vector.gather %6[%c9, %265] [%273], %272, %271 : tensor<4x4xf16>, vector<8xi32>, vector<8xi1>, vector<8xf16> into vector<8xf16>
      %true_54 = index.bool.constant true
      %275 = math.rsqrt %cst_2 : f16
      %276 = vector.multi_reduction <minf>, %271, %cst_4 [0] : vector<8xf16> to f16
      %277 = math.copysign %15, %15 : tensor<8xf32>
      %278 = vector.shuffle %19, %19 [1, 3, 6, 7] : vector<4xi64>, vector<4xi64>
      %279 = tensor.empty() : tensor<4x4x4xf16>
      %mapped_55 = linalg.map ins(%16, %0, %16 : tensor<4x4x4xf16>, tensor<4x4x4xf16>, tensor<4x4x4xf16>) outs(%279 : tensor<4x4x4xf16>)
        (%in: f16, %in_56: f16, %in_57: f16) {
          %280 = arith.negf %cst_0 : f16
          %281 = vector.flat_transpose %274 {columns = 4 : i32, rows = 2 : i32} : vector<8xf16> -> vector<8xf16>
          %282 = vector.broadcast %cst_2 : f16 to vector<8xf16>
          bufferization.dealloc_tensor %12 : tensor<8xi32>
          %283 = math.cttz %4 : tensor<8xi1>
          %284 = math.floor %cst_5 : f32
          %285 = index.floordivs %c15, %c3
          %286 = arith.ceildivsi %c243339535_i32, %c1173614337_i32 : i32
          %287 = affine.apply affine_map<(d0, d1, d2) -> ((d0 - d1) mod 64)>(%c4, %c11, %c10)
          %288 = index.ceildivu %265, %c1
          %289 = arith.shrsi %c7995_i16, %c7995_i16 : i16
          %290 = vector.broadcast %cst_5 : f32 to vector<4x11xf32>
          %291 = vector.broadcast %cst_1 : f32 to vector<11xf32>
          %dest, %accumulated_value = vector.scan <mul>, %290, %291 {inclusive = false, reduction_dim = 0 : i64} : vector<4x11xf32>, vector<11xf32>
          %292 = index.divu %c6, %c12
          %293 = vector.broadcast %c147688179_i64 : i64 to vector<4x4xi64>
          %294 = vector.outerproduct %19, %19, %293 {kind = #vector.kind<mul>} : vector<4xi64>, vector<4xi64>
          %295 = vector.flat_transpose %271 {columns = 4 : i32, rows = 2 : i32} : vector<8xf16> -> vector<8xf16>
          %296 = memref.atomic_rmw addf %cst_1, %alloc_18[%c2, %c3] : (f32, memref<4x4xf32>) -> f32
          %297 = bufferization.to_tensor %alloc_17 : memref<8xi64>
          %298 = vector.extract %271[0] : vector<8xf16>
          %299 = bufferization.clone %alloc_18 : memref<4x4xf32> to memref<4x4xf32>
          %extracted_58 = tensor.extract %20[] : tensor<i32>
          %expanded_59 = tensor.expand_shape %8 [[0], [1], [2, 3]] : tensor<4x4x4xi64> into tensor<4x4x4x1xi64>
          %300 = math.absf %in_57 : f16
          %301 = math.tan %0 : tensor<4x4x4xf16>
          %302 = vector.broadcast %276 : f16 to vector<f16>
          %303 = vector.transfer_write %302, %6[%c15, %c14] : vector<f16>, tensor<4x4xf16>
          %304 = vector.splat %c6 : vector<8xindex>
          %305 = index.ceildivu %c14, %c14
          %306 = vector.matrix_multiply %272, %272 {lhs_columns = 8 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<8xi1>, vector<8xi1>) -> vector<1xi1>
          %307 = bufferization.clone %alloc_12 : memref<8xi32> to memref<8xi32>
          %308 = vector.reduction <add>, %281 : vector<8xf16> into f16
          %309 = arith.floordivsi %extracted_58, %c1173614337_i32 : i32
          %310 = arith.shrsi %c1768117351_i32, %c1173614337_i32 : i32
          %311 = vector.broadcast %276 : f16 to vector<f16>
          %312 = vector.transfer_write %311, %13[%c15] : vector<f16>, tensor<8xf16>
          %cst_60 = arith.constant 1.000000e+00 : f16
          linalg.yield %cst_60 : f16
        }
      scf.yield %272 : vector<8xi1>
    }
    default {
      %263 = vector.extract %19[2] : vector<4xi64>
      %264 = tensor.empty() : tensor<4x4xi16>
      %265 = linalg.matmul ins(%10, %10 : tensor<4x4xi16>, tensor<4x4xi16>) outs(%264 : tensor<4x4xi16>) -> tensor<4x4xi16>
      %266 = arith.xori %c147688179_i64, %c147688179_i64 : i64
      %267 = affine.apply affine_map<(d0, d1) -> (d0 + 128)>(%c11, %c3)
      %268 = math.floor %cst_1 : f32
      %269 = vector.broadcast %c1173614337_i32 : i32 to vector<4x4xi32>
      %270 = arith.minf %cst_4, %cst_0 : f16
      %271 = scf.if %true -> (i1) {
        %279 = vector.broadcast %c12 : index to vector<4xindex>
        %280 = vector.broadcast %false : i1 to vector<4xi1>
        %281 = vector.broadcast %c844_i16 : i16 to vector<4xi16>
        vector.scatter %alloc_19[%c0, %c2] [%279], %280, %281 : memref<4x4xi16>, vector<4xindex>, vector<4xi1>, vector<4xi16>
        %282 = math.exp2 %17 : tensor<4x4x4xf16>
        %283 = math.rsqrt %6 : tensor<4x4xf16>
        %284 = vector.flat_transpose %19 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
        %285 = index.maxu %c11, %c3
        %286 = vector.broadcast %c844_i16 : i16 to vector<i16>
        %287 = vector.transfer_write %286, %10[%23, %c10] : vector<i16>, tensor<4x4xi16>
        %288 = tensor.empty(%285, %c8) : tensor<?x?x4xi16>
        %289 = math.log10 %14 : tensor<4x4x4xf16>
        scf.yield %false : i1
      } else {
        %279 = affine.min affine_map<(d0, d1, d2) -> (d1, (d1 - d0 + 2) floordiv 8, d0 - 2, d0 * -32)>(%c4, %23, %c8)
        %280 = arith.xori %c1768117351_i32, %c1768117351_i32 : i32
        %rank_54 = tensor.rank %12 : tensor<8xi32>
        %281 = vector.multi_reduction <xor>, %269, %269 [] : vector<4x4xi32> to vector<4x4xi32>
        %expanded_55 = tensor.expand_shape %7 [[0, 1]] : tensor<8xi32> into tensor<8x1xi32>
        %282 = math.absf %13 : tensor<8xf16>
        %283 = index.ceildivu %c0, %23
        %true_56 = index.bool.constant true
        scf.yield %true : i1
      }
      %272 = math.ceil %cst_0 : f16
      %cast_53 = tensor.cast %7 : tensor<8xi32> to tensor<?xi32>
      %273 = arith.ceildivsi %c844_i16, %c844_i16 : i16
      vector.print %269 : vector<4x4xi32>
      %274 = math.tan %cst_5 : f32
      %275 = math.exp2 %cst_4 : f16
      %276 = math.ctpop %c1768117351_i32 : i32
      %277 = vector.extract_strided_slice %269 {offsets = [1], sizes = [1], strides = [1]} : vector<4x4xi32> to vector<1x4xi32>
      %278 = vector.broadcast %true : i1 to vector<8xi1>
      scf.yield %278 : vector<8xi1>
    }
    %25 = arith.cmpf une, %cst, %cst : f32
    %26 = vector.flat_transpose %19 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
    %false_23 = index.bool.constant false
    %extracted = tensor.extract %20[] : tensor<i32>
    %expanded = tensor.expand_shape %14 [[0], [1], [2, 3]] : tensor<4x4x4xf16> into tensor<4x4x4x1xf16>
    %27 = index.sizeof
    %28 = index.floordivs %c8, %c3
    %29 = index.add %c10, %c10
    %30 = math.round %14 : tensor<4x4x4xf16>
    %31 = index.floordivs %c2, %c9
    %32 = arith.divsi %c844_i16, %c844_i16 : i16
    %33 = bufferization.clone %alloc_6 : memref<4x4xi16> to memref<4x4xi16>
    %34 = tensor.empty(%c14) : tensor<?xi32>
    %35 = arith.remsi %c1768117351_i32, %extracted : i32
    %36 = arith.negf %cst_1 : f32
    %37 = math.atan2 %cst_3, %cst : f32
    %38 = arith.addf %cst_0, %cst_0 : f16
    %39 = arith.floordivsi %c243339535_i32, %c243339535_i32 : i32
    bufferization.dealloc_tensor %6 : tensor<4x4xf16>
    %40 = vector.splat %27 : vector<4x4x4xindex>
    %41 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<and>} %26, %19, %c425051238_i64 : vector<4xi64>, vector<4xi64> into i64
    %42 = vector.broadcast %c4 : index to vector<8xindex>
    %43 = vector.broadcast %true : i1 to vector<8xi1>
    %44 = vector.broadcast %c7995_i16 : i16 to vector<8xi16>
    vector.scatter %alloc_11[%c2, %c3, %c1] [%42], %43, %44 : memref<4x4x4xi16>, vector<8xindex>, vector<8xi1>, vector<8xi16>
    scf.execute_region {
      %263 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxui>} %19, %26, %c147688179_i64 : vector<4xi64>, vector<4xi64> into i64
      %264 = arith.maxui %c844_i16, %c7995_i16 : i16
      %cast_53 = tensor.cast %0 : tensor<4x4x4xf16> to tensor<?x?x?xf16>
      memref.assume_alignment %alloc_22, 16 : memref<8xi32>
      %265 = vector.flat_transpose %19 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
      %266 = math.ctpop %5 : tensor<8xi64>
      %267 = arith.mulf %cst_4, %cst_4 : f16
      %268 = vector.extract_strided_slice %19 {offsets = [1], sizes = [1], strides = [1]} : vector<4xi64> to vector<1xi64>
      %269 = vector.splat %cst_3 : vector<8xf32>
      %270 = math.rsqrt %cst_1 : f32
      %271 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d1, d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%16 : tensor<4x4x4xf16>) outs(%14 : tensor<4x4x4xf16>) {
      ^bb0(%in: f16, %out: f16):
        %276 = math.absi %3 : tensor<4x4xi1>
        %277 = index.castu %extracted : i32 to index
        %278 = math.cttz %11 : tensor<8xi16>
        %279 = math.ctpop %4 : tensor<8xi1>
        %280 = index.casts %c11 : index to i32
        %281 = index.maxu %c2, %c6
        %282 = arith.ceildivsi %c7995_i16, %c7995_i16 : i16
        %cast_54 = tensor.cast %15 : tensor<8xf32> to tensor<?xf32>
        %283 = math.atan2 %in, %cst_4 : f16
        %284 = arith.remsi %c425051238_i64, %c147688179_i64 : i64
        %285 = math.fpowi %15, %12 : tensor<8xf32>, tensor<8xi32>
        %286 = vector.multi_reduction <maxui>, %19, %c147688179_i64 [0] : vector<4xi64> to i64
        %rank_55 = tensor.rank %8 : tensor<4x4x4xi64>
        %287 = math.cos %0 : tensor<4x4x4xf16>
        %inserted_56 = tensor.insert %false_23 into %3[%c2, %c3] : tensor<4x4xi1>
        %288 = arith.remsi %c1768117351_i32, %c1173614337_i32 : i32
        %289 = math.ceil %cst_3 : f32
        %290 = math.exp2 %in : f16
        %291 = arith.divf %cst_3, %cst_1 : f32
        %292 = math.ctlz %c147688179_i64 : i64
        %293 = arith.addf %cst_3, %cst : f32
        %294 = vector.multi_reduction <add>, %265, %265 [] : vector<4xi64> to vector<4xi64>
        %295 = index.floordivs %c7, %rank_55
        %296 = bufferization.clone %alloc_6 : memref<4x4xi16> to memref<4x4xi16>
        %297 = vector.broadcast %cst : f32 to vector<8xf32>
        %298 = vector.flat_transpose %297 {columns = 4 : i32, rows = 2 : i32} : vector<8xf32> -> vector<8xf32>
        %299 = math.fma %cst, %cst, %cst_3 : f32
        %300 = vector.splat %cst_2 : vector<4x4xf16>
        %301 = tensor.empty() : tensor<4x4xi16>
        %302 = linalg.matmul ins(%10, %10 : tensor<4x4xi16>, tensor<4x4xi16>) outs(%301 : tensor<4x4xi16>) -> tensor<4x4xi16>
        %extracted_57 = tensor.extract %cast_54[%c0] : tensor<?xf32>
        %303 = index.sub %31, %29
        %304 = index.casts %c7995_i16 : i16 to index
        linalg.yield %in : f16
      } -> tensor<4x4x4xf16>
      %272 = math.cttz %1 : tensor<8xi64>
      %273 = arith.subi %c147688179_i64, %c147688179_i64 : i64
      memref.tensor_store %12, %alloc_12 : memref<8xi32>
      %274 = bufferization.to_tensor %alloc_16 : memref<4x4xf16>
      %275 = index.castu %c2 : index to i32
      scf.yield
    }
    %45 = math.exp2 %15 : tensor<8xf32>
    %generated = tensor.generate %27, %c8, %c15 {
    ^bb0(%arg1: index, %arg2: index, %arg3: index):
      %263 = math.ipowi %9, %9 : tensor<8xi16>
      %264 = scf.index_switch %c12 -> tensor<8xi16> 
      case 1 {
        %267 = index.sub %c15, %c0
        %268 = math.ceil %15 : tensor<8xf32>
        %true_53 = index.bool.constant true
        %269 = arith.floordivsi %c425051238_i64, %c147688179_i64 : i64
        %270 = arith.addf %cst_2, %cst_4 : f16
        %271 = affine.apply affine_map<(d0) -> (((d0 ceildiv 32) ceildiv 8) ceildiv 128)>(%c9)
        %272 = math.fpowi %cst_4, %c243339535_i32 : f16, i32
        %273 = arith.ori %false_23, %false : i1
        %274 = index.divs %c10, %c3
        memref.store %c1768117351_i32, %alloc_22[%c2] : memref<8xi32>
        %275 = arith.minf %cst_1, %cst_1 : f32
        %276 = vector.broadcast %cst_4 : f16 to vector<11xf16>
        %277 = vector.transfer_write %276, %14[%c10, %c11, %c11] {permutation_map = affine_map<(d0, d1, d2) -> (d0)>} : vector<11xf16>, tensor<4x4x4xf16>
        %278 = math.tan %cst_3 : f32
        %279 = arith.remsi %c425051238_i64, %c147688179_i64 : i64
        %280 = index.divs %c5, %23
        %281 = vector.transpose %19, [0] : vector<4xi64> to vector<4xi64>
        scf.yield %9 : tensor<8xi16>
      }
      case 2 {
        %alloc_53 = memref.alloc() : memref<4x4x4xf16>
        %267 = vector.broadcast %cst_0 : f16 to vector<4x4x4xf16>
        %268 = vector.broadcast %false_23 : i1 to vector<4x4x4xi1>
        %269 = vector.broadcast %c243339535_i32 : i32 to vector<4x4x4xi32>
        %270 = vector.gather %alloc_53[%c15, %c8, %c2] [%269], %268, %267 : memref<4x4x4xf16>, vector<4x4x4xi32>, vector<4x4x4xi1>, vector<4x4x4xf16> into vector<4x4x4xf16>
        %271 = math.powf %cst, %cst : f32
        %272 = vector.matrix_multiply %26, %26 {lhs_columns = 4 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<4xi64>, vector<4xi64>) -> vector<1xi64>
        %273 = math.atan2 %0, %17 : tensor<4x4x4xf16>
        memref.tensor_store %1, %alloc_17 : memref<8xi64>
        %274 = vector.broadcast %cst_1 : f32 to vector<8xf32>
        %275 = vector.fma %274, %274, %274 : vector<8xf32>
        %276 = math.tan %14 : tensor<4x4x4xf16>
        %277 = vector.create_mask %c10 : vector<8xi1>
        %278 = math.absf %13 : tensor<8xf16>
        %279 = math.ctpop %3 : tensor<4x4xi1>
        %280 = arith.subi %c147688179_i64, %c425051238_i64 : i64
        %281 = vector.reduction <add>, %275 : vector<8xf32> into f32
        memref.store %c1768117351_i32, %alloc_7[%c3, %c1, %c1] : memref<4x4x4xi32>
        %282 = math.ctpop %18 : tensor<8xi16>
        %283 = affine.max affine_map<(d0, d1, d2) -> (d2 ceildiv 2 - d0 - 32)>(%23, %c12, %c3)
        %284 = arith.addf %cst, %cst_5 : f32
        scf.yield %9 : tensor<8xi16>
      }
      case 3 {
        %267 = vector.broadcast %c425051238_i64 : i64 to vector<8xi64>
        %268 = math.tan %17 : tensor<4x4x4xf16>
        %269 = arith.addf %cst_2, %cst_0 : f16
        %270 = math.ceil %6 : tensor<4x4xf16>
        %271 = arith.ori %extracted, %c243339535_i32 : i32
        %272 = vector.insertelement %c147688179_i64, %267[%c1 : index] : vector<8xi64>
        %273 = arith.remf %cst_3, %cst : f32
        %274 = arith.cmpf ule, %cst_5, %cst_5 : f32
        %275 = math.ipowi %18, %9 : tensor<8xi16>
        %276 = index.casts %c844_i16 : i16 to index
        %277 = arith.addf %cst_4, %cst_2 : f16
        %expanded_53 = tensor.expand_shape %17 [[0], [1], [2, 3]] : tensor<4x4x4xf16> into tensor<4x4x4x1xf16>
        %278 = vector.transpose %26, [0] : vector<4xi64> to vector<4xi64>
        %279 = vector.transpose %26, [0] : vector<4xi64> to vector<4xi64>
        %280 = math.log %6 : tensor<4x4xf16>
        %281 = vector.transpose %267, [0] : vector<8xi64> to vector<8xi64>
        scf.yield %18 : tensor<8xi16>
      }
      case 4 {
        %267 = affine.apply affine_map<(d0, d1, d2, d3) -> (d1)>(%c3, %c11, %c4, %c15)
        %268 = vector.broadcast %cst_1 : f32 to vector<f32>
        vector.transfer_write %268, %alloc_20[%c10] : vector<f32>, memref<8xf32>
        %269 = tensor.empty() : tensor<4x4x4x1xi32>
        %270 = math.fpowi %expanded, %269 : tensor<4x4x4x1xf16>, tensor<4x4x4x1xi32>
        memref.store %cst_2, %alloc_10[%c4] : memref<8xf16>
        %271 = arith.maxui %true, %false_23 : i1
        %272 = memref.load %alloc_8[%c1, %c1] : memref<4x4xi64>
        %273 = bufferization.to_tensor %alloc_20 : memref<8xf32>
        %274 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minsi>} %19, %26, %c147688179_i64 : vector<4xi64>, vector<4xi64> into i64
        %275 = tensor.empty() : tensor<8xi64>
        %276 = index.divu %c8, %c5
        %alloca_53 = memref.alloca() : memref<8xf16>
        %277 = arith.addi %false, %false : i1
        %278 = vector.extract %26[0] : vector<4xi64>
        %279 = arith.divf %cst_0, %cst_0 : f16
        %280 = vector.create_mask %c1 : vector<8xi1>
        %281 = arith.maxui %false_23, %false_23 : i1
        scf.yield %transposed : tensor<8xi16>
      }
      default {
        %267 = vector.multi_reduction <minsi>, %26, %c425051238_i64 [0] : vector<4xi64> to i64
        %268 = arith.ori %c1768117351_i32, %c1768117351_i32 : i32
        %269 = index.sizeof
        %270 = arith.minsi %c147688179_i64, %c147688179_i64 : i64
        %271 = index.sub %arg2, %arg3
        %expanded_53 = tensor.expand_shape %8 [[0], [1], [2, 3]] : tensor<4x4x4xi64> into tensor<4x4x4x1xi64>
        %272 = index.castu %c7995_i16 : i16 to index
        %rank_54 = tensor.rank %6 : tensor<4x4xf16>
        %273 = vector.broadcast %c1768117351_i32 : i32 to vector<i32>
        vector.transfer_write %273, %alloc_22[%arg3] : vector<i32>, memref<8xi32>
        %274 = arith.cmpf true, %cst_1, %cst : f32
        %275 = index.castu %c7995_i16 : i16 to index
        %276 = index.castu %extracted : i32 to index
        %277 = arith.maxf %cst_3, %cst_1 : f32
        %278 = arith.andi %false, %false_23 : i1
        %279 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxsi>} %19, %19, %c147688179_i64 : vector<4xi64>, vector<4xi64> into i64
        %280 = math.exp2 %cst_3 : f32
        scf.yield %11 : tensor<8xi16>
      }
      %265 = vector.matrix_multiply %19, %19 {lhs_columns = 4 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<4xi64>, vector<4xi64>) -> vector<1xi64>
      %266 = scf.execute_region -> memref<8xi16> {
        %267 = memref.atomic_rmw minu %c1173614337_i32, %alloc_12[%c3] : (i32, memref<8xi32>) -> i32
        %268 = bufferization.to_tensor %alloc_20 : memref<8xf32>
        %cast_53 = tensor.cast %8 : tensor<4x4x4xi64> to tensor<?x?x?xi64>
        %269 = arith.minf %cst_1, %cst_1 : f32
        %270 = vector.matrix_multiply %26, %265 {lhs_columns = 1 : i32, lhs_rows = 4 : i32, rhs_columns = 1 : i32} : (vector<4xi64>, vector<1xi64>) -> vector<4xi64>
        %271 = vector.extract_strided_slice %265 {offsets = [0], sizes = [1], strides = [1]} : vector<1xi64> to vector<1xi64>
        %272 = arith.shrsi %c147688179_i64, %c425051238_i64 : i64
        %273 = index.floordivs %c2, %31
        %274 = index.sizeof
        %275 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minui>} %270, %26, %c425051238_i64 : vector<4xi64>, vector<4xi64> into i64
        %276 = math.ctlz %c844_i16 : i16
        %inserted_54 = tensor.insert %cst_3 into %268[%c2] : tensor<8xf32>
        %277 = math.expm1 %cst_5 : f32
        %278 = tensor.empty() : tensor<4x4x4xi32>
        %279 = math.fpowi %14, %278 : tensor<4x4x4xf16>, tensor<4x4x4xi32>
        %280 = math.sqrt %16 : tensor<4x4x4xf16>
        memref.assume_alignment %alloc_17, 16 : memref<8xi64>
        scf.yield %alloc_14 : memref<8xi16>
      }
      tensor.yield %cst_5 : f32
    } : tensor<?x?x?xf32>
    %46 = vector.broadcast %cst_1 : f32 to vector<4x4xf32>
    %47 = vector.transpose %46, [0, 1] : vector<4x4xf32> to vector<4x4xf32>
    %48 = math.exp %14 : tensor<4x4x4xf16>
    %49 = vector.splat %c7 : vector<4x4xindex>
    %extracted_24 = tensor.extract %8[%c3, %c0, %c0] : tensor<4x4x4xi64>
    %50 = arith.shrsi %extracted_24, %extracted_24 : i64
    %51 = tensor.empty() : tensor<8xf16>
    %52 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d1, d2, d0)>, affine_map<(d0, d1, d2) -> (d0, d2)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%0, %6 : tensor<4x4x4xf16>, tensor<4x4xf16>) outs(%17 : tensor<4x4x4xf16>) {
    ^bb0(%in: f16, %in_53: f16, %out: f16):
      %263 = math.copysign %cst_5, %cst_5 : f32
      %264 = arith.remf %cst, %cst_3 : f32
      %265 = affine.max affine_map<(d0, d1, d2) -> ((d2 + d1) ceildiv 16, d1 + 4)>(%c11, %c8, %c14)
      %266 = vector.insert %c425051238_i64, %19 [2] : i64 into vector<4xi64>
      %expanded_54 = tensor.expand_shape %8 [[0], [1], [2, 3]] : tensor<4x4x4xi64> into tensor<4x4x4x1xi64>
      %267 = math.tan %0 : tensor<4x4x4xf16>
      %268 = bufferization.to_tensor %alloc_13 : memref<8xi1>
      %269 = arith.shli %c425051238_i64, %extracted_24 : i64
      %270 = index.floordivs %c0, %c3
      scf.execute_region {
        %292 = math.ipowi %3, %3 : tensor<4x4xi1>
        %293 = vector.broadcast %cst : f32 to vector<4x4xf32>
        %294 = vector.fma %293, %293, %46 : vector<4x4xf32>
        %alloca_56 = memref.alloca() : memref<4x4xf32>
        %295 = arith.minf %cst_3, %cst_1 : f32
        %296 = vector.flat_transpose %19 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
        %297 = math.fpowi %cst_0, %extracted : f16, i32
        %298 = arith.divui %false_23, %false : i1
        %299 = vector.insertelement %c147688179_i64, %26[%c13 : index] : vector<4xi64>
        %300 = memref.load %alloc_16[%c0, %c0] : memref<4x4xf16>
        %301 = affine.apply affine_map<(d0) -> (((d0 ceildiv 32) ceildiv 8) ceildiv 128)>(%29)
        %302 = arith.ori %extracted, %c1173614337_i32 : i32
        %inserted_57 = tensor.insert %c844_i16 into %10[%c0, %c0] : tensor<4x4xi16>
        vector.print %293 : vector<4x4xf32>
        %303 = tensor.empty() : tensor<4x4xf16>
        %304 = linalg.matmul ins(%6, %6 : tensor<4x4xf16>, tensor<4x4xf16>) outs(%303 : tensor<4x4xf16>) -> tensor<4x4xf16>
        %305 = arith.maxui %c844_i16, %c7995_i16 : i16
        %306 = arith.maxui %extracted_24, %extracted_24 : i64
        scf.yield
      }
      %271 = vector.extract_strided_slice %19 {offsets = [2], sizes = [1], strides = [1]} : vector<4xi64> to vector<1xi64>
      %272 = vector.broadcast %cst : f32 to vector<8xf32>
      %273 = vector.broadcast %false_23 : i1 to vector<8xi1>
      %274 = vector.broadcast %c1173614337_i32 : i32 to vector<8xi32>
      %275 = vector.gather %alloc_18[%c4, %c3] [%274], %273, %272 : memref<4x4xf32>, vector<8xi32>, vector<8xi1>, vector<8xf32> into vector<8xf32>
      memref.store %cst_2, %alloc_15[%c6] : memref<8xf16>
      %276 = math.cttz %2 : tensor<4x4xi64>
      %277 = arith.divui %true, %true : i1
      %278 = vector.broadcast %cst_0 : f16 to vector<8xf16>
      %279 = arith.shli %c425051238_i64, %c147688179_i64 : i64
      %inserted_55 = tensor.insert %extracted into %20[] : tensor<i32>
      %280 = vector.broadcast %c12 : index to vector<8xindex>
      %281 = vector.broadcast %c147688179_i64 : i64 to vector<8xi64>
      vector.scatter %alloc_9[%c1, %c2] [%280], %273, %281 : memref<4x4xi64>, vector<8xindex>, vector<8xi1>, vector<8xi64>
      %282 = index.ceildivu %265, %c0
      %283 = math.cttz %5 : tensor<8xi64>
      memref.tensor_store %transposed, %alloc_14 : memref<8xi16>
      %284 = arith.shrsi %false_23, %true : i1
      %285 = arith.ori %c147688179_i64, %c147688179_i64 : i64
      %collapsed = tensor.collapse_shape %10 [[0, 1]] : tensor<4x4xi16> into tensor<16xi16>
      %286 = arith.remf %cst_1, %cst_3 : f32
      %287 = arith.minsi %c425051238_i64, %extracted_24 : i64
      %288 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<minui>} %19, %19, %c147688179_i64 : vector<4xi64>, vector<4xi64> into i64
      %289 = vector.matrix_multiply %272, %275 {lhs_columns = 8 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<8xf32>, vector<8xf32>) -> vector<1xf32>
      %290 = math.exp %in : f16
      memref.assume_alignment %alloc_18, 16 : memref<4x4xf32>
      %291 = vector.transpose %271, [0] : vector<1xi64> to vector<1xi64>
      linalg.yield %cst_0 : f16
    } -> tensor<4x4x4xf16>
    %53 = math.fpowi %cst_3, %c243339535_i32 : f32, i32
    %54 = index.sizeof
    %55 = math.rsqrt %51 : tensor<8xf16>
    %56 = index.maxu %28, %31
    affine.for %arg1 = 0 to 0 {
    }
    %57 = math.ipowi %11, %18 : tensor<8xi16>
    %58 = index.floordivs %c3, %54
    %59 = arith.ori %c1768117351_i32, %c1173614337_i32 : i32
    %60 = bufferization.clone %alloc_11 : memref<4x4x4xi16> to memref<4x4x4xi16>
    %extracted_25 = tensor.extract %15[%c7] : tensor<8xf32>
    %61 = math.ctlz %1 : tensor<8xi64>
    %62 = index.casts %c14 : index to i32
    %63 = index.sizeof
    %64 = index.divu %27, %54
    %65 = math.floor %17 : tensor<4x4x4xf16>
    %66 = tensor.empty(%c15, %27) : tensor<?x?xi1>
    %67 = arith.mulf %cst_2, %cst_2 : f16
    %68 = math.round %14 : tensor<4x4x4xf16>
    %69 = scf.index_switch %c10 -> vector<4x4x4xi1> 
    case 1 {
      %263 = arith.ori %false, %false : i1
      %264 = math.exp2 %cst_2 : f16
      %265 = arith.minf %cst_1, %extracted_25 : f32
      %266 = index.divs %23, %27
      bufferization.dealloc_tensor %transposed : tensor<8xi16>
      %267 = arith.maxsi %extracted, %c1768117351_i32 : i32
      %268 = affine.apply affine_map<(d0, d1, d2) -> ((d0 - d1) mod 64)>(%56, %54, %63)
      %269 = arith.remf %cst_0, %cst_2 : f16
      %270 = index.sizeof
      %271 = arith.andi %c425051238_i64, %extracted_24 : i64
      %272 = vector.transpose %19, [0] : vector<4xi64> to vector<4xi64>
      %rank_53 = tensor.rank %11 : tensor<8xi16>
      %rank_54 = tensor.rank %9 : tensor<8xi16>
      %273 = math.log10 %6 : tensor<4x4xf16>
      %274 = vector.transpose %26, [0] : vector<4xi64> to vector<4xi64>
      %275 = bufferization.clone %alloc_10 : memref<8xf16> to memref<8xf16>
      %276 = vector.broadcast %false : i1 to vector<4x4x4xi1>
      scf.yield %276 : vector<4x4x4xi1>
    }
    case 2 {
      %263 = index.castu %c11 : index to i32
      %264 = math.cttz %8 : tensor<4x4x4xi64>
      %265 = tensor.empty(%31) : tensor<?xi16>
      %266 = affine.load %alloc_7[%c15, %c4, %c15] : memref<4x4x4xi32>
      %267 = index.sizeof
      %268 = arith.divf %extracted_25, %cst : f32
      %269 = index.divs %31, %c11
      %270 = arith.cmpf uno, %cst_2, %cst_2 : f16
      %271 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d1, d0)>, affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} ins(%6, %alloc_16, %6 : tensor<4x4xf16>, memref<4x4xf16>, tensor<4x4xf16>) outs(%0 : tensor<4x4x4xf16>) {
      ^bb0(%in: f16, %in_54: f16, %in_55: f16, %out: f16):
        %279 = math.floor %14 : tensor<4x4x4xf16>
        %280 = math.expm1 %15 : tensor<8xf32>
        %281 = arith.ceildivsi %c7995_i16, %c844_i16 : i16
        %282 = bufferization.clone %alloc : memref<4x4x4xi64> to memref<4x4x4xi64>
        %inserted_56 = tensor.insert %in_54 into %expanded[%c2, %c0, %c1, %c0] : tensor<4x4x4x1xf16>
        %283 = math.tanh %cst_2 : f16
        %cast_57 = tensor.cast %expanded : tensor<4x4x4x1xf16> to tensor<?x?x?x?xf16>
        %284 = math.ctlz %4 : tensor<8xi1>
        %285 = math.tanh %6 : tensor<4x4xf16>
        %286 = vector.create_mask %54, %c13 : vector<4x4xi1>
        %cast_58 = tensor.cast %4 : tensor<8xi1> to tensor<?xi1>
        %287 = index.divu %c9, %c3
        %288 = vector.broadcast %in : f16 to vector<8xf16>
        %289 = index.add %56, %54
        %290 = arith.divui %c1173614337_i32, %c243339535_i32 : i32
        %291 = math.fma %extracted_25, %cst_3, %cst_5 : f32
        %292 = memref.atomic_rmw assign %in, %alloc_15[%c2] : (f16, memref<8xf16>) -> f16
        %293 = index.casts %false : i1 to index
        %c21177_i16 = arith.constant 21177 : i16
        %294 = arith.maxf %cst_4, %cst_2 : f16
        %295 = vector.extract_strided_slice %46 {offsets = [1], sizes = [3], strides = [1]} : vector<4x4xf32> to vector<3x4xf32>
        %296 = math.absf %cst_5 : f32
        %297 = math.ipowi %extracted_24, %extracted_24 : i64
        %298 = math.exp2 %cst : f32
        %299 = arith.ori %false, %false_23 : i1
        %300 = math.log %cst_3 : f32
        %301 = arith.ori %c147688179_i64, %extracted_24 : i64
        %302 = arith.xori %c7995_i16, %c844_i16 : i16
        %303 = vector.shuffle %26, %26 [0, 2, 4, 7] : vector<4xi64>, vector<4xi64>
        %304 = arith.minui %extracted_24, %extracted_24 : i64
        %305 = math.ctpop %7 : tensor<8xi32>
        %306 = vector.transpose %295, [0, 1] : vector<3x4xf32> to vector<3x4xf32>
        linalg.yield %cst_4 : f16
      } -> tensor<4x4x4xf16>
      %272 = vector.insert %c147688179_i64, %26 [3] : i64 into vector<4xi64>
      %273 = arith.maxui %false_23, %false_23 : i1
      %expanded_53 = tensor.expand_shape %1 [[0, 1]] : tensor<8xi64> into tensor<8x1xi64>
      %274 = vector.flat_transpose %26 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
      %275 = math.absi %false_23 : i1
      %276 = index.sizeof
      %277 = vector.flat_transpose %274 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
      %278 = vector.broadcast %false : i1 to vector<4x4x4xi1>
      scf.yield %278 : vector<4x4x4xi1>
    }
    case 3 {
      %263 = index.casts %c5 : index to i32
      %264 = math.exp2 %cst_5 : f32
      %265 = index.sizeof
      %266 = arith.shrui %c7995_i16, %c7995_i16 : i16
      memref.store %extracted_24, %alloc_8[%c3, %c3] : memref<4x4xi64>
      %267 = vector.transpose %26, [0] : vector<4xi64> to vector<4xi64>
      %268 = arith.ori %false_23, %false : i1
      %269 = vector.broadcast %cst : f32 to vector<8xf32>
      %270 = vector.fma %269, %269, %269 : vector<8xf32>
      %271 = math.absi %4 : tensor<8xi1>
      %272 = index.ceildivu %c13, %c14
      %273 = tensor.empty() : tensor<4x4xi16>
      %274 = linalg.matmul ins(%10, %10 : tensor<4x4xi16>, tensor<4x4xi16>) outs(%273 : tensor<4x4xi16>) -> tensor<4x4xi16>
      %275 = arith.remf %cst_5, %cst : f32
      %276 = math.ctpop %4 : tensor<8xi1>
      memref.assume_alignment %alloc_14, 1 : memref<8xi16>
      %277 = vector.broadcast %cst_5 : f32 to vector<4xf32>
      %dest, %accumulated_value = vector.scan <add>, %46, %277 {inclusive = true, reduction_dim = 1 : i64} : vector<4x4xf32>, vector<4xf32>
      %278 = math.exp2 %16 : tensor<4x4x4xf16>
      %279 = vector.broadcast %false : i1 to vector<4x4x4xi1>
      scf.yield %279 : vector<4x4x4xi1>
    }
    case 4 {
      %263 = arith.addf %cst_5, %cst_1 : f32
      %264 = math.rsqrt %6 : tensor<4x4xf16>
      vector.print %26 : vector<4xi64>
      %265 = vector.splat %c12 : vector<4x4xindex>
      %266 = vector.bitcast %46 : vector<4x4xf32> to vector<4x4xf32>
      %267 = scf.index_switch %c10 -> i1 
      case 1 {
        %282 = arith.maxf %cst_5, %cst_3 : f32
        %283 = math.ipowi %c1173614337_i32, %c1173614337_i32 : i32
        %284 = arith.xori %c425051238_i64, %c147688179_i64 : i64
        %285 = vector.create_mask %c1 : vector<8xi1>
        %286 = math.tanh %14 : tensor<4x4x4xf16>
        %287 = math.log10 %extracted_25 : f32
        %288 = arith.divui %true, %false_23 : i1
        %289 = vector.flat_transpose %26 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
        %290 = arith.ceildivsi %true, %false_23 : i1
        %291 = math.ipowi %12, %7 : tensor<8xi32>
        %292 = math.exp %15 : tensor<8xf32>
        %293 = arith.ceildivsi %extracted_24, %c425051238_i64 : i64
        %expanded_53 = tensor.expand_shape %7 [[0, 1]] : tensor<8xi32> into tensor<8x1xi32>
        %294 = index.sub %c1, %c7
        %295 = math.exp2 %16 : tensor<4x4x4xf16>
        %296 = vector.flat_transpose %19 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
        scf.yield %false_23 : i1
      }
      case 2 {
        %282 = arith.xori %true, %false : i1
        %283 = math.cttz %10 : tensor<4x4xi16>
        %284 = index.maxu %c12, %c4
        %285 = vector.broadcast %false_23 : i1 to vector<8xi1>
        %286 = vector.transfer_write %285, %3[%c8, %c9] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<8xi1>, tensor<4x4xi1>
        %287 = arith.maxui %extracted, %extracted : i32
        %288 = tensor.empty() : tensor<4x4xf16>
        %289 = linalg.matmul ins(%6, %6 : tensor<4x4xf16>, tensor<4x4xf16>) outs(%288 : tensor<4x4xf16>) -> tensor<4x4xf16>
        %290 = arith.minsi %false, %false_23 : i1
        %291 = memref.atomic_rmw addf %cst_0, %alloc_10[%c0] : (f16, memref<8xf16>) -> f16
        %292 = vector.transpose %266, [0, 1] : vector<4x4xf32> to vector<4x4xf32>
        %293 = index.castu %false_23 : i1 to index
        %294 = vector.broadcast %cst_4 : f16 to vector<4x4x4xf16>
        %295 = math.absf %cst_4 : f16
        %296 = vector.broadcast %true : i1 to vector<i1>
        %297 = vector.transfer_write %296, %4[%58] : vector<i1>, tensor<8xi1>
        %298 = math.tanh %6 : tensor<4x4xf16>
        %expanded_53 = tensor.expand_shape %17 [[0], [1], [2, 3]] : tensor<4x4x4xf16> into tensor<4x4x4x1xf16>
        %299 = index.sizeof
        scf.yield %false : i1
      }
      case 3 {
        memref.tensor_store %2, %alloc_8 : memref<4x4xi64>
        %alloca_53 = memref.alloca() : memref<8xi1>
        %282 = vector.extract_strided_slice %26 {offsets = [0], sizes = [4], strides = [1]} : vector<4xi64> to vector<4xi64>
        %283 = bufferization.clone %alloc_7 : memref<4x4x4xi32> to memref<4x4x4xi32>
        %extracted_54 = tensor.extract %15[%c3] : tensor<8xf32>
        %284 = math.cttz %3 : tensor<4x4xi1>
        %285 = arith.minf %cst, %cst_5 : f32
        %286 = vector.insert %extracted_24, %26 [0] : i64 into vector<4xi64>
        %287 = math.floor %15 : tensor<8xf32>
        %288 = vector.transpose %266, [1, 0] : vector<4x4xf32> to vector<4x4xf32>
        %289 = vector.extract_strided_slice %266 {offsets = [0], sizes = [1], strides = [1]} : vector<4x4xf32> to vector<1x4xf32>
        %290 = math.round %cst_2 : f16
        %291 = vector.flat_transpose %19 {columns = 2 : i32, rows = 2 : i32} : vector<4xi64> -> vector<4xi64>
        %292 = vector.broadcast %c425051238_i64 : i64 to vector<4x4xi64>
        %293 = vector.outerproduct %291, %26, %292 {kind = #vector.kind<and>} : vector<4xi64>, vector<4xi64>
        memref.tensor_store %11, %alloc_14 : memref<8xi16>
        %294 = math.copysign %cst_4, %cst_2 : f16
        scf.yield %true : i1
      }
      default {
        %282 = index.casts %c11 : index to i32
        %283 = affine.apply affine_map<(d0, d1, d2) -> ((d0 - d1) mod 64)>(%c4, %64, %c11)
        %284 = math.ctlz %false_23 : i1
        %285 = vector.create_mask %54, %c4, %c0 : vector<4x4x4xi1>
        %286 = math.exp %15 : tensor<8xf32>
        %287 = vector.matrix_multiply %26, %19 {lhs_columns = 4 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<4xi64>, vector<4xi64>) -> vector<1xi64>
        %288 = math.exp %15 : tensor<8xf32>
        %289 = vector.reduction <and>, %19 : vector<4xi64> into i64
        %290 = arith.mulf %cst_3, %cst_3 : f32
        %291 = arith.xori %true, %false_23 : i1
        %292 = arith.ori %extracted_24, %c425051238_i64 : i64
        %293 = math.exp2 %6 : tensor<4x4xf16>
        %cst_53 = arith.constant 2.729600e+04 : f16
        %294 = vector.broadcast %58 : index to vector<16xindex>
        %295 = vector.broadcast %true : i1 to vector<16xi1>
        %296 = vector.broadcast %cst_4 : f16 to vector<16xf16>
        vector.scatter %alloc_15[%c0] [%294], %295, %296 : memref<8xf16>, vector<16xindex>, vector<16xi1>, vector<16xf16>
        %297 = math.tanh %14 : tensor<4x4x4xf16>
        %298 = vector.broadcast %c147688179_i64 : i64 to vector<4x4xi64>
        %299 = vector.outerproduct %19, %26, %298 {kind = #vector.kind<maxui>} : vector<4xi64>, vector<4xi64>
        scf.yield %false : i1
      }
      %268 = math.log10 %13 : tensor<8xf16>
      %269 = math.tanh %6 : tensor<4x4xf16>
      %270 = tensor.empty() : tensor<4x4xi1>
      %271 = linalg.matmul ins(%3, %3 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%270 : tensor<4x4xi1>) -> tensor<4x4xi1>
      %272 = vector.broadcast %c0 : index to vector<4xindex>
      %273 = vector.broadcast %false_23 : i1 to vector<4xi1>
      %274 = vector.broadcast %c844_i16 : i16 to vector<4xi16>
      vector.scatter %33[%c1, %c2] [%272], %273, %274 : memref<4x4xi16>, vector<4xindex>, vector<4xi1>, vector<4xi16>
      %275 = arith.divui %c243339535_i32, %c1768117351_i32 : i32
      %276 = bufferization.to_tensor %33 : memref<4x4xi16>
      %277 = arith.maxui %false_23, %false : i1
      %278 = math.atan %cst_2 : f16
      %279 = arith.divsi %c425051238_i64, %c425051238_i64 : i64
      %280 = vector.broadcast %c425051238_i64 : i64 to vector<8xi64>
      %281 = vector.broadcast %true : i1 to vector<4x4x4xi1>
      scf.yield %281 : vector<4x4x4xi1>
    }
    default {
      %263 = vector.create_mask %c13, %56 : vector<4x4xi1>
      %264 = vector.matrix_multiply %19, %26 {lhs_columns = 4 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<4xi64>, vector<4xi64>) -> vector<1xi64>
      %265 = math.log10 %cst_3 : f32
      %266 = index.castu %c9 : index to i32
      %inserted_53 = tensor.insert %cst into %generated[%c0, %c0, %c0] : tensor<?x?x?xf32>
      %267 = vector.broadcast %c0 : index to vector<4xindex>
      %268 = vector.broadcast %false : i1 to vector<4xi1>
      vector.scatter %alloc_8[%c1, %c0] [%267], %268, %19 : memref<4x4xi64>, vector<4xindex>, vector<4xi1>, vector<4xi64>
      %269 = affine.apply affine_map<(d0, d1, d2) -> ((d0 - d1) mod 64)>(%c0, %58, %c14)
      %270 = vector.extract %19[0] : vector<4xi64>
      %271 = bufferization.to_tensor %alloc_16 : memref<4x4xf16>
      %272 = tensor.empty() : tensor<4x4x4xi32>
      %273 = math.fpowi %14, %272 : tensor<4x4x4xf16>, tensor<4x4x4xi32>
      %274 = index.floordivs %c15, %29
      %275 = vector.matrix_multiply %26, %264 {lhs_columns = 1 : i32, lhs_rows = 4 : i32, rhs_columns = 1 : i32} : (vector<4xi64>, vector<1xi64>) -> vector<4xi64>
      %276 = math.exp %13 : tensor<8xf16>
      %277 = math.log2 %13 : tensor<8xf16>
      %278 = arith.maxsi %false_23, %false : i1
