module {
  func.func @func1(%arg0: memref<14x14xf16>, %arg1: i64, %arg2: vector<16x11xi64>) {
    %c644607405_i32 = arith.constant 644607405 : i32
    %c1508905138_i64 = arith.constant 1508905138 : i64
    %c18917_i16 = arith.constant 18917 : i16
    %cst = arith.constant 3.529600e+04 : f16
    %c1199270634_i64 = arith.constant 1199270634 : i64
    %c1313612593_i64 = arith.constant 1313612593 : i64
    %true = arith.constant true
    %cst_0 = arith.constant 1.77635379E+9 : f32
    %true_1 = arith.constant true
    %c766674261_i32 = arith.constant 766674261 : i32
    %cst_2 = arith.constant 5.084800e+04 : f16
    %c928860611_i32 = arith.constant 928860611 : i32
    %false = arith.constant false
    %c-23065_i16 = arith.constant -23065 : i16
    %c1581681977_i32 = arith.constant 1581681977 : i32
    %c614314845_i64 = arith.constant 614314845 : i64
    %0 = tensor.empty() : tensor<16x14xi1>
    %1 = tensor.empty() : tensor<16x11xi1>
    %2 = tensor.empty() : tensor<16x11xf32>
    %3 = tensor.empty() : tensor<16x14xi64>
    %4 = tensor.empty() : tensor<16x14xi16>
    %5 = tensor.empty() : tensor<16x14xf16>
    %6 = tensor.empty() : tensor<16x11x14xi16>
    %7 = tensor.empty() : tensor<16x11xf16>
    %8 = tensor.empty() : tensor<16x14xi1>
    %9 = tensor.empty() : tensor<16x11xi1>
    %10 = tensor.empty() : tensor<16x14xi1>
    %11 = tensor.empty() : tensor<16x11xi32>
    %12 = tensor.empty() : tensor<16x14xf32>
    %13 = tensor.empty() : tensor<16x11xi64>
    %14 = tensor.empty() : tensor<14x14xf16>
    %15 = tensor.empty() : tensor<16x11x14xf32>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %c4 = arith.constant 4 : index
    %c5 = arith.constant 5 : index
    %c6 = arith.constant 6 : index
    %c7 = arith.constant 7 : index
    %c8 = arith.constant 8 : index
    %c9 = arith.constant 9 : index
    %c10 = arith.constant 10 : index
    %c11 = arith.constant 11 : index
    %c12 = arith.constant 12 : index
    %c13 = arith.constant 13 : index
    %c14 = arith.constant 14 : index
    %c15 = arith.constant 15 : index
    %alloc = memref.alloc() : memref<16x14xf32>
    %alloc_3 = memref.alloc() : memref<14x14xi32>
    %alloc_4 = memref.alloc() : memref<16x14xf16>
    %alloc_5 = memref.alloc() : memref<16x11x14xf16>
    %alloc_6 = memref.alloc() : memref<16x11xf32>
    %alloc_7 = memref.alloc() : memref<16x14xf32>
    %alloc_8 = memref.alloc() : memref<14x14xi1>
    %alloc_9 = memref.alloc() : memref<16x14xf16>
    %alloc_10 = memref.alloc() : memref<14x14xi32>
    %alloc_11 = memref.alloc() : memref<16x11xi1>
    %alloc_12 = memref.alloc() : memref<16x14xi32>
    %alloc_13 = memref.alloc() : memref<14x14xi1>
    %alloc_14 = memref.alloc() : memref<16x11xi16>
    %alloc_15 = memref.alloc() : memref<16x11xi32>
    %alloc_16 = memref.alloc() : memref<14x14xf16>
    %alloc_17 = memref.alloc() : memref<16x11x14xf32>
    %16 = tensor.empty() : tensor<16x14xf16>
    %17 = linalg.copy ins(%5 : tensor<16x14xf16>) outs(%16 : tensor<16x14xf16>) -> tensor<16x14xf16>
    %alloc_18 = memref.alloc() : memref<14x16xf16>
    linalg.transpose ins(%5 : tensor<16x14xf16>) outs(%alloc_18 : memref<14x16xf16>) permutation = [1, 0] 
    %alloc_19 = memref.alloc() : memref<14xi1>
    linalg.reduce ins(%10 : tensor<16x14xi1>) outs(%alloc_19 : memref<14xi1>) dimensions = [0] 
      (%in: i1, %init: i1) {
        %283 = math.expm1 %cst_2 : f16
        %284 = arith.remf %cst, %cst : f16
        %285 = math.tan %cst_2 : f16
        %286 = vector.broadcast %false : i1 to vector<1xi1>
        %287 = vector.broadcast %init : i1 to vector<1xi1>
        %288 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxsi>} %286, %287, %true_1 : vector<1xi1>, vector<1xi1> into i1
        %289 = math.fma %5, %5, %5 : tensor<16x14xf16>
        %290 = arith.minui %c766674261_i32, %c1581681977_i32 : i32
        %291 = arith.addi %c1581681977_i32, %c766674261_i32 : i32
        %292 = memref.realloc %alloc_19 : memref<14xi1> to memref<13xi1>
        %true_36 = arith.constant true
        linalg.yield %true_36 : i1
      }
    %18 = scf.parallel (%arg3, %arg4) = (%c9, %c13) to (%c15, %c3) step (%c3, %c3) init (%c1508905138_i64) -> i64 {
      %283 = arith.maxui %true_1, %false : i1
      %284 = math.rsqrt %12 : tensor<16x14xf32>
      %285 = arith.remf %cst_0, %cst_0 : f32
      %286 = index.sub %c3, %c11
      %287 = vector.broadcast %true_1 : i1 to vector<1xi1>
      %288 = vector.extract %287[0] : vector<1xi1>
      affine.for %arg5 = 0 to 29 {
      }
      %289 = vector.extract %287[0] : vector<1xi1>
      %290 = vector.shuffle %287, %287 [0] : vector<1xi1>, vector<1xi1>
      %291 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<maxui>} %287, %287, %true : vector<1xi1>, vector<1xi1> into i1
      %rank_36 = tensor.rank %15 : tensor<16x11x14xf32>
      %292 = vector.transpose %287, [0] : vector<1xi1> to vector<1xi1>
      %293 = index.ceildivs %c7, %c13
      %294 = arith.mulf %cst, %cst : f16
      %295 = math.copysign %5, %5 : tensor<16x14xf16>
      %296 = vector.create_mask %c15, %arg4, %c3 : vector<16x11x14xi1>
      %297 = bufferization.clone %alloc_8 : memref<14x14xi1> to memref<14x14xi1>
      %c0_i64 = arith.constant 0 : i64
      scf.reduce(%c0_i64)  : i64 {
      ^bb0(%arg5: i64, %arg6: i64):
        %298 = arith.minf %cst, %cst_2 : f16
        %alloc_37 = memref.alloc() : memref<16x11xi1>
        %299 = arith.xori %c18917_i16, %c-23065_i16 : i16
        %300 = math.roundeven %2 : tensor<16x11xf32>
        memref.assume_alignment %alloc_4, 8 : memref<16x14xf16>
        %301 = vector.broadcast %false : i1 to vector<1x1xi1>
        %302 = vector.outerproduct %287, %287, %301 {kind = #vector.kind<minsi>} : vector<1xi1>, vector<1xi1>
        %303 = memref.atomic_rmw addf %cst, %alloc_18[%c1, %c9] : (f16, memref<14x16xf16>) -> f16
        %304 = memref.realloc %alloc_19 : memref<14xi1> to memref<11xi1>
        %c0_i64_38 = arith.constant 0 : i64
        scf.reduce.return %c0_i64_38 : i64
      }
      scf.yield
    }
    %19 = affine.vector_load %alloc_5[%c1, %c2, %c3] : memref<16x11x14xf16>, vector<13xf16>
    affine.vector_store %19, %alloc_4[%c8, %c0] : memref<16x14xf16>, vector<13xf16>
    %alloc_20 = memref.alloc() : memref<14xi1>
    %20 = tensor.empty() : tensor<i1>
    %21 = linalg.dot ins(%alloc_19, %alloc_20 : memref<14xi1>, memref<14xi1>) outs(%20 : tensor<i1>) -> tensor<i1>
    %22 = affine.for %arg3 = 0 to 60 iter_args(%arg4 = %1) -> (tensor<16x11xi1>) {
      affine.yield %9 : tensor<16x11xi1>
    }
    %23 = arith.floordivsi %true_1, %false : i1
    %24 = tensor.empty() : tensor<16x11x14xi32>
    %25 = math.fpowi %15, %24 : tensor<16x11x14xf32>, tensor<16x11x14xi32>
    %26 = vector.broadcast %true : i1 to vector<16x11xi1>
    %27 = bufferization.to_tensor %alloc_13 : memref<14x14xi1>
    %28 = math.log %2 : tensor<16x11xf32>
    %rank = tensor.rank %6 : tensor<16x11x14xi16>
    %29 = arith.minui %c766674261_i32, %c1581681977_i32 : i32
    %30 = index.ceildivu %c7, %c11
    %31 = arith.remui %c766674261_i32, %c1581681977_i32 : i32
    %32 = bufferization.clone %alloc_20 : memref<14xi1> to memref<14xi1>
    %33 = bufferization.clone %alloc : memref<16x14xf32> to memref<16x14xf32>
    %34 = bufferization.to_memref %1 : memref<16x11xi1>
    %35 = math.sqrt %2 : tensor<16x11xf32>
    %36 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<add>} %19, %19, %cst : vector<13xf16>, vector<13xf16> into f16
    %37 = affine.if affine_set<(d0, d1) : (d0 == 0)>(%c9, %c7) -> i64 {
      %283 = memref.load %alloc_6[%c6, %c1] : memref<16x11xf32>
      %284 = scf.while (%arg3 = %c1581681977_i32) : (i32) -> i32 {
        %288 = arith.remf %cst_0, %cst_0 : f32
        %289 = math.ctpop %c18917_i16 : i16
        %290 = vector.broadcast %c18917_i16 : i16 to vector<16x14xi16>
        %291 = vector.broadcast %false : i1 to vector<16x14xi1>
        %292 = vector.broadcast %c766674261_i32 : i32 to vector<16x14xi32>
        %293 = vector.gather %6[%c6, %c0, %c3] [%292], %291, %290 : tensor<16x11x14xi16>, vector<16x14xi32>, vector<16x14xi1>, vector<16x14xi16> into vector<16x14xi16>
        %294 = math.tanh %14 : tensor<14x14xf16>
        %295 = arith.shli %c1313612593_i64, %c614314845_i64 : i64
        %296 = affine.apply affine_map<(d0, d1, d2) -> (d0 * 8)>(%c3, %c0, %c4)
        %297 = vector.matrix_multiply %19, %19 {lhs_columns = 13 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<13xf16>, vector<13xf16>) -> vector<1xf16>
        %rank_37 = tensor.rank %10 : tensor<16x14xi1>
        scf.condition(%false) %c766674261_i32 : i32
      } do {
      ^bb0(%arg3: i32):
        %288 = memref.atomic_rmw mins %c644607405_i32, %alloc_12[%c4, %c9] : (i32, memref<16x14xi32>) -> i32
        %289 = arith.ceildivsi %c-23065_i16, %c18917_i16 : i16
        %290 = vector.broadcast %false : i1 to vector<14xi1>
        %291 = vector.maskedload %alloc_20[%c6], %290, %290 : memref<14xi1>, vector<14xi1>, vector<14xi1> into vector<14xi1>
        %292 = bufferization.clone %alloc_8 : memref<14x14xi1> to memref<14x14xi1>
        %293 = index.ceildivu %rank, %c0
        %294 = arith.minsi %true, %true : i1
        %295 = arith.remui %false, %false : i1
        %296 = index.maxu %c2, %c6
        %297 = arith.addi %c928860611_i32, %c766674261_i32 : i32
        %298 = index.maxu %c14, %296
        %299 = vector.broadcast %cst : f16 to vector<13x13xf16>
        %300 = vector.outerproduct %19, %19, %299 {kind = #vector.kind<maxf>} : vector<13xf16>, vector<13xf16>
        %301 = bufferization.to_tensor %alloc_9 : memref<16x14xf16>
        %302 = math.roundeven %14 : tensor<14x14xf16>
        %303 = tensor.empty() : tensor<16x14xi64>
        %cst_37 = arith.constant 1.000000e+00 : f32
        %304 = vector.transfer_read %33[%c7, %c10], %cst_37 : memref<16x14xf32>, vector<f32>
        %305 = vector.broadcast %true_1 : i1 to vector<16xi1>
        %dest_38, %accumulated_value_39 = vector.scan <maxui>, %26, %305 {inclusive = false, reduction_dim = 1 : i64} : vector<16x11xi1>, vector<16xi1>
        scf.yield %arg3 : i32
      }
      memref.tensor_store %15, %alloc_17 : memref<16x11x14xf32>
      scf.index_switch %c7 
      case 1 {
        %288 = math.log1p %cst_0 : f32
        %289 = affine.load %alloc_16[%c9, %c8] : memref<14x14xf16>
        %290 = index.ceildivs %c15, %c5
        %291 = math.cos %cst_2 : f16
        %292 = vector.extract %19[4] : vector<13xf16>
        %293 = math.atan %cst_0 : f32
        %294 = math.atan %15 : tensor<16x11x14xf32>
        %cst_37 = arith.constant 0x4E4C1429 : f32
        %295 = vector.broadcast %c5 : index to vector<13xindex>
        %296 = vector.broadcast %true : i1 to vector<13xi1>
        %297 = vector.broadcast %cst_0 : f32 to vector<13xf32>
        vector.scatter %alloc_6[%c8, %c2] [%295], %296, %297 : memref<16x11xf32>, vector<13xindex>, vector<13xi1>, vector<13xf32>
        %298 = vector.broadcast %true : i1 to vector<11xi1>
        %dest_38, %accumulated_value_39 = vector.scan <or>, %26, %298 {inclusive = true, reduction_dim = 0 : i64} : vector<16x11xi1>, vector<11xi1>
        %cst_40 = arith.constant 1.000000e+00 : f32
        %cst_41 = arith.constant 0.000000e+00 : f32
        %299 = vector.transfer_read %12[%c0, %rank], %cst_41 : tensor<16x14xf32>, vector<f32>
        %300 = arith.addf %cst, %cst_2 : f16
        %301 = vector.insertelement %cst_2, %19[%c7 : index] : vector<13xf16>
        %302 = arith.cmpf ord, %cst_0, %cst_40 : f32
        %303 = math.absf %289 : f16
        %304 = index.sizeof
        scf.yield
      }
      case 2 {
        %288 = arith.shli %c766674261_i32, %c644607405_i32 : i32
        %289 = vector.load %34[%c3, %c1] : memref<16x11xi1>, vector<16x14xi1>
        %290 = affine.max affine_map<(d0, d1, d2, d3) -> (d3 * 4)>(%c8, %c8, %c5, %30)
        %291 = arith.addf %cst, %cst : f16
        %292 = arith.shrsi %c1313612593_i64, %c614314845_i64 : i64
        %293 = arith.shli %c614314845_i64, %c614314845_i64 : i64
        %false_37 = arith.constant false
        %294 = vector.transfer_read %alloc_20[%c11], %false_37 : memref<14xi1>, vector<i1>
        %295 = index.sizeof
        %296 = math.fpowi %7, %11 : tensor<16x11xf16>, tensor<16x11xi32>
        %297 = index.ceildivs %c14, %c11
        %298 = bufferization.to_memref %15 : memref<16x11x14xf32>
        %299 = affine.apply affine_map<(d0, d1, d2, d3) -> (d0)>(%c3, %c13, %c13, %rank)
        %300 = math.ctpop %c1313612593_i64 : i64
        %301 = affine.max affine_map<(d0, d1, d2, d3) -> (d3 * 8, -d0, d3 + 8, d0 * 32)>(%c14, %c6, %c0, %c0)
        %302 = vector.broadcast %false : i1 to vector<16xi1>
        %dest_38, %accumulated_value_39 = vector.scan <minsi>, %289, %302 {inclusive = false, reduction_dim = 1 : i64} : vector<16x14xi1>, vector<16xi1>
        %303 = index.ceildivu %c15, %c12
        scf.yield
      }
      case 3 {
        %288 = arith.mulf %cst_2, %cst_2 : f16
        %289 = vector.reduction <mul>, %19 : vector<13xf16> into f16
        %290 = vector.broadcast %c18917_i16 : i16 to vector<16xi16>
        %291 = vector.broadcast %true : i1 to vector<16xi1>
        %292 = vector.maskedload %alloc_14[%c6, %c2], %291, %290 : memref<16x11xi16>, vector<16xi1>, vector<16xi16> into vector<16xi16>
        %293 = tensor.empty() : tensor<16x14xi1>
        %294 = linalg.matmul ins(%10, %27 : tensor<16x14xi1>, tensor<14x14xi1>) outs(%293 : tensor<16x14xi1>) -> tensor<16x14xi1>
        %295 = vector.broadcast %cst_0 : f32 to vector<13xf32>
        vector.transfer_write %295, %33[%c8, %c12] {permutation_map = affine_map<(d0, d1) -> (d0)>} : vector<13xf32>, memref<16x14xf32>
        %alloc_37 = memref.alloc() : memref<i1>
        memref.tensor_store %21, %alloc_37 : memref<i1>
        %alloc_38 = memref.alloc() : memref<11x16xi64>
        %296 = tensor.empty() : tensor<16x16xi64>
        %297 = linalg.matmul ins(%13, %alloc_38 : tensor<16x11xi64>, memref<11x16xi64>) outs(%296 : tensor<16x16xi64>) -> tensor<16x16xi64>
        %298 = math.cos %5 : tensor<16x14xf16>
        %299 = bufferization.clone %alloc_20 : memref<14xi1> to memref<14xi1>
        %alloc_39 = memref.alloc() : memref<11x14xi32>
        %300 = tensor.empty() : tensor<16x14xi32>
        %301 = linalg.matmul ins(%11, %alloc_39 : tensor<16x11xi32>, memref<11x14xi32>) outs(%300 : tensor<16x14xi32>) -> tensor<16x14xi32>
        %302 = arith.mulf %cst_0, %cst_0 : f32
        %303 = math.tanh %14 : tensor<14x14xf16>
        %304 = arith.shli %c766674261_i32, %c644607405_i32 : i32
        %305 = vector.extract_strided_slice %291 {offsets = [4], sizes = [1], strides = [1]} : vector<16xi1> to vector<1xi1>
        %306 = memref.atomic_rmw mulf %cst_0, %alloc_7[%c1, %c11] : (f32, memref<16x14xf32>) -> f32
        %307 = vector.broadcast %false : i1 to vector<11x11xi1>
        %308 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = ["parallel", "parallel", "reduction"], kind = #vector.kind<maxsi>} %26, %26, %307 : vector<16x11xi1>, vector<16x11xi1> into vector<11x11xi1>
        scf.yield
      }
      case 4 {
        %288 = affine.max affine_map<(d0, d1) -> (d0 * -3)>(%rank, %c13)
        %289 = index.add %c13, %c11
        memref.store %cst_0, %alloc_6[%c3, %c4] : memref<16x11xf32>
        %290 = arith.minui %c1199270634_i64, %c1508905138_i64 : i64
        %291 = math.rsqrt %5 : tensor<16x14xf16>
        %292 = arith.shrsi %c644607405_i32, %c766674261_i32 : i32
        %rank_37 = tensor.rank %4 : tensor<16x14xi16>
        %293 = arith.cmpf uno, %cst_0, %cst_0 : f32
        %294 = arith.minui %c766674261_i32, %c928860611_i32 : i32
        %295 = index.divs %c0, %c9
        %296 = index.ceildivu %c5, %c14
        %297 = vector.broadcast %c0 : index to vector<13xindex>
        %298 = vector.broadcast %false : i1 to vector<13xi1>
        %299 = vector.broadcast %c1581681977_i32 : i32 to vector<13xi32>
        vector.scatter %alloc_15[%c5, %c5] [%297], %298, %299 : memref<16x11xi32>, vector<13xindex>, vector<13xi1>, vector<13xi32>
        %300 = arith.minui %c-23065_i16, %c-23065_i16 : i16
        %301 = math.sqrt %cst_2 : f16
        %302 = index.ceildivs %c7, %c6
        %303 = vector.flat_transpose %19 {columns = 13 : i32, rows = 1 : i32} : vector<13xf16> -> vector<13xf16>
        scf.yield
      }
      default {
        %288 = math.ctpop %6 : tensor<16x11x14xi16>
        %289 = index.castu %30 : index to i32
        %cst_37 = arith.constant 1.000000e+00 : f16
        %cst_38 = arith.constant 0.000000e+00 : f16
        %290 = vector.transfer_read %16[%c11, %c1], %cst_38 : tensor<16x14xf16>, vector<f16>
        %291 = index.ceildivs %c0, %c8
        %292 = math.ctpop %4 : tensor<16x14xi16>
        %293 = arith.subi %c1313612593_i64, %c1508905138_i64 : i64
        %294 = index.casts %c12 : index to i32
        %295 = index.casts %c1581681977_i32 : i32 to index
        %296 = math.absf %7 : tensor<16x11xf16>
        %297 = math.ctpop %true_1 : i1
        %298 = memref.atomic_rmw maxu %c18917_i16, %alloc_14[%c7, %c6] : (i16, memref<16x11xi16>) -> i16
        %299 = arith.addi %c18917_i16, %c18917_i16 : i16
        %300 = math.log1p %cst_0 : f32
        %301 = index.sizeof
        %302 = vector.shuffle %19, %19 [2, 7, 8, 10, 11, 13, 16, 19, 20, 21, 22, 23] : vector<13xf16>, vector<13xf16>
        %303 = index.casts %c18917_i16 : i16 to index
      }
      %285 = index.divs %c12, %c14
      %286 = affine.max affine_map<(d0, d1, d2) -> (d2 mod 8 + d2 - d2 floordiv 8, -(d1 - d0), (d1 - d0) ceildiv 8)>(%285, %rank, %c7)
      %true_36 = index.bool.constant true
      %287 = arith.maxui %c18917_i16, %c18917_i16 : i16
      affine.yield %c1199270634_i64 : i64
    } else {
      %283 = arith.andi %c-23065_i16, %c-23065_i16 : i16
      %284 = scf.if %true_1 -> (memref<16x11xf16>) {
        %291 = vector.insertelement %cst, %19[%c9 : index] : vector<13xf16>
        %292 = index.add %c5, %c4
        %alloc_36 = memref.alloc() : memref<11x13xf16>
        %293 = tensor.empty() : tensor<16x13xf16>
        %294 = linalg.matmul ins(%7, %alloc_36 : tensor<16x11xf16>, memref<11x13xf16>) outs(%293 : tensor<16x13xf16>) -> tensor<16x13xf16>
        %295 = bufferization.clone %alloc_14 : memref<16x11xi16> to memref<16x11xi16>
        %296 = arith.andi %c1581681977_i32, %c1581681977_i32 : i32
        bufferization.dealloc_tensor %10 : tensor<16x14xi1>
        %297 = index.sizeof
        %298 = vector.bitcast %19 : vector<13xf16> to vector<13xf16>
        %alloc_37 = memref.alloc() : memref<16x11xf16>
        scf.yield %alloc_37 : memref<16x11xf16>
      } else {
        %291 = math.log %7 : tensor<16x11xf16>
        %292 = bufferization.clone %alloc_19 : memref<14xi1> to memref<14xi1>
        %293 = arith.divsi %c1508905138_i64, %c614314845_i64 : i64
        %294 = vector.broadcast %cst_2 : f16 to vector<13x13xf16>
        %295 = vector.outerproduct %19, %19, %294 {kind = #vector.kind<add>} : vector<13xf16>, vector<13xf16>
        %296 = index.casts %c-23065_i16 : i16 to index
        %297 = arith.divsi %true, %true : i1
        bufferization.dealloc_tensor %3 : tensor<16x14xi64>
        %298 = math.round %2 : tensor<16x11xf32>
        %alloc_36 = memref.alloc() : memref<16x11xf16>
        scf.yield %alloc_36 : memref<16x11xf16>
      }
      %285 = arith.divf %cst_2, %cst_2 : f16
      %286 = tensor.empty() : tensor<14x14xi32>
      %287 = math.fpowi %14, %286 : tensor<14x14xf16>, tensor<14x14xi32>
      %288 = math.round %5 : tensor<16x14xf16>
      %289 = math.round %2 : tensor<16x11xf32>
      %alloca = memref.alloca() : memref<16x11xi64>
      %290 = arith.divsi %c1508905138_i64, %c1199270634_i64 : i64
      affine.yield %c1199270634_i64 : i64
    }
    %38 = vector.broadcast %cst_0 : f32 to vector<16x14xf32>
    %39 = vector.fma %38, %38, %38 : vector<16x14xf32>
    %40 = math.tan %15 : tensor<16x11x14xf32>
    memref.assume_alignment %alloc_18, 8 : memref<14x16xf16>
    %41 = arith.divf %cst, %cst_2 : f16
    %42 = math.exp %2 : tensor<16x11xf32>
    vector.print %19 : vector<13xf16>
    %43 = math.atan %17 : tensor<16x14xf16>
    %44 = scf.while (%arg3 = %alloc_19) : (memref<14xi1>) -> memref<14xi1> {
      %283 = vector.insertelement %cst, %19[%rank : index] : vector<13xf16>
      memref.assume_alignment %alloc_11, 4 : memref<16x11xi1>
      %284 = vector.extract_strided_slice %38 {offsets = [9], sizes = [2], strides = [1]} : vector<16x14xf32> to vector<2x14xf32>
      %285 = bufferization.clone %arg3 : memref<14xi1> to memref<14xi1>
      %286 = scf.while (%arg4 = %cst_2) : (f16) -> f16 {
        %290 = vector.extract_strided_slice %26 {offsets = [8], sizes = [4], strides = [1]} : vector<16x11xi1> to vector<4x11xi1>
        %291 = arith.maxui %c1313612593_i64, %c1313612593_i64 : i64
        %292 = memref.atomic_rmw addi %c-23065_i16, %alloc_14[%c13, %c0] : (i16, memref<16x11xi16>) -> i16
        %293 = math.atan2 %17, %16 : tensor<16x14xf16>
        %alloc_38 = memref.alloc() : memref<16x14xi1>
        memref.tensor_store %10, %alloc_38 : memref<16x14xi1>
        %294 = arith.shrsi %c18917_i16, %c-23065_i16 : i16
        %295 = bufferization.clone %alloc_12 : memref<16x14xi32> to memref<16x14xi32>
        %296 = math.sqrt %15 : tensor<16x11x14xf32>
        scf.condition(%true) %cst_2 : f16
      } do {
      ^bb0(%arg4: f16):
        %290 = bufferization.to_tensor %alloc_16 : memref<14x14xf16>
        %rank_38 = tensor.rank %8 : tensor<16x14xi1>
        %291 = math.expm1 %14 : tensor<14x14xf16>
        %292 = vector.insertelement %arg4, %19[%c0 : index] : vector<13xf16>
        %293 = math.round %cst_2 : f16
        %294 = math.rsqrt %12 : tensor<16x14xf32>
        %295 = vector.broadcast %c2 : index to vector<11xindex>
        %296 = vector.broadcast %true_1 : i1 to vector<11xi1>
        vector.scatter %alloc_8[%c5, %c7] [%295], %296, %296 : memref<14x14xi1>, vector<11xindex>, vector<11xi1>, vector<11xi1>
        %297 = tensor.empty() : tensor<16x11x14xf32>
        %298 = math.tan %12 : tensor<16x14xf32>
        bufferization.dealloc_tensor %11 : tensor<16x11xi32>
        %299 = arith.shli %c1313612593_i64, %c614314845_i64 : i64
        %300 = vector.broadcast %c644607405_i32 : i32 to vector<14xi32>
        %301 = vector.broadcast %false : i1 to vector<14xi1>
        %302 = vector.maskedload %alloc_12[%c11, %c6], %301, %300 : memref<16x14xi32>, vector<14xi1>, vector<14xi32> into vector<14xi32>
        %303 = index.add %c8, %c9
        %304 = math.cttz %c928860611_i32 : i32
        %305 = bufferization.clone %alloc_4 : memref<16x14xf16> to memref<16x14xf16>
        %306 = index.casts %303 : index to i32
        scf.yield %cst : f16
      }
      %287 = vector.broadcast %cst_0 : f32 to vector<16xf32>
      %dest_36, %accumulated_value_37 = vector.scan <maxf>, %39, %287 {inclusive = true, reduction_dim = 1 : i64} : vector<16x14xf32>, vector<16xf32>
      %288 = math.exp2 %15 : tensor<16x11x14xf32>
      %289 = scf.index_switch %c15 -> index 
      case 1 {
        %290 = arith.addi %c18917_i16, %c18917_i16 : i16
        %291 = arith.cmpi sle, %true_1, %true : i1
        %292 = math.sqrt %2 : tensor<16x11xf32>
        %293 = arith.cmpi ugt, %c644607405_i32, %c928860611_i32 : i32
        %294 = math.tanh %7 : tensor<16x11xf16>
        %295 = vector.extract_strided_slice %38 {offsets = [0], sizes = [3], strides = [1]} : vector<16x14xf32> to vector<3x14xf32>
        %296 = vector.broadcast %cst_0 : f32 to vector<14x14xf32>
        %297 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = ["parallel", "parallel", "reduction"], kind = #vector.kind<mul>} %38, %39, %296 : vector<16x14xf32>, vector<16x14xf32> into vector<14x14xf32>
        %298 = arith.andi %c1199270634_i64, %c1508905138_i64 : i64
        %299 = math.cttz %c1508905138_i64 : i64
        %300 = arith.divsi %c928860611_i32, %c644607405_i32 : i32
        %301 = math.cos %cst_2 : f16
        %302 = math.log2 %2 : tensor<16x11xf32>
        %303 = vector.broadcast %true : i1 to vector<13xi1>
        %304 = vector.maskedload %alloc_19[%c11], %303, %303 : memref<14xi1>, vector<13xi1>, vector<13xi1> into vector<13xi1>
        %305 = math.roundeven %15 : tensor<16x11x14xf32>
        %306 = math.ipowi %3, %3 : tensor<16x14xi64>
        %307 = bufferization.to_memref %5 : memref<16x14xf16>
        scf.yield %c0 : index
      }
      default {
        %290 = math.expm1 %cst_2 : f16
        %291 = vector.create_mask %c3, %c5 : vector<16x14xi1>
        bufferization.dealloc_tensor %3 : tensor<16x14xi64>
        %292 = arith.maxui %true_1, %false : i1
        bufferization.dealloc_tensor %11 : tensor<16x11xi32>
        %293 = affine.load %alloc_4[%c7, %c13] : memref<16x14xf16>
        %294 = bufferization.to_tensor %alloc_17 : memref<16x11x14xf32>
        %295 = affine.load %alloc_13[%c9, %c3] : memref<14x14xi1>
        %splat = tensor.splat %cst : tensor<16x11xf16>
        %296 = index.ceildivu %c15, %c7
        %297 = math.log %294 : tensor<16x11x14xf32>
        %298 = memref.load %alloc_19[%c13] : memref<14xi1>
        %299 = math.log10 %2 : tensor<16x11xf32>
        %300 = math.ipowi %21, %21 : tensor<i1>
        affine.store %c644607405_i32, %alloc_10[%c14, %c14] : memref<14x14xi32>
        %301 = vector.broadcast %293 : f16 to vector<13x13xf16>
        %302 = vector.outerproduct %19, %19, %301 {kind = #vector.kind<add>} : vector<13xf16>, vector<13xf16>
        scf.yield %c8 : index
      }
      scf.condition(%true_1) %alloc_20 : memref<14xi1>
    } do {
    ^bb0(%arg3: memref<14xi1>):
      %283 = affine.apply affine_map<(d0, d1) -> (d0 floordiv 32 - d0)>(%c7, %c1)
      %284 = vector.create_mask %c0, %283, %c10 : vector<16x11x14xi1>
      %285 = arith.addf %cst_2, %cst_2 : f16
      %286 = scf.if %true -> (memref<16x11x14xi1>) {
        %300 = math.copysign %12, %12 : tensor<16x14xf32>
        %301 = vector.bitcast %39 : vector<16x14xf32> to vector<16x14xf32>
        %302 = vector.shuffle %301, %301 [0, 3, 4, 6, 7, 8, 11, 12, 13, 15, 19, 20, 21, 24, 29, 31] : vector<16x14xf32>, vector<16x14xf32>
        %303 = index.maxs %c10, %30
        %304 = affine.apply affine_map<(d0, d1, d2, d3) -> (-((d3 * 2) mod 4))>(%c4, %c3, %30, %rank)
        %305 = math.rsqrt %15 : tensor<16x11x14xf32>
        %306 = math.roundeven %cst_0 : f32
        %307 = math.sqrt %7 : tensor<16x11xf16>
        %alloc_40 = memref.alloc() : memref<16x11x14xi1>
        scf.yield %alloc_40 : memref<16x11x14xi1>
      } else {
        %alloca = memref.alloca() : memref<16x11x14xi1>
        %300 = math.ctlz %0 : tensor<16x14xi1>
        %from_elements_40 = tensor.from_elements %cst_2, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst, %cst, %cst, %cst, %cst_2, %cst, %cst_2, %cst, %cst, %cst, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst, %cst, %cst_2, %cst_2, %cst_2, %cst, %cst, %cst_2, %cst, %cst_2, %cst, %cst, %cst, %cst, %cst, %cst, %cst, %cst, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst_2, %cst, %cst, %cst_2, %cst, %cst, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst, %cst, %cst, %cst, %cst_2, %cst, %cst, %cst_2, %cst_2, %cst_2, %cst, %cst_2, %cst_2, %cst, %cst, %cst_2, %cst_2, %cst, %cst, %cst, %cst, %cst, %cst, %cst, %cst, %cst, %cst, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst, %cst_2, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst, %cst, %cst, %cst_2, %cst, %cst_2, %cst_2, %cst_2, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst_2, %cst, %cst, %cst, %cst, %cst, %cst, %cst_2, %cst, %cst_2, %cst, %cst_2, %cst, %cst, %cst, %cst_2, %cst, %cst, %cst_2, %cst_2, %cst_2, %cst, %cst, %cst_2, %cst_2, %cst, %cst_2, %cst, %cst, %cst_2, %cst, %cst, %cst_2, %cst_2, %cst, %cst_2, %cst_2, %cst_2, %cst, %cst, %cst, %cst, %cst_2 : tensor<14x14xf16>
        %301 = vector.matrix_multiply %19, %19 {lhs_columns = 13 : i32, lhs_rows = 1 : i32, rhs_columns = 1 : i32} : (vector<13xf16>, vector<13xf16>) -> vector<1xf16>
        %c0_i64 = arith.constant 0 : i64
        %c0_i64_41 = arith.constant 0 : i64
        %302 = vector.transfer_read %13[%c3, %c11], %c0_i64_41 {permutation_map = affine_map<(d0, d1) -> (0)>} : tensor<16x11xi64>, vector<11xi64>
        %303 = vector.broadcast %c0_i64 : i64 to vector<16x14xi64>
        %304 = index.ceildivs %30, %283
        %305 = affine.apply affine_map<(d0, d1, d2, d3) -> (-((d3 * 2) mod 4))>(%c1, %c0, %c6, %rank)
        %alloc_42 = memref.alloc() : memref<16x11x14xi1>
        scf.yield %alloc_42 : memref<16x11x14xi1>
      }
      %287 = vector.broadcast %false : i1 to vector<11x11xi1>
      %288 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = ["parallel", "parallel", "reduction"], kind = #vector.kind<minui>} %26, %26, %287 : vector<16x11xi1>, vector<16x11xi1> into vector<11x11xi1>
      %alloc_36 = memref.alloc() : memref<16x11xi64>
      %289 = vector.broadcast %c1508905138_i64 : i64 to vector<16x11x14xi64>
      %290 = vector.broadcast %c644607405_i32 : i32 to vector<16x11x14xi32>
      %291 = vector.gather %alloc_36[%c10, %c12] [%290], %284, %289 : memref<16x11xi64>, vector<16x11x14xi32>, vector<16x11x14xi1>, vector<16x11x14xi64> into vector<16x11x14xi64>
      %292 = memref.load %alloc_4[%c14, %c11] : memref<16x14xf16>
      %293 = math.atan2 %16, %5 : tensor<16x14xf16>
      %294 = affine.apply affine_map<(d0, d1, d2, d3) -> (d0)>(%c15, %c2, %c14, %c3)
      %true_37 = index.bool.constant true
      %splat = tensor.splat %c1581681977_i32 : tensor<16x14xi32>
      %295 = vector.broadcast %true : i1 to vector<11x14xi1>
      %dest_38, %accumulated_value_39 = vector.scan <add>, %284, %295 {inclusive = true, reduction_dim = 0 : i64} : vector<16x11x14xi1>, vector<11x14xi1>
      %296 = math.log %16 : tensor<16x14xf16>
      %297 = vector.splat %c9 : vector<14x14xindex>
      %298 = vector.extract_strided_slice %289 {offsets = [2, 1], sizes = [12, 10], strides = [1, 1]} : vector<16x11x14xi64> to vector<12x10x14xi64>
      %299 = math.cttz %splat : tensor<16x14xi32>
      scf.yield %alloc_20 : memref<14xi1>
    }
    %45 = math.roundeven %cst_2 : f16
    %46 = math.expm1 %7 : tensor<16x11xf16>
    affine.for %arg3 = 0 to 75 {
    }
    %47 = arith.cmpf false, %cst, %cst : f16
    %48 = math.copysign %5, %16 : tensor<16x14xf16>
    %49 = vector.insertelement %cst, %19[%c2 : index] : vector<13xf16>
    memref.tensor_store %9, %34 : memref<16x11xi1>
    %50 = vector.insertelement %cst_2, %19[%c3 : index] : vector<13xf16>
    %51 = math.round %cst_0 : f32
    %52 = affine.if affine_set<(d0) : (d0 == 0)>(%c8) -> i1 {
      %283 = affine.apply affine_map<(d0, d1) -> (-(d1 floordiv 8) + 2)>(%c15, %c5)
      %284 = bufferization.clone %alloc : memref<16x14xf32> to memref<16x14xf32>
      %285 = math.sqrt %14 : tensor<14x14xf16>
      %286 = vector.broadcast %false : i1 to vector<11xi1>
      %287 = vector.maskedload %alloc_8[%c10, %c5], %286, %286 : memref<14x14xi1>, vector<11xi1>, vector<11xi1> into vector<11xi1>
      %288 = vector.create_mask %c3, %c1 : vector<16x11xi1>
      %289 = affine.if affine_set<(d0) : (d0 == 0)>(%c14) -> memref<14x14xf16> {
        %291 = arith.addi %c1199270634_i64, %c1199270634_i64 : i64
        %292 = index.add %c5, %c7
        %293 = index.floordivs %c4, %30
        %294 = index.maxu %30, %c1
        %295 = index.maxs %c0, %c9
        %296 = tensor.empty() : tensor<16x11xi16>
        %297 = vector.broadcast %c12 : index to vector<11xindex>
        %298 = vector.broadcast %cst_0 : f32 to vector<11xf32>
        vector.scatter %alloc[%c3, %c0] [%297], %286, %298 : memref<16x14xf32>, vector<11xindex>, vector<11xi1>, vector<11xf32>
        %299 = arith.floordivsi %c766674261_i32, %c644607405_i32 : i32
        affine.yield %alloc_16 : memref<14x14xf16>
      } else {
        %291 = arith.shli %c1313612593_i64, %c614314845_i64 : i64
        %true_36 = arith.constant true
        %292 = arith.shrui %c1313612593_i64, %c1313612593_i64 : i64
        %293 = math.cos %7 : tensor<16x11xf16>
        %294 = affine.max affine_map<(d0) -> (((d0 mod 4) mod 32) * 4, d0 floordiv 8 - (d0 - 64) + d0 mod 64 - 8, d0 - 64)>(%c0)
        %295 = math.roundeven %14 : tensor<14x14xf16>
        %296 = index.maxu %c1, %rank
        %297 = bufferization.clone %alloc_20 : memref<14xi1> to memref<14xi1>
        affine.yield %alloc_16 : memref<14x14xf16>
      }
      %290 = arith.remui %c1199270634_i64, %c614314845_i64 : i64
      bufferization.dealloc_tensor %12 : tensor<16x14xf32>
      affine.yield %true : i1
    } else {
      %283 = math.copysign %7, %7 : tensor<16x11xf16>
      %284 = arith.negf %cst_0 : f32
      %285 = arith.minsi %c-23065_i16, %c-23065_i16 : i16
      %286 = bufferization.clone %alloc_5 : memref<16x11x14xf16> to memref<16x11x14xf16>
      %287 = arith.maxsi %c1313612593_i64, %c1313612593_i64 : i64
      %288 = math.sqrt %cst : f16
      %289 = vector.insertelement %cst, %19[%c4 : index] : vector<13xf16>
      %290 = math.roundeven %7 : tensor<16x11xf16>
      affine.yield %true_1 : i1
    }
    %53 = vector.broadcast %cst : f16 to vector<13x13xf16>
    %54 = vector.outerproduct %19, %19, %53 {kind = #vector.kind<add>} : vector<13xf16>, vector<13xf16>
    %55 = arith.shrui %c614314845_i64, %c1508905138_i64 : i64
    %56 = index.sizeof
    %57 = scf.while (%arg3 = %alloc_4) : (memref<16x14xf16>) -> memref<16x14xf16> {
      %283 = vector.broadcast %cst_0 : f32 to vector<14xf32>
      %dest_36, %accumulated_value_37 = vector.scan <mul>, %39, %283 {inclusive = false, reduction_dim = 0 : i64} : vector<16x14xf32>, vector<14xf32>
      %284 = math.tanh %12 : tensor<16x14xf32>
      %285 = vector.transpose %26, [0, 1] : vector<16x11xi1> to vector<16x11xi1>
      %286 = arith.divf %cst, %cst_2 : f16
      %287 = arith.remf %cst_2, %cst : f16
      %288 = vector.broadcast %false : i1 to vector<11xi1>
      %289 = vector.maskedload %alloc_11[%c11, %c5], %288, %288 : memref<16x11xi1>, vector<11xi1>, vector<11xi1> into vector<11xi1>
      %alloca = memref.alloca() : memref<16x14xi1>
      %290 = arith.cmpf ord, %cst_0, %cst_0 : f32
      scf.condition(%true_1) %arg3 : memref<16x14xf16>
    } do {
    ^bb0(%arg3: memref<16x14xf16>):
      memref.alloca_scope  {
        %297 = vector.insert %cst_2, %19 [11] : f16 into vector<13xf16>
        %298 = index.sub %c12, %c2
        %alloca = memref.alloca() : memref<16x14xf16>
        %true_37 = index.bool.constant true
        %299 = vector.transpose %19, [0] : vector<13xf16> to vector<13xf16>
        %300 = math.ctlz %10 : tensor<16x14xi1>
        %301 = bufferization.clone %33 : memref<16x14xf32> to memref<16x14xf32>
        %302 = memref.atomic_rmw assign %cst_2, %arg3[%c8, %c5] : (f16, memref<16x14xf16>) -> f16
        %303 = affine.apply affine_map<(d0, d1, d2) -> (d0 * 8)>(%298, %c11, %c15)
        %304 = vector.splat %c644607405_i32 : vector<16x11x14xi32>
        %305 = arith.ceildivsi %c1508905138_i64, %c1199270634_i64 : i64
        %306 = arith.divf %cst, %cst : f16
        %307 = index.casts %c1 : index to i32
        %308 = arith.mulf %cst_0, %cst_0 : f32
        %inserted_38 = tensor.insert %cst_0 into %15[%c10, %c5, %c6] : tensor<16x11x14xf32>
        %309 = math.ipowi %false, %true : i1
        bufferization.dealloc_tensor %4 : tensor<16x14xi16>
        %310 = vector.bitcast %26 : vector<16x11xi1> to vector<16x11xi1>
        %false_39 = index.bool.constant false
        %311 = arith.divf %cst_2, %cst_2 : f16
        %312 = arith.maxui %false, %true_37 : i1
        %313 = index.add %c6, %c14
        %314 = bufferization.clone %alloc_20 : memref<14xi1> to memref<14xi1>
        %315 = memref.atomic_rmw minf %cst_2, %alloc_16[%c6, %c13] : (f16, memref<14x14xf16>) -> f16
        %316 = arith.floordivsi %true_37, %false_39 : i1
        %317 = index.ceildivs %c10, %30
        %318 = index.floordivs %c9, %303
        %319 = math.floor %7 : tensor<16x11xf16>
        %extracted_40 = tensor.extract %17[%c7, %c10] : tensor<16x14xf16>
        %extracted_41 = tensor.extract %16[%c11, %c6] : tensor<16x14xf16>
        %320 = math.ctpop %c1508905138_i64 : i64
        %321 = math.log2 %15 : tensor<16x11x14xf32>
      }
      affine.store %c1581681977_i32, %alloc_15[%c13, %c14] : memref<16x11xi32>
      %expanded_36 = tensor.expand_shape %13 [[0], [1, 2]] : tensor<16x11xi64> into tensor<16x11x1xi64>
      %283 = index.ceildivs %c2, %c8
      %284 = vector.broadcast %c15 : index to vector<16xindex>
      %285 = vector.broadcast %true : i1 to vector<16xi1>
      %286 = vector.broadcast %c928860611_i32 : i32 to vector<16xi32>
      vector.scatter %alloc_15[%c13, %c4] [%284], %285, %286 : memref<16x11xi32>, vector<16xindex>, vector<16xi1>, vector<16xi32>
      %287 = arith.addf %cst, %cst_2 : f16
      %extracted = tensor.extract %3[%c14, %c12] : tensor<16x14xi64>
      %288 = index.ceildivu %c11, %30
      %289 = vector.shuffle %39, %38 [0, 1, 4, 6, 7, 9, 10, 12, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28] : vector<16x14xf32>, vector<16x14xf32>
      %290 = vector.shuffle %38, %38 [0, 1, 2, 5, 7, 8, 9, 10, 11, 13, 18, 20, 21, 22, 26, 28, 29, 30, 31] : vector<16x14xf32>, vector<16x14xf32>
      %291 = vector.broadcast %extracted : i64 to vector<14x14xi64>
      %292 = math.sqrt %12 : tensor<16x14xf32>
      %293 = vector.contract {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> ()>], iterator_types = ["reduction"], kind = #vector.kind<mul>} %19, %19, %cst : vector<13xf16>, vector<13xf16> into f16
      %294 = affine.apply affine_map<(d0, d1, d2) -> (d0 * 8)>(%c8, %c13, %283)
      %295 = math.ipowi %c1313612593_i64, %c1199270634_i64 : i64
      %296 = math.cttz %c1508905138_i64 : i64
      scf.yield %alloc_4 : memref<16x14xf16>
    }
    %rank_21 = tensor.rank %27 : tensor<14x14xi1>
    %58 = arith.remui %c1581681977_i32, %c1581681977_i32 : i32
    %59 = index.add %rank, %c8
    %60 = arith.ceildivsi %c928860611_i32, %c1581681977_i32 : i32
    %61 = memref.realloc %alloc_20 : memref<14xi1> to memref<14xi1>
    %62 = affine.apply affine_map<(d0, d1) -> (-(d1 floordiv 8) + 2)>(%c7, %59)
    %63 = math.log %2 : tensor<16x11xf32>
    %64 = vector.broadcast %c11 : index to vector<13xindex>
    %65 = vector.broadcast %false : i1 to vector<13xi1>
    vector.scatter %alloc_19[%c13] [%64], %65, %65 : memref<14xi1>, vector<13xindex>, vector<13xi1>, vector<13xi1>
    %generated = tensor.generate %56, %c1 {
    ^bb0(%arg3: index, %arg4: index):
      %283 = memref.realloc %alloc_19 : memref<14xi1> to memref<16xi1>
      %284 = vector.transpose %26, [0, 1] : vector<16x11xi1> to vector<16x11xi1>
      %inserted_36 = tensor.insert %cst_0 into %2[%c13, %c9] : tensor<16x11xf32>
      %285 = arith.cmpf oeq, %cst, %cst : f16
      tensor.yield %c1581681977_i32 : i32
    } : tensor<?x?xi32>
    %66 = vector.broadcast %cst_0 : f32 to vector<16xf32>
    %67 = vector.multi_reduction <maxf>, %38, %66 [1] : vector<16x14xf32> to vector<16xf32>
    %68 = index.maxu %c8, %c12
    %69 = bufferization.clone %alloc_10 : memref<14x14xi32> to memref<14x14xi32>
    %70 = vector.extract_strided_slice %66 {offsets = [5], sizes = [6], strides = [1]} : vector<16xf32> to vector<6xf32>
    %71 = scf.index_switch %68 -> memref<16x11x14xf32> 
    case 1 {
      %inserted_36 = tensor.insert %cst into %17[%c5, %c5] : tensor<16x14xf16>
      %alloc_37 = memref.alloc() : memref<11x16xf32>
      %283 = tensor.empty() : tensor<16x16xf32>
      %284 = linalg.matmul ins(%2, %alloc_37 : tensor<16x11xf32>, memref<11x16xf32>) outs(%283 : tensor<16x16xf32>) -> tensor<16x16xf32>
      affine.store %cst_0, %alloc_17[%c9, %c1, %c10] : memref<16x11x14xf32>
      %285 = vector.shuffle %19, %19 [3, 4, 10, 11, 13, 16, 20, 21] : vector<13xf16>, vector<13xf16>
      %286 = arith.remf %cst_0, %cst_0 : f32
      %287 = math.rsqrt %2 : tensor<16x11xf32>
      %288 = arith.remf %cst_2, %cst_2 : f16
      %289 = vector.broadcast %false : i1 to vector<16x11xi1>
      %290 = arith.divsi %c-23065_i16, %c18917_i16 : i16
      %291 = arith.maxf %cst_0, %cst_0 : f32
      %292 = arith.xori %c1199270634_i64, %c1199270634_i64 : i64
      affine.store %cst_2, %alloc_5[%c15, %c6, %c8] : memref<16x11x14xf16>
      %293 = math.sqrt %14 : tensor<14x14xf16>
      %294 = math.cos %7 : tensor<16x11xf16>
      %inserted_38 = tensor.insert %cst_2 into %5[%c15, %c13] : tensor<16x14xf16>
      memref.assume_alignment %alloc, 4 : memref<16x14xf32>
      scf.yield %alloc_17 : memref<16x11x14xf32>
    }
    case 2 {
      %283 = arith.maxui %false, %false : i1
      %284 = vector.splat %c18917_i16 : vector<16x14xi16>
      %285 = scf.while (%arg3 = %true_1) : (i1) -> i1 {
        %296 = math.round %5 : tensor<16x14xf16>
        %297 = math.fma %5, %5, %5 : tensor<16x14xf16>
        %inserted_40 = tensor.insert %c1313612593_i64 into %13[%c12, %c4] : tensor<16x11xi64>
        %298 = vector.bitcast %19 : vector<13xf16> to vector<13xi16>
        %299 = math.round %17 : tensor<16x14xf16>
        %300 = affine.max affine_map<(d0, d1, d2, d3) -> (d0 ceildiv 64, d3 ceildiv 8, d0 ceildiv 64 + 128)>(%c11, %c14, %c13, %c14)
        %301 = vector.transpose %39, [0, 1] : vector<16x14xf32> to vector<16x14xf32>
        bufferization.dealloc_tensor %4 : tensor<16x14xi16>
        scf.condition(%arg3) %true : i1
      } do {
      ^bb0(%arg3: i1):
        %296 = vector.broadcast %cst_0 : f32 to vector<14x14xf32>
        %297 = math.sqrt %2 : tensor<16x11xf32>
        %298 = vector.bitcast %296 : vector<14x14xf32> to vector<14x14xf32>
        %299 = vector.broadcast %c18917_i16 : i16 to vector<16x14xi16>
        %300 = math.atan2 %12, %12 : tensor<16x14xf32>
        vector.print %19 : vector<13xf16>
        %301 = index.sub %rank, %c11
        %302 = tensor.empty() : tensor<14x14xf32>
        %303 = tensor.empty() : tensor<16x14xf32>
        %304 = linalg.matmul ins(%12, %302 : tensor<16x14xf32>, tensor<14x14xf32>) outs(%303 : tensor<16x14xf32>) -> tensor<16x14xf32>
        %305 = index.ceildivu %c13, %56
        %306 = vector.splat %true : vector<16x11xi1>
        %expanded_40 = tensor.expand_shape %6 [[0], [1], [2, 3]] : tensor<16x11x14xi16> into tensor<16x11x14x1xi16>
        %307 = vector.broadcast %cst_0 : f32 to vector<14xf32>
        %308 = vector.contract {indexing_maps = [affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0)>], iterator_types = ["parallel", "reduction"], kind = #vector.kind<add>} %38, %66, %307 : vector<16x14xf32>, vector<16xf32> into vector<14xf32>
        %309 = math.round %303 : tensor<16x14xf32>
        %310 = vector.extract %38[8] : vector<16x14xf32>
        %311 = affine.load %33[%c11, %c3] : memref<16x14xf32>
        %312 = arith.minf %cst_2, %cst : f16
        scf.yield %true_1 : i1
      }
      %rank_36 = tensor.rank %0 : tensor<16x14xi1>
      %286 = arith.cmpf ole, %cst, %cst_2 : f16
      %287 = bufferization.clone %alloc_4 : memref<16x14xf16> to memref<16x14xf16>
      vector.print %70 : vector<6xf32>
      %288 = math.fma %17, %16, %16 : tensor<16x14xf16>
      %289 = bufferization.to_memref %20 : memref<i1>
      %290 = vector.extract_strided_slice %38 {offsets = [6], sizes = [7], strides = [1]} : vector<16x14xf32> to vector<7x14xf32>
      %291 = math.rsqrt %5 : tensor<16x14xf16>
      %292 = arith.divf %cst, %cst_2 : f16
      %293 = arith.shrui %c1508905138_i64, %c1199270634_i64 : i64
      %294 = vector.broadcast %false : i1 to vector<16xi1>
      %dest_37, %accumulated_value_38 = vector.scan <minui>, %26, %294 {inclusive = false, reduction_dim = 1 : i64} : vector<16x11xi1>, vector<16xi1>
      %inserted_39 = tensor.insert %c1581681977_i32 into %11[%c3, %c8] : tensor<16x11xi32>
      %295 = math.log2 %2 : tensor<16x11xf32>
      scf.yield %alloc_17 : memref<16x11x14xf32>
    }
    case 3 {
      %283 = affine.apply affine_map<(d0, d1, d2, d3) -> (d0)>(%c5, %c0, %c2, %c1)
      %284 = arith.remf %cst_0, %cst_0 : f32
      %285 = linalg.generic {indexing_maps = [affine_map<(d0, d1, d2) -> (d0, d1, d2)>], iterator_types = ["parallel", "parallel", "parallel"]} outs(%6 : tensor<16x11x14xi16>) {
      ^bb0(%out: i16):
        %300 = index.sizeof
        %301 = math.copysign %7, %7 : tensor<16x11xf16>
        %302 = arith.ceildivsi %c614314845_i64, %c1199270634_i64 : i64
        %303 = arith.minf %cst, %cst : f16
        %304 = arith.addf %cst_0, %cst_0 : f32
        %305 = vector.broadcast %cst_0 : f32 to vector<14xf32>
        %306 = vector.contract {indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d0)>], iterator_types = ["parallel", "reduction"], kind = #vector.kind<mul>} %66, %39, %305 : vector<16xf32>, vector<16x14xf32> into vector<14xf32>
        %307 = vector.bitcast %38 : vector<16x14xf32> to vector<16x14xf32>
        %308 = math.atan2 %16, %5 : tensor<16x14xf16>
        %309 = math.expm1 %7 : tensor<16x11xf16>
        %310 = tensor.empty() : tensor<16x14xi32>
        %311 = math.fpowi %5, %310 : tensor<16x14xf16>, tensor<16x14xi32>
        %312 = arith.addf %cst, %cst_2 : f16
        %alloc_36 = memref.alloc() : memref<i1>
        memref.tensor_store %20, %alloc_36 : memref<i1>
        bufferization.dealloc_tensor %10 : tensor<16x14xi1>
        %313 = tensor.empty() : tensor<16x14xi1>
        %314 = linalg.matmul ins(%0, %27 : tensor<16x14xi1>, tensor<14x14xi1>) outs(%313 : tensor<16x14xi1>) -> tensor<16x14xi1>
        %315 = vector.broadcast %true_1 : i1 to vector<11xi1>
        %316 = vector.insert %315, %26 [2] : vector<11xi1> into vector<16x11xi1>
        %317 = index.sizeof
        %318 = math.round %15 : tensor<16x11x14xf32>
        %319 = arith.cmpf ogt, %cst_0, %cst_0 : f32
        memref.assume_alignment %alloc_15, 1 : memref<16x11xi32>
        %cst_37 = arith.constant 0x4E66E659 : f32
        %320 = vector.broadcast %true_1 : i1 to vector<13xi1>
        %321 = vector.maskedload %alloc_11[%c13, %c7], %320, %320 : memref<16x11xi1>, vector<13xi1>, vector<13xi1> into vector<13xi1>
        %322 = index.add %c1, %c5
        %323 = math.exp2 %5 : tensor<16x14xf16>
        %324 = math.round %7 : tensor<16x11xf16>
        %325 = memref.atomic_rmw assign %cst, %alloc_9[%c15, %c1] : (f16, memref<16x14xf16>) -> f16
        %326 = math.ctpop %c1508905138_i64 : i64
        %327 = arith.floordivsi %out, %c-23065_i16 : i16
        %328 = index.ceildivu %c4, %322
        %329 = index.casts %c5 : index to i32
        %330 = vector.extract %320[10] : vector<13xi1>
        %331 = tensor.empty() : tensor<16x14xi1>
        %332 = linalg.matmul ins(%0, %27 : tensor<16x14xi1>, tensor<14x14xi1>) outs(%331 : tensor<16x14xi1>) -> tensor<16x14xi1>
        %alloca = memref.alloca() : memref<16x11xf32>
        linalg.yield %c-23065_i16 : i16
      } -> tensor<16x11x14xi16>
      %286 = vector.broadcast %cst : f16 to vector<f16>
      vector.transfer_write %286, %alloc_9[%c1, %c0] : vector<f16>, memref<16x14xf16>
      %287 = math.powf %7, %7 : tensor<16x11xf16>
      %288 = vector.broadcast %cst_0 : f32 to vector<14x14xf32>
      %289 = vector.contract {indexing_maps = [affine_map<(d0, d1, d2) -> (d2, d0)>, affine_map<(d0, d1, d2) -> (d2, d1)>, affine_map<(d0, d1, d2) -> (d0, d1)>], iterator_types = ["parallel", "parallel", "reduction"], kind = #vector.kind<mul>} %38, %39, %288 : vector<16x14xf32>, vector<16x14xf32> into vector<14x14xf32>
      %290 = affine.if affine_set<(d0, d1) : (d1 * 4 - (d0 * 2) mod 64 >= 0, (d1 * 4) floordiv 32 >= 0, d1 * 4 - (d0 * 2) mod 64 == 0, d1 * 4 - (d0 * 2) mod 64 >= 0)>(%c7, %c5) -> memref<16x11xi32> {
        %300 = tensor.empty() : tensor<14x14xi32>
        %301 = math.fpowi %14, %300 : tensor<14x14xf16>, tensor<14x14xi32>
        %alloc_36 = memref.alloc() : memref<16x14xi16>
        %302 = vector.broadcast %c18917_i16 : i16 to vector<16x11x14xi16>
        %303 = vector.broadcast %false : i1 to vector<16x11x14xi1>
        %304 = vector.broadcast %c766674261_i32 : i32 to vector<16x11x14xi32>
        %305 = vector.gather %alloc_36[%c1, %c10] [%304], %303, %302 : memref<16x14xi16>, vector<16x11x14xi32>, vector<16x11x14xi1>, vector<16x11x14xi16> into vector<16x11x14xi16>
        %306 = math.roundeven %7 : tensor<16x11xf16>
        %307 = index.castu %c928860611_i32 : i32 to index
        %308 = arith.cmpf ogt, %cst_0, %cst_0 : f32
        %309 = arith.addf %cst_2, %cst : f16
        %310 = index.add %c15, %c7
        %rank_37 = tensor.rank %8 : tensor<16x14xi1>
        affine.yield %alloc_15 : memref<16x11xi32>
      } else {
        %300 = index.add %62, %56
        %301 = affine.apply affine_map<(d0) -> (d0 floordiv 4)>(%62)
        %302 = arith.minui %false, %true : i1
        %303 = math.fpowi %7, %11 : tensor<16x11xf16>, tensor<16x11xi32>
        %304 = math.ctpop %11 : tensor<16x11xi32>
        %305 = bufferization.clone %34 : memref<16x11xi1> to memref<16x11xi1>
        %306 = memref.atomic_rmw addf %cst_0, %alloc_6[%c8, %c3] : (f32, memref<16x11xf32>) -> f32
        %307 = math.expm1 %cst_2 : f16
        affine.yield %alloc_15 : memref<16x11xi32>
      }
      %291 = arith.minui %false, %true : i1
      %292 = index.maxu %c14, %30
      %293 = math.atan2 %7, %7 : tensor<16x11xf16>
